; ModuleID = 'chess'
source_filename = "chess"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%Fen = type { %Board, %Option.0, i32, i8, i8, i8, i8 }
%Board = type { [8 x [8 x %Piece]] }
%Piece = type { i32, i32 }
%Option.0 = type { <2 x i32>, i8 }
%"char[]" = type { ptr, i64 }
%Vector2 = type { float, float }
%List = type { i64, i64, %any, ptr }
%any = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%Color = type { i8, i8, i8, i8 }
%Ctx = type { i32, i32, i32, i32 }
%Texture = type { i32, i32, i32, i32, i32 }
%BoardRow = type { ptr, i32, i8 }
%Move = type { <2 x i32>, %Option.0 }
%Rectangle = type { float, float, float, float }
%Option = type { %Move, i8 }
%"char[][]" = type { ptr, i64 }
%Image = type { ptr, i32, i32, i32, i32 }
%"any[]" = type { ptr, i64 }

$.dyn_search = comdat any

$"$ct.int" = comdat any

$"$ct.fen.PieceType" = comdat any

$"fen.PieceType$xpos" = comdat any

$"fen.PieceType$piece" = comdat any

$"$ct.fen.Color" = comdat any

$"fen.Color$ypos" = comdat any

$"fen.Color$fen_turn" = comdat any

$"fen.Color$dir" = comdat any

$"fen.Color$pawn_file" = comdat any

$"$sel.acquire" = comdat any

$"$ct.ulong" = comdat any

$"$ct.fault" = comdat any

$"$ct.long" = comdat any

@chess.fen = local_unnamed_addr global %Fen zeroinitializer, align 8, !dbg !0
@chess.flip = local_unnamed_addr global i8 0, align 1, !dbg !49

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "fen", linkageName: "chess.fen", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 8)
!2 = !DIFile(filename: "main.c3", directory: "/mnt/wwn-0x50014ee26a7ba406-part1/programming/Other Projects/chess/src")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fen", scope: !2, file: !2, line: 63, size: 4288, align: 64, elements: !4, identifier: "fen.Fen")
!4 = !{!5, !30, !44, !45, !46, !47, !48}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "board", scope: !3, file: !2, line: 64, baseType: !6, size: 4096, align: 32)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "Board", scope: !3, file: !2, line: 46, size: 4096, align: 32, elements: !7, identifier: "fen.Board")
!7 = !{!8}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !6, file: !2, line: 47, baseType: !9, size: 4096, align: 32)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 4096, align: 32, elements: !28)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "Piece", scope: !2, file: !2, line: 21, size: 64, align: 32, elements: !11, identifier: "fen.Piece")
!11 = !{!12, !23}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "piece", scope: !10, file: !2, line: 22, baseType: !13, size: 32, align: 32)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PieceType", scope: !10, file: !2, line: 5, baseType: !14, size: 32, align: 32, elements: !15)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !{!16, !17, !18, !19, !20, !21, !22}
!16 = !DIEnumerator(name: "NONE", value: 0)
!17 = !DIEnumerator(name: "KING", value: 1)
!18 = !DIEnumerator(name: "QUEEN", value: 2)
!19 = !DIEnumerator(name: "BISHOP", value: 3)
!20 = !DIEnumerator(name: "KNIGHT", value: 4)
!21 = !DIEnumerator(name: "ROOK", value: 5)
!22 = !DIEnumerator(name: "PAWN", value: 6)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !10, file: !2, line: 23, baseType: !24, size: 32, align: 32, offset: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Color", scope: !10, file: !2, line: 15, baseType: !14, size: 32, align: 32, elements: !25)
!25 = !{!16, !26, !27}
!26 = !DIEnumerator(name: "WHITE", value: 1)
!27 = !DIEnumerator(name: "BLACK", value: 2)
!28 = !{!29, !29}
!29 = !DISubrange(count: 8, lowerBound: 0)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "en_passant_target", scope: !3, file: !2, line: 65, baseType: !31, size: 128, align: 64, offset: 4096)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option", scope: !32, file: !2, line: 5, size: 128, align: 64, elements: !39, identifier: "option$v2$int$.Option")
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "Move", scope: !2, file: !2, line: 6, size: 192, align: 64, elements: !33, identifier: "piece.Move")
!33 = !{!34, !38}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !32, file: !2, line: 7, baseType: !35, size: 64, align: 64)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 64, align: 32, flags: DIFlagVector, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 2, lowerBound: 0)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "capture", scope: !32, file: !2, line: 8, baseType: !31, size: 128, align: 64, offset: 64)
!39 = !{!40, !42}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !31, file: !2, line: 6, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 65, baseType: !35, align: 8)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "has", scope: !31, file: !2, line: 7, baseType: !43, size: 8, align: 8, offset: 64)
!43 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "turn", scope: !3, file: !2, line: 66, baseType: !24, size: 32, align: 32, offset: 4224)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "white_king", scope: !3, file: !2, line: 68, baseType: !43, size: 8, align: 8, offset: 4256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "white_queen", scope: !3, file: !2, line: 69, baseType: !43, size: 8, align: 8, offset: 4264)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "black_king", scope: !3, file: !2, line: 70, baseType: !43, size: 8, align: 8, offset: 4272)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "black_queen", scope: !3, file: !2, line: 71, baseType: !43, size: 8, align: 8, offset: 4280)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "flip", linkageName: "chess.flip", scope: !2, file: !2, line: 11, type: !43, isLocal: false, isDefinition: true, align: 1)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "ATLAS", linkageName: "chess.ATLAS", scope: !2, file: !2, line: 21, type: !53, isLocal: false, isDefinition: true, align: 8)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !54, identifier: "char[]")
!54 = !{!55, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !53, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !53, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !60)
!60 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "mousePos", linkageName: "chess.mousePos", scope: !2, file: !2, line: 101, type: !63, isLocal: false, isDefinition: true, align: 4)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vector2", scope: !2, file: !2, line: 38, size: 64, align: 32, elements: !64, identifier: "raylib5.rl.Vector2")
!64 = !{!65, !67}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !63, file: !2, line: 40, baseType: !66, size: 32, align: 32)
!66 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !63, file: !2, line: 41, baseType: !66, size: 32, align: 32, offset: 32)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "selected", linkageName: "chess.selected", scope: !2, file: !2, line: 102, type: !31, isLocal: false, isDefinition: true, align: 8)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "possible", linkageName: "chess.possible", scope: !2, file: !2, line: 103, type: !72, isLocal: false, isDefinition: true, align: 8)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "Possible", scope: !2, file: !2, line: 15, baseType: !73, align: 8)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !74, identifier: "std_collections_list$piece.Move$.List")
!74 = !{!75, !76, !77, !84}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !73, file: !2, line: 20, baseType: !59, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !73, file: !2, line: 21, baseType: !59, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !73, file: !2, line: 22, baseType: !78, size: 128, align: 64, offset: 128)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !79, identifier: "Allocator")
!79 = !{!80, !82}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !78, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !73, file: !2, line: 23, baseType: !85, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !86, size: 64, align: 64, dwarfAddressSpace: 0)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 15, baseType: !32, align: 8)
!87 = !{i32 2, !"Dwarf Version", i32 4}
!88 = !{i32 2, !"Debug Info Version", i32 3}
!89 = !{i32 2, !"wchar_size", i32 4}
!90 = !{i32 4, !"PIE Level", i32 2}
!91 = !{i32 4, !"PIC Level", i32 2}
!92 = !{i32 1, !"uwtable", i32 2}
!93 = !{i32 2, !"frame-pointer", i32 2}
!94 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, globals: !127, splitDebugInlining: false)
!95 = !{!96, !13, !24}
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PixelFormat", scope: !97, file: !2, line: 568, baseType: !14, size: 32, align: 32, elements: !105)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture", scope: !2, file: !2, line: 102, size: 160, align: 32, elements: !98, identifier: "raylib5.rl.Texture")
!98 = !{!99, !101, !102, !103, !104}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !97, file: !2, line: 104, baseType: !100, size: 32, align: 32)
!100 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !97, file: !2, line: 105, baseType: !14, size: 32, align: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !97, file: !2, line: 106, baseType: !14, size: 32, align: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "mipmaps", scope: !97, file: !2, line: 107, baseType: !14, size: 32, align: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !97, file: !2, line: 108, baseType: !96, size: 32, align: 32, offset: 128)
!105 = !{!16, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126}
!106 = !DIEnumerator(name: "UNCOMPRESSED_GRAYSCALE", value: 1)
!107 = !DIEnumerator(name: "UNCOMPRESSED_GRAY_ALPHA", value: 2)
!108 = !DIEnumerator(name: "UNCOMPRESSED_R5G6B5", value: 3)
!109 = !DIEnumerator(name: "UNCOMPRESSED_R8G8B8", value: 4)
!110 = !DIEnumerator(name: "UNCOMPRESSED_R5G5B5A1", value: 5)
!111 = !DIEnumerator(name: "UNCOMPRESSED_R4G4B4A4", value: 6)
!112 = !DIEnumerator(name: "UNCOMPRESSED_R8G8B8A8", value: 7)
!113 = !DIEnumerator(name: "UNCOMPRESSED_R32", value: 8)
!114 = !DIEnumerator(name: "UNCOMPRESSED_R32G32B32", value: 9)
!115 = !DIEnumerator(name: "UNCOMPRESSED_R32G32B32A32", value: 10)
!116 = !DIEnumerator(name: "COMPRESSED_DXT1_RGB", value: 11)
!117 = !DIEnumerator(name: "COMPRESSED_DXT1_RGBA", value: 12)
!118 = !DIEnumerator(name: "COMPRESSED_DXT3_RGBA", value: 13)
!119 = !DIEnumerator(name: "COMPRESSED_DXT5_RGBA", value: 14)
!120 = !DIEnumerator(name: "COMPRESSED_ETC1_RGB", value: 15)
!121 = !DIEnumerator(name: "COMPRESSED_ETC2_RGB", value: 16)
!122 = !DIEnumerator(name: "COMPRESSED_ETC2_EAC_RGBA", value: 17)
!123 = !DIEnumerator(name: "COMPRESSED_PVRT_RGB", value: 18)
!124 = !DIEnumerator(name: "COMPRESSED_PVRT_RGBA", value: 19)
!125 = !DIEnumerator(name: "COMPRESSED_ASTC_4X4_RGBA", value: 20)
!126 = !DIEnumerator(name: "COMPRESSED_ASTC_8X8_RGBA", value: 21)
!127 = !{!0, !49, !51, !61, !68, !70}
!128 = distinct !DISubprogram(name: "getColor", linkageName: "chess.getColor", scope: !2, file: !2, line: 13, type: !129, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !94, retainedNodes: !137)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !14, !14}
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", scope: !2, file: !2, line: 74, size: 32, align: 8, elements: !132, identifier: "raylib5.rl.Color")
!132 = !{!133, !134, !135, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !131, file: !2, line: 76, baseType: !57, size: 8, align: 8)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !131, file: !2, line: 77, baseType: !57, size: 8, align: 8, offset: 8)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !131, file: !2, line: 78, baseType: !57, size: 8, align: 8, offset: 16)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !131, file: !2, line: 79, baseType: !57, size: 8, align: 8, offset: 24)
!137 = !{}
!138 = !DILocalVariable(name: "x", arg: 1, scope: !128, file: !2, line: 13, type: !14)
!139 = !DILocation(line: 13, column: 27, scope: !128)
!140 = !DILocalVariable(name: "y", arg: 2, scope: !128, file: !2, line: 13, type: !14)
!141 = !DILocation(line: 13, column: 34, scope: !128)
!142 = !DILocation(line: 14, column: 9, scope: !128)
!143 = !DILocation(line: 14, column: 18, scope: !128)
!144 = !DILocation(line: 15, column: 16, scope: !145)
!145 = distinct !DILexicalBlock(scope: !128, file: !2, line: 14, column: 25)
!146 = !DILocation(line: 17, column: 16, scope: !147)
!147 = distinct !DILexicalBlock(scope: !128, file: !2, line: 16, column: 12)
!148 = distinct !DISubprogram(name: "createTile", linkageName: "chess.createTile", scope: !2, file: !2, line: 23, type: !149, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !94, retainedNodes: !137)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !151, !97, !151, !35, !14, !14}
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ctx", scope: !2, file: !2, line: 2, size: 128, align: 32, elements: !152, identifier: "grids.Ctx")
!152 = !{!153, !154, !155, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "global_width", scope: !151, file: !2, line: 3, baseType: !14, size: 32, align: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "global_height", scope: !151, file: !2, line: 4, baseType: !14, size: 32, align: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !151, file: !2, line: 5, baseType: !14, size: 32, align: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !151, file: !2, line: 6, baseType: !14, size: 32, align: 32, offset: 96)
!157 = !DILocalVariable(name: "context", arg: 1, scope: !148, file: !2, line: 23, type: !151)
!158 = !DILocation(line: 23, column: 31, scope: !148)
!159 = !DILocalVariable(name: "tex", arg: 2, scope: !148, file: !2, line: 23, type: !160)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "Texture2D", scope: !2, file: !2, line: 112, baseType: !97, align: 4)
!161 = !DILocation(line: 23, column: 54, scope: !148)
!162 = !DILocalVariable(name: "texContext", arg: 3, scope: !148, file: !2, line: 23, type: !151)
!163 = !DILocation(line: 23, column: 70, scope: !148)
!164 = !DILocalVariable(name: "size", arg: 4, scope: !148, file: !2, line: 23, type: !35)
!165 = !DILocation(line: 23, column: 91, scope: !148)
!166 = !DILocalVariable(name: "x", arg: 5, scope: !148, file: !2, line: 23, type: !14)
!167 = !DILocation(line: 23, column: 101, scope: !148)
!168 = !DILocalVariable(name: "y", arg: 6, scope: !148, file: !2, line: 23, type: !14)
!169 = !DILocation(line: 23, column: 108, scope: !148)
!170 = !DILocalVariable(name: "drawX", scope: !148, file: !2, line: 24, type: !14, align: 4)
!171 = !DILocation(line: 24, column: 9, scope: !148)
!172 = !DILocation(line: 24, column: 17, scope: !148)
!173 = !DILocalVariable(name: "drawY", scope: !148, file: !2, line: 25, type: !14, align: 4)
!174 = !DILocation(line: 25, column: 9, scope: !148)
!175 = !DILocation(line: 25, column: 17, scope: !148)
!176 = !DILocation(line: 26, column: 8, scope: !148)
!177 = !DILocation(line: 27, column: 19, scope: !178)
!178 = distinct !DILexicalBlock(scope: !148, file: !2, line: 26, column: 14)
!179 = !DILocation(line: 27, column: 17, scope: !178)
!180 = !DILocation(line: 28, column: 19, scope: !178)
!181 = !DILocation(line: 28, column: 17, scope: !178)
!182 = !DILocalVariable(name: "pos", scope: !148, file: !2, line: 30, type: !35, align: 8)
!183 = !DILocation(line: 30, column: 14, scope: !148)
!184 = !DILocation(line: 30, column: 35, scope: !148)
!185 = !DILocation(line: 30, column: 42, scope: !148)
!186 = !DILocation(line: 30, column: 20, scope: !148)
!187 = !DILocation(line: 31, column: 23, scope: !148)
!188 = !DILocation(line: 31, column: 30, scope: !148)
!189 = !DILocation(line: 31, column: 37, scope: !148)
!190 = !DILocation(line: 31, column: 45, scope: !148)
!191 = !DILocation(line: 31, column: 65, scope: !148)
!192 = !DILocation(line: 31, column: 53, scope: !148)
!193 = !DILocation(line: 31, column: 5, scope: !148)
!194 = !DILocation(line: 32, column: 8, scope: !148)
!195 = !DILocalVariable(name: "s", scope: !196, file: !2, line: 33, type: !35, align: 8)
!196 = distinct !DILexicalBlock(scope: !148, file: !2, line: 32, column: 27)
!197 = !DILocation(line: 33, column: 18, scope: !196)
!198 = !DILocation(line: 33, column: 22, scope: !196)
!199 = !DILocation(line: 34, column: 12, scope: !196)
!200 = !DILocation(line: 34, column: 19, scope: !196)
!201 = !DILocation(line: 34, column: 24, scope: !196)
!202 = !DILocation(line: 34, column: 31, scope: !196)
!203 = !DILocation(line: 35, column: 31, scope: !204)
!204 = distinct !DILexicalBlock(scope: !196, file: !2, line: 34, column: 34)
!205 = !DILocation(line: 35, column: 38, scope: !204)
!206 = !DILocation(line: 35, column: 45, scope: !204)
!207 = !DILocation(line: 35, column: 53, scope: !204)
!208 = !DILocation(line: 35, column: 61, scope: !204)
!209 = !DILocation(line: 35, column: 13, scope: !204)
!210 = !DILocalVariable(name: "s", scope: !148, file: !2, line: 38, type: !14, align: 4)
!211 = !DILocation(line: 38, column: 9, scope: !148)
!212 = !DILocation(line: 38, column: 13, scope: !148)
!213 = !DILocation(line: 39, column: 18, scope: !148)
!214 = !DILocation(line: 39, column: 8, scope: !148)
!215 = !DILocation(line: 39, column: 21, scope: !148)
!216 = !DILocation(line: 40, column: 13, scope: !217)
!217 = distinct !DILexicalBlock(scope: !148, file: !2, line: 39, column: 39)
!218 = !DILocation(line: 42, column: 16, scope: !219)
!219 = distinct !DILexicalBlock(scope: !148, file: !2, line: 42, column: 5)
!220 = !DILocalVariable(name: ".temp", scope: !219, file: !2, line: 42, type: !59, align: 8)
!221 = !DILocalVariable(name: "p", scope: !222, file: !2, line: 42, type: !86, align: 8)
!222 = distinct !DILexicalBlock(scope: !219, file: !2, line: 42, column: 26)
!223 = !DILocation(line: 42, column: 13, scope: !222)
!224 = !DILocation(line: 378, column: 26, scope: !225, inlinedAt: !223)
!225 = distinct !DILexicalBlock(scope: !227, file: !226, line: 379, column: 1)
!226 = !DIFile(filename: "list.c3", directory: "/usr/lib/c3c/lib/std/collections")
!227 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !226, file: !226, line: 378, scopeLine: 378, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94)
!228 = !DILocation(line: 376, column: 11, scope: !225, inlinedAt: !223)
!229 = !DILocation(line: 376, column: 19, scope: !225, inlinedAt: !223)
!230 = !DILocation(line: 42, column: 13, scope: !225, inlinedAt: !223)
!231 = !DILocation(line: 380, column: 9, scope: !227, inlinedAt: !223)
!232 = !DILocation(line: 380, column: 22, scope: !227, inlinedAt: !223)
!233 = !DILocation(line: 43, column: 12, scope: !234)
!234 = distinct !DILexicalBlock(scope: !222, file: !2, line: 42, column: 26)
!235 = !DILocation(line: 43, column: 23, scope: !234)
!236 = !DILocation(line: 43, column: 28, scope: !234)
!237 = !DILocation(line: 43, column: 39, scope: !234)
!238 = !DILocation(line: 44, column: 28, scope: !239)
!239 = distinct !DILexicalBlock(scope: !234, file: !2, line: 43, column: 42)
!240 = !DILocation(line: 44, column: 36, scope: !239)
!241 = !DILocation(line: 44, column: 48, scope: !239)
!242 = !DILocation(line: 44, column: 56, scope: !239)
!243 = !DILocation(line: 44, column: 74, scope: !239)
!244 = !DILocation(line: 44, column: 81, scope: !239)
!245 = !DILocation(line: 44, column: 66, scope: !239)
!246 = !DILocation(line: 44, column: 84, scope: !239)
!247 = !DILocation(line: 44, column: 13, scope: !239)
!248 = !DILocation(line: 45, column: 13, scope: !239)
!249 = !DILocation(line: 48, column: 25, scope: !148)
!250 = !DILocation(line: 48, column: 15, scope: !148)
!251 = !DILocation(line: 48, column: 28, scope: !148)
!252 = !DILocation(line: 48, column: 60, scope: !148)
!253 = !DILocation(line: 48, column: 5, scope: !148)
!254 = distinct !DISubprogram(name: "createTiles", linkageName: "chess.createTiles", scope: !2, file: !2, line: 51, type: !255, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !94, retainedNodes: !137)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !151, !97, !151}
!257 = !DILocalVariable(name: "context", arg: 1, scope: !254, file: !2, line: 51, type: !151)
!258 = !DILocation(line: 51, column: 32, scope: !254)
!259 = !DILocalVariable(name: "tex", arg: 2, scope: !254, file: !2, line: 51, type: !160)
!260 = !DILocation(line: 51, column: 55, scope: !254)
!261 = !DILocalVariable(name: "texContext", arg: 3, scope: !254, file: !2, line: 51, type: !151)
!262 = !DILocation(line: 51, column: 71, scope: !254)
!263 = !DILocalVariable(name: "size", scope: !254, file: !2, line: 52, type: !35, align: 8)
!264 = !DILocation(line: 52, column: 14, scope: !254)
!265 = !DILocation(line: 52, column: 40, scope: !254)
!266 = !DILocation(line: 52, column: 21, scope: !254)
!267 = !DILocalVariable(name: "x", scope: !268, file: !2, line: 53, type: !14, align: 4)
!268 = distinct !DILexicalBlock(scope: !254, file: !2, line: 53, column: 5)
!269 = !DILocation(line: 53, column: 13, scope: !268)
!270 = !DILocation(line: 53, column: 17, scope: !268)
!271 = !DILocation(line: 53, column: 20, scope: !268)
!272 = !DILocation(line: 53, column: 24, scope: !268)
!273 = !DILocalVariable(name: "y", scope: !274, file: !2, line: 54, type: !14, align: 4)
!274 = distinct !DILexicalBlock(scope: !275, file: !2, line: 54, column: 9)
!275 = distinct !DILexicalBlock(scope: !268, file: !2, line: 53, column: 44)
!276 = !DILocation(line: 54, column: 17, scope: !274)
!277 = !DILocation(line: 54, column: 21, scope: !274)
!278 = !DILocation(line: 54, column: 24, scope: !274)
!279 = !DILocation(line: 54, column: 28, scope: !274)
!280 = !DILocation(line: 55, column: 59, scope: !281)
!281 = distinct !DILexicalBlock(scope: !274, file: !2, line: 54, column: 49)
!282 = !DILocation(line: 55, column: 13, scope: !281)
!283 = !DILocation(line: 54, column: 44, scope: !274)
!284 = !DILocation(line: 53, column: 39, scope: !268)
!285 = distinct !DISubprogram(name: "getContextFromTexture", linkageName: "chess.getContextFromTexture", scope: !2, file: !2, line: 60, type: !286, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !94, retainedNodes: !137)
!286 = !DISubroutineType(types: !287)
!287 = !{!151, !97}
!288 = !DILocalVariable(name: "tex", arg: 1, scope: !285, file: !2, line: 60, type: !160)
!289 = !DILocation(line: 60, column: 51, scope: !285)
!290 = !DILocation(line: 62, column: 18, scope: !285)
!291 = !DILocation(line: 63, column: 19, scope: !285)
!292 = !DILocation(line: 64, column: 25, scope: !285)
!293 = !DILocation(line: 65, column: 26, scope: !285)
!294 = distinct !DISubprogram(name: "getSpriteSrc", linkageName: "chess.getSpriteSrc", scope: !2, file: !2, line: 69, type: !295, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !94, retainedNodes: !137)
!295 = !DISubroutineType(types: !296)
!296 = !{!297, !10, !97, !151}
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rectangle", scope: !2, file: !2, line: 83, size: 128, align: 32, elements: !298, identifier: "raylib5.rl.Rectangle")
!298 = !{!299, !300, !301, !302}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !297, file: !2, line: 85, baseType: !66, size: 32, align: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !297, file: !2, line: 86, baseType: !66, size: 32, align: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !297, file: !2, line: 87, baseType: !66, size: 32, align: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !297, file: !2, line: 88, baseType: !66, size: 32, align: 32, offset: 96)
!303 = !DILocalVariable(name: "piece", arg: 1, scope: !294, file: !2, line: 69, type: !10)
!304 = !DILocation(line: 69, column: 37, scope: !294)
!305 = !DILocalVariable(name: "tex", arg: 2, scope: !294, file: !2, line: 69, type: !160)
!306 = !DILocation(line: 69, column: 58, scope: !294)
!307 = !DILocalVariable(name: "context", arg: 3, scope: !294, file: !2, line: 69, type: !151)
!308 = !DILocation(line: 69, column: 74, scope: !294)
!309 = !DILocalVariable(name: "x", scope: !294, file: !2, line: 70, type: !14, align: 4)
!310 = !DILocation(line: 70, column: 9, scope: !294)
!311 = !DILocation(line: 70, column: 13, scope: !294)
!312 = !DILocalVariable(name: "y", scope: !294, file: !2, line: 71, type: !14, align: 4)
!313 = !DILocation(line: 71, column: 9, scope: !294)
!314 = !DILocation(line: 71, column: 13, scope: !294)
!315 = !DILocation(line: 73, column: 29, scope: !294)
!316 = !DILocation(line: 73, column: 14, scope: !294)
!317 = !DILocation(line: 74, column: 29, scope: !294)
!318 = !DILocation(line: 74, column: 14, scope: !294)
!319 = !DILocation(line: 75, column: 38, scope: !294)
!320 = !DILocation(line: 75, column: 18, scope: !294)
!321 = !DILocation(line: 76, column: 40, scope: !294)
!322 = !DILocation(line: 76, column: 19, scope: !294)
!323 = distinct !DISubprogram(name: "drawPiece", linkageName: "chess.drawPiece", scope: !2, file: !2, line: 80, type: !324, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !94, retainedNodes: !137)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !10, !14, !14, !151, !97, !151}
!326 = !DILocalVariable(name: "piece", arg: 1, scope: !323, file: !2, line: 80, type: !10)
!327 = !DILocation(line: 80, column: 30, scope: !323)
!328 = !DILocalVariable(name: "x", arg: 2, scope: !323, file: !2, line: 80, type: !14)
!329 = !DILocation(line: 80, column: 41, scope: !323)
!330 = !DILocalVariable(name: "y", arg: 3, scope: !323, file: !2, line: 80, type: !14)
!331 = !DILocation(line: 80, column: 48, scope: !323)
!332 = !DILocalVariable(name: "context", arg: 4, scope: !323, file: !2, line: 80, type: !151)
!333 = !DILocation(line: 80, column: 62, scope: !323)
!334 = !DILocalVariable(name: "tex", arg: 5, scope: !323, file: !2, line: 80, type: !160)
!335 = !DILocation(line: 80, column: 85, scope: !323)
!336 = !DILocalVariable(name: "texContext", arg: 6, scope: !323, file: !2, line: 80, type: !151)
!337 = !DILocation(line: 80, column: 101, scope: !323)
!338 = !DILocation(line: 81, column: 9, scope: !323)
!339 = !DILocation(line: 81, column: 47, scope: !323)
!340 = !DILocation(line: 81, column: 85, scope: !323)
!341 = !DILocalVariable(name: "pos", scope: !323, file: !2, line: 82, type: !35, align: 8)
!342 = !DILocation(line: 82, column: 14, scope: !323)
!343 = !DILocation(line: 82, column: 35, scope: !323)
!344 = !DILocation(line: 82, column: 38, scope: !323)
!345 = !DILocation(line: 82, column: 20, scope: !323)
!346 = !DILocalVariable(name: "size", scope: !323, file: !2, line: 83, type: !35, align: 8)
!347 = !DILocation(line: 83, column: 14, scope: !323)
!348 = !DILocation(line: 83, column: 40, scope: !323)
!349 = !DILocation(line: 83, column: 21, scope: !323)
!350 = !DILocalVariable(name: "src", scope: !323, file: !2, line: 84, type: !297, align: 4)
!351 = !DILocation(line: 84, column: 19, scope: !323)
!352 = !DILocation(line: 84, column: 50, scope: !323)
!353 = !DILocation(line: 84, column: 25, scope: !323)
!354 = !DILocalVariable(name: "dest", scope: !323, file: !2, line: 85, type: !297, align: 4)
!355 = !DILocation(line: 85, column: 19, scope: !323)
!356 = !DILocation(line: 86, column: 14, scope: !323)
!357 = !DILocation(line: 87, column: 14, scope: !323)
!358 = !DILocation(line: 88, column: 18, scope: !323)
!359 = !DILocation(line: 89, column: 19, scope: !323)
!360 = !DILocation(line: 91, column: 5, scope: !323)
!361 = distinct !DISubprogram(name: "place", linkageName: "chess.place", scope: !2, file: !2, line: 105, type: !362, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !94, retainedNodes: !137)
!362 = !DISubroutineType(types: !363)
!363 = !{null, !35}
!364 = !DILocalVariable(name: "n", arg: 1, scope: !361, file: !2, line: 105, type: !35)
!365 = !DILocation(line: 105, column: 24, scope: !361)
!366 = !DILocation(line: 106, column: 18, scope: !361)
!367 = !DILocation(line: 106, column: 8, scope: !361)
!368 = !DILocation(line: 106, column: 23, scope: !361)
!369 = !DILocation(line: 107, column: 9, scope: !370)
!370 = distinct !DILexicalBlock(scope: !361, file: !2, line: 106, column: 58)
!371 = !DILocation(line: 108, column: 9, scope: !370)
!372 = !DILocation(line: 109, column: 15, scope: !370)
!373 = !DILocation(line: 111, column: 39, scope: !361)
!374 = !DILocation(line: 111, column: 16, scope: !361)
!375 = !DILocation(line: 112, column: 40, scope: !361)
!376 = !DILocation(line: 112, column: 16, scope: !361)
!377 = distinct !DISubprogram(name: "contains", linkageName: "chess.contains", scope: !2, file: !2, line: 116, type: !378, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !94, retainedNodes: !137)
!378 = !DISubroutineType(types: !379)
!379 = !{!380, !73, !32}
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option", scope: !2, file: !2, line: 5, size: 256, align: 64, elements: !381, identifier: "option$piece.Move$.Option")
!381 = !{!382, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !380, file: !2, line: 6, baseType: !383, size: 192, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 116, baseType: !32, align: 8)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "has", scope: !380, file: !2, line: 7, baseType: !43, size: 8, align: 8, offset: 192)
!385 = !DILocalVariable(name: "possible", arg: 1, scope: !377, file: !2, line: 116, type: !72)
!386 = !DILocation(line: 116, column: 57, scope: !377)
!387 = !DILocalVariable(name: "move", arg: 2, scope: !377, file: !2, line: 116, type: !32)
!388 = !DILocation(line: 116, column: 79, scope: !377)
!389 = !DILocation(line: 117, column: 16, scope: !390)
!390 = distinct !DILexicalBlock(scope: !377, file: !2, line: 117, column: 5)
!391 = !DILocalVariable(name: ".temp", scope: !390, file: !2, line: 117, type: !59, align: 8)
!392 = !DILocalVariable(name: "p", scope: !393, file: !2, line: 117, type: !86, align: 8)
!393 = distinct !DILexicalBlock(scope: !390, file: !2, line: 117, column: 26)
!394 = !DILocation(line: 117, column: 13, scope: !393)
!395 = !DILocation(line: 378, column: 26, scope: !396, inlinedAt: !394)
!396 = distinct !DILexicalBlock(scope: !397, file: !226, line: 379, column: 1)
!397 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !226, file: !226, line: 378, scopeLine: 378, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94)
!398 = !DILocation(line: 376, column: 11, scope: !396, inlinedAt: !394)
!399 = !DILocation(line: 376, column: 19, scope: !396, inlinedAt: !394)
!400 = !DILocation(line: 117, column: 13, scope: !396, inlinedAt: !394)
!401 = !DILocation(line: 380, column: 9, scope: !397, inlinedAt: !394)
!402 = !DILocation(line: 380, column: 22, scope: !397, inlinedAt: !394)
!403 = !DILocation(line: 118, column: 12, scope: !404)
!404 = distinct !DILexicalBlock(scope: !393, file: !2, line: 117, column: 26)
!405 = !DILocation(line: 119, column: 20, scope: !406)
!406 = distinct !DILexicalBlock(scope: !404, file: !2, line: 118, column: 23)
!407 = distinct !DISubprogram(name: "handle_move", linkageName: "chess.handle_move", scope: !2, file: !2, line: 125, type: !408, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !94, retainedNodes: !137)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !35, !35}
!410 = !DILocalVariable(name: "from", arg: 1, scope: !407, file: !2, line: 125, type: !35)
!411 = !DILocation(line: 125, column: 30, scope: !407)
!412 = !DILocalVariable(name: "to", arg: 2, scope: !407, file: !2, line: 125, type: !35)
!413 = !DILocation(line: 125, column: 45, scope: !407)
!414 = !DILocalVariable(name: "m", scope: !407, file: !2, line: 126, type: !380, align: 8)
!415 = !DILocation(line: 126, column: 33, scope: !407)
!416 = !DILocation(line: 127, column: 20, scope: !407)
!417 = !DILocation(line: 126, column: 37, scope: !407)
!418 = !DILocation(line: 129, column: 8, scope: !407)
!419 = !DILocation(line: 129, column: 14, scope: !407)
!420 = !DILocation(line: 129, column: 22, scope: !407)
!421 = !DILocalVariable(name: "move", scope: !422, file: !2, line: 130, type: !32, align: 8)
!422 = distinct !DILexicalBlock(scope: !407, file: !2, line: 129, column: 34)
!423 = !DILocation(line: 130, column: 21, scope: !422)
!424 = !DILocation(line: 130, column: 28, scope: !422)
!425 = !DILocation(line: 131, column: 12, scope: !422)
!426 = !DILocalVariable(name: "np", scope: !427, file: !2, line: 132, type: !35, align: 8)
!427 = distinct !DILexicalBlock(scope: !422, file: !2, line: 131, column: 35)
!428 = !DILocation(line: 132, column: 22, scope: !427)
!429 = !DILocation(line: 132, column: 27, scope: !427)
!430 = !DILocation(line: 133, column: 23, scope: !427)
!431 = !DILocation(line: 133, column: 13, scope: !427)
!432 = !DILocation(line: 133, column: 29, scope: !427)
!433 = !DILocation(line: 135, column: 19, scope: !422)
!434 = !DILocation(line: 135, column: 9, scope: !422)
!435 = !DILocation(line: 135, column: 25, scope: !422)
!436 = !DILocation(line: 135, column: 43, scope: !422)
!437 = !DILocation(line: 135, column: 33, scope: !422)
!438 = !DILocation(line: 135, column: 51, scope: !422)
!439 = !DILocation(line: 136, column: 19, scope: !422)
!440 = !DILocation(line: 136, column: 9, scope: !422)
!441 = !DILocation(line: 136, column: 27, scope: !422)
!442 = !DILocation(line: 138, column: 5, scope: !407)
!443 = !DILocation(line: 139, column: 5, scope: !407)
!444 = distinct !DISubprogram(name: "main", linkageName: "chess.main", scope: !2, file: !2, line: 142, type: !445, scopeLine: 142, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !94, retainedNodes: !137)
!445 = !DISubroutineType(types: !446)
!446 = !{!14, !447}
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !448, identifier: "String[]")
!448 = !{!449, !452}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !447, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !451, size: 64, align: 64, dwarfAddressSpace: 0)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !53)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !447, baseType: !59, size: 64, align: 64, offset: 64)
!453 = !DILocalVariable(name: "args", arg: 1, scope: !444, file: !2, line: 142, type: !447)
!454 = !DILocation(line: 142, column: 22, scope: !444)
!455 = !DILocation(line: 143, column: 5, scope: !444)
!456 = !DILocalVariable(name: "img", scope: !444, file: !2, line: 144, type: !457, align: 8)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", scope: !2, file: !2, line: 92, size: 192, align: 64, elements: !458, identifier: "raylib5.rl.Image")
!458 = !{!459, !460, !461, !462, !463}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !457, file: !2, line: 94, baseType: !81, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !457, file: !2, line: 95, baseType: !14, size: 32, align: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !457, file: !2, line: 96, baseType: !14, size: 32, align: 32, offset: 96)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "mipmaps", scope: !457, file: !2, line: 97, baseType: !14, size: 32, align: 32, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !457, file: !2, line: 98, baseType: !96, size: 32, align: 32, offset: 160)
!464 = !DILocation(line: 144, column: 15, scope: !444)
!465 = !DILocation(line: 144, column: 60, scope: !444)
!466 = !DILocation(line: 144, column: 21, scope: !444)
!467 = !DILocalVariable(name: "tex", scope: !444, file: !2, line: 145, type: !160, align: 4)
!468 = !DILocation(line: 145, column: 19, scope: !444)
!469 = !DILocation(line: 145, column: 25, scope: !444)
!470 = !DILocalVariable(name: "texContext", scope: !444, file: !2, line: 146, type: !151, align: 4)
!471 = !DILocation(line: 146, column: 16, scope: !444)
!472 = !DILocation(line: 146, column: 29, scope: !444)
!473 = !DILocation(line: 147, column: 24, scope: !444)
!474 = !DILocation(line: 147, column: 11, scope: !444)
!475 = !DILocation(line: 148, column: 5, scope: !444)
!476 = !DILocalVariable(name: "context", scope: !444, file: !2, line: 149, type: !151, align: 4)
!477 = !DILocation(line: 149, column: 16, scope: !444)
!478 = !DILocation(line: 155, column: 5, scope: !444)
!479 = !DILocation(line: 155, column: 12, scope: !480)
!480 = distinct !DILexicalBlock(scope: !444, file: !2, line: 155, column: 5)
!481 = !DILocation(line: 156, column: 9, scope: !482)
!482 = distinct !DILexicalBlock(scope: !480, file: !2, line: 155, column: 37)
!483 = !DILocation(line: 157, column: 20, scope: !482)
!484 = !DILocation(line: 158, column: 13, scope: !482)
!485 = !DILocalVariable(name: "n", scope: !486, file: !2, line: 159, type: !35, align: 8)
!486 = distinct !DILexicalBlock(scope: !482, file: !2, line: 158, column: 61)
!487 = !DILocation(line: 159, column: 22, scope: !486)
!488 = !DILocation(line: 159, column: 59, scope: !486)
!489 = !DILocation(line: 159, column: 85, scope: !486)
!490 = !DILocation(line: 159, column: 26, scope: !486)
!491 = !DILocation(line: 160, column: 16, scope: !486)
!492 = !DILocation(line: 161, column: 17, scope: !493)
!493 = distinct !DILexicalBlock(scope: !486, file: !2, line: 160, column: 22)
!494 = !DILocation(line: 161, column: 25, scope: !493)
!495 = !DILocation(line: 161, column: 23, scope: !493)
!496 = !DILocation(line: 162, column: 17, scope: !493)
!497 = !DILocation(line: 162, column: 25, scope: !493)
!498 = !DILocation(line: 162, column: 23, scope: !493)
!499 = !DILocation(line: 164, column: 16, scope: !486)
!500 = !DILocalVariable(name: "o", scope: !501, file: !2, line: 165, type: !35, align: 8)
!501 = distinct !DILexicalBlock(scope: !486, file: !2, line: 164, column: 35)
!502 = !DILocation(line: 165, column: 26, scope: !501)
!503 = !DILocation(line: 165, column: 30, scope: !501)
!504 = !DILocation(line: 166, column: 32, scope: !501)
!505 = !DILocation(line: 166, column: 17, scope: !501)
!506 = !DILocation(line: 168, column: 23, scope: !507)
!507 = distinct !DILexicalBlock(scope: !486, file: !2, line: 167, column: 20)
!508 = !DILocation(line: 168, column: 17, scope: !507)
!509 = !DILocation(line: 171, column: 9, scope: !482)
!510 = !DILocation(line: 172, column: 9, scope: !482)
!511 = !DILocation(line: 174, column: 5, scope: !444)
!512 = !DILocation(line: 175, column: 9, scope: !444)
!513 = distinct !DISubprogram(name: "_$main", linkageName: "main", scope: !2, file: !2, line: 142, type: !514, scopeLine: 142, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !94, retainedNodes: !137)
!514 = !DISubroutineType(types: !515)
!515 = !{!14, !14, !516}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char**", baseType: !56, size: 64, align: 64, dwarfAddressSpace: 0)
!517 = !DILocalVariable(name: ".anon", arg: 1, scope: !513, file: !2, line: 142, type: !14)
!518 = !DILocation(line: 142, column: 8, scope: !513)
!519 = !DILocalVariable(name: ".anon", arg: 2, scope: !513, file: !2, line: 142, type: !516)
!520 = !DILocalVariable(name: "list", scope: !521, file: !2, line: 45, type: !447, align: 8)
