; ModuleID = 'piece'
source_filename = "piece"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%Move = type { <2 x i32>, %Option }
%Option = type { <2 x i32>, i8 }
%List = type { i64, i64, %any, ptr }
%any = type { ptr, i64 }
%Fen = type { %Board, %Option, i32, i8, i8, i8, i8 }
%Board = type { [8 x [8 x %Piece]] }
%Piece = type { i32, i32 }
%"int[<2>][]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%BoardRow = type { ptr, i32, i8 }

$"$ct.piece.Move" = comdat any

$"$ct.ulong" = comdat any

$"$ct.int" = comdat any

$"$ct.fen.Color" = comdat any

$"fen.Color$ypos" = comdat any

$"fen.Color$fen_turn" = comdat any

$"fen.Color$dir" = comdat any

$"fen.Color$pawn_file" = comdat any

@"$ct.piece.Move" = linkonce global %.introspect { i8 9, i64 0, ptr null, i64 24, i64 0, i64 2, [0 x i64] zeroinitializer }, comdat, align 8
@"$ct.ulong" = linkonce global %.introspect { i8 3, i64 0, ptr null, i64 8, i64 0, i64 0, [0 x i64] zeroinitializer }, comdat, align 8
@.panic_msg = internal constant [60 x i8] c"Array index out of bounds (array had size %d, index was %d)\00", align 1
@.file = internal constant [9 x i8] c"piece.c3\00", align 1
@.func = internal constant [5 x i8] c"getS\00", align 1

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIE Level", i32 2}
!4 = !{i32 4, !"PIC Level", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = !{i32 2, !"frame-pointer", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !8, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, splitDebugInlining: false)
!8 = !DIFile(filename: "piece.c3", directory: "/mnt/wwn-0x50014ee26a7ba406-part1/programming/Other Projects/chess/src")
!9 = !{!10, !15}
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PieceType", scope: !11, file: !8, line: 5, baseType: !16, size: 32, align: 32, elements: !21)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "Piece", scope: !8, file: !8, line: 21, size: 64, align: 32, elements: !12, identifier: "fen.Piece")
!12 = !{!13, !14}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "piece", scope: !11, file: !8, line: 22, baseType: !10, size: 32, align: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !11, file: !8, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Color", scope: !11, file: !8, line: 15, baseType: !16, size: 32, align: 32, elements: !17)
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !{!18, !19, !20}
!18 = !DIEnumerator(name: "NONE", value: 0)
!19 = !DIEnumerator(name: "WHITE", value: 1)
!20 = !DIEnumerator(name: "BLACK", value: 2)
!21 = !{!18, !22, !23, !24, !25, !26, !27}
!22 = !DIEnumerator(name: "KING", value: 1)
!23 = !DIEnumerator(name: "QUEEN", value: 2)
!24 = !DIEnumerator(name: "BISHOP", value: 3)
!25 = !DIEnumerator(name: "KNIGHT", value: 4)
!26 = !DIEnumerator(name: "ROOK", value: 5)
!27 = !DIEnumerator(name: "PAWN", value: 6)
!28 = distinct !DISubprogram(name: "add_self", linkageName: "piece.Move.add_self", scope: !8, file: !8, line: 11, type: !29, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !45)
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !32, !33}
!31 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Move*", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "Move", scope: !8, file: !8, line: 6, size: 192, align: 64, elements: !34, identifier: "piece.Move")
!34 = !{!35, !39}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !33, file: !8, line: 7, baseType: !36, size: 64, align: 64)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, align: 32, flags: DIFlagVector, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 2, lowerBound: 0)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "capture", scope: !33, file: !8, line: 8, baseType: !40, size: 128, align: 64, offset: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option", scope: !33, file: !8, line: 5, size: 128, align: 64, elements: !41, identifier: "option$v2$int$.Option")
!41 = !{!42, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !40, file: !8, line: 6, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !8, file: !8, line: 65, baseType: !36, align: 8)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "has", scope: !40, file: !8, line: 7, baseType: !31, size: 8, align: 8, offset: 64)
!45 = !{}
!46 = !DILocation(line: 11, column: 56, scope: !28)
!47 = !DILocalVariable(name: "self", arg: 1, scope: !28, file: !8, line: 11, type: !32)
!48 = !DILocation(line: 11, column: 23, scope: !28)
!49 = !DILocalVariable(name: "other", arg: 2, scope: !28, file: !8, line: 11, type: !33)
!50 = !DILocation(line: 11, column: 35, scope: !28)
!51 = !DILocation(line: 12, column: 12, scope: !28)
!52 = !DILocation(line: 12, column: 24, scope: !28)
!53 = distinct !DISubprogram(name: "getS", linkageName: "piece.getS", scope: !8, file: !8, line: 17, type: !54, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !45)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !73, !36, !15, !88}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "Possible", scope: !8, file: !8, line: 15, baseType: !57, align: 8)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !8, file: !8, line: 18, size: 320, align: 64, elements: !58, identifier: "std_collections_list$piece.Move$.List")
!58 = !{!59, !62, !63, !70}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !57, file: !8, line: 20, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !61)
!61 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !57, file: !8, line: 21, baseType: !60, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !57, file: !8, line: 22, baseType: !64, size: 128, align: 64, offset: 128)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !65, identifier: "Allocator")
!65 = !{!66, !68}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !64, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !64, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !57, file: !8, line: 23, baseType: !71, size: 64, align: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !72, size: 64, align: 64, dwarfAddressSpace: 0)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !8, file: !8, line: 15, baseType: !33, align: 8)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fen", scope: !8, file: !8, line: 63, size: 4288, align: 64, elements: !74, identifier: "fen.Fen")
!74 = !{!75, !82, !83, !84, !85, !86, !87}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "board", scope: !73, file: !8, line: 64, baseType: !76, size: 4096, align: 32)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "Board", scope: !73, file: !8, line: 46, size: 4096, align: 32, elements: !77, identifier: "fen.Board")
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !76, file: !8, line: 47, baseType: !79, size: 4096, align: 32)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 4096, align: 32, elements: !80)
!80 = !{!81, !81}
!81 = !DISubrange(count: 8, lowerBound: 0)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "en_passant_target", scope: !73, file: !8, line: 65, baseType: !40, size: 128, align: 64, offset: 4096)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "turn", scope: !73, file: !8, line: 66, baseType: !15, size: 32, align: 32, offset: 4224)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "white_king", scope: !73, file: !8, line: 68, baseType: !31, size: 8, align: 8, offset: 4256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "white_queen", scope: !73, file: !8, line: 69, baseType: !31, size: 8, align: 8, offset: 4264)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "black_king", scope: !73, file: !8, line: 70, baseType: !31, size: 8, align: 8, offset: 4272)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "black_queen", scope: !73, file: !8, line: 71, baseType: !31, size: 8, align: 8, offset: 4280)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "int[<2>][]", size: 128, align: 64, elements: !89, identifier: "int[<2>][]")
!89 = !{!90, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !88, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "int[<2>]*", baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !88, baseType: !60, size: 64, align: 64, offset: 64)
!93 = !DILocalVariable(name: "fen", arg: 1, scope: !53, file: !8, line: 17, type: !73)
!94 = !DILocation(line: 17, column: 27, scope: !53)
!95 = !DILocalVariable(name: "pos", arg: 2, scope: !53, file: !8, line: 17, type: !36)
!96 = !DILocation(line: 17, column: 41, scope: !53)
!97 = !DILocalVariable(name: "color", arg: 3, scope: !53, file: !8, line: 17, type: !15)
!98 = !DILocation(line: 17, column: 57, scope: !53)
!99 = !DILocalVariable(name: "dirs", arg: 4, scope: !53, file: !8, line: 17, type: !88)
!100 = !DILocation(line: 17, column: 75, scope: !53)
!101 = !DILocalVariable(name: "list", scope: !53, file: !8, line: 18, type: !56, align: 8)
!102 = !DILocation(line: 18, column: 14, scope: !53)
!103 = !DILocation(line: 19, column: 16, scope: !104)
!104 = distinct !DILexicalBlock(scope: !53, file: !8, line: 19, column: 5)
!105 = !DILocalVariable(name: ".temp", scope: !104, file: !8, line: 19, type: !60, align: 8)
!106 = !DILocalVariable(name: "d", scope: !107, file: !8, line: 19, type: !36, align: 8)
!107 = distinct !DILexicalBlock(scope: !104, file: !8, line: 19, column: 22)
!108 = !DILocation(line: 19, column: 13, scope: !107)
!109 = !DILocation(line: 19, column: 16, scope: !107)
!110 = !DILocalVariable(name: "x", scope: !111, file: !8, line: 20, type: !16, align: 4)
!111 = distinct !DILexicalBlock(scope: !107, file: !8, line: 19, column: 22)
!112 = !DILocation(line: 20, column: 13, scope: !111)
!113 = !DILocation(line: 20, column: 17, scope: !111)
!114 = !DILocalVariable(name: "y", scope: !111, file: !8, line: 21, type: !16, align: 4)
!115 = !DILocation(line: 21, column: 13, scope: !111)
!116 = !DILocation(line: 21, column: 17, scope: !111)
!117 = !DILocation(line: 22, column: 9, scope: !111)
!118 = !DILocation(line: 23, column: 13, scope: !119)
!119 = distinct !DILexicalBlock(scope: !120, file: !8, line: 22, column: 21)
!120 = distinct !DILexicalBlock(scope: !111, file: !8, line: 22, column: 9)
!121 = !DILocation(line: 23, column: 18, scope: !119)
!122 = !DILocation(line: 24, column: 13, scope: !119)
!123 = !DILocation(line: 24, column: 17, scope: !119)
!124 = !DILocation(line: 25, column: 16, scope: !119)
!125 = !DILocation(line: 25, column: 25, scope: !119)
!126 = !DILocation(line: 25, column: 35, scope: !119)
!127 = !DILocation(line: 25, column: 44, scope: !119)
!128 = !DILocation(line: 26, column: 17, scope: !129)
!129 = distinct !DILexicalBlock(scope: !119, file: !8, line: 25, column: 52)
!130 = !DILocation(line: 28, column: 26, scope: !119)
!131 = !DILocation(line: 28, column: 16, scope: !119)
!132 = !DILocation(line: 28, column: 29, scope: !119)
!133 = !DILocation(line: 29, column: 30, scope: !134)
!134 = distinct !DILexicalBlock(scope: !119, file: !8, line: 28, column: 47)
!135 = !DILocation(line: 29, column: 20, scope: !134)
!136 = !DILocation(line: 29, column: 33, scope: !134)
!137 = !DILocation(line: 29, column: 45, scope: !134)
!138 = !DILocation(line: 31, column: 33, scope: !139)
!139 = distinct !DILexicalBlock(scope: !134, file: !8, line: 29, column: 52)
!140 = !DILocation(line: 31, column: 36, scope: !139)
!141 = !DILocation(line: 32, column: 60, scope: !139)
!142 = !DILocation(line: 32, column: 63, scope: !139)
!143 = !DILocation(line: 32, column: 36, scope: !139)
!144 = !DILocation(line: 30, column: 21, scope: !139)
!145 = !DILocation(line: 35, column: 17, scope: !134)
!146 = !DILocation(line: 38, column: 25, scope: !119)
!147 = !DILocation(line: 38, column: 28, scope: !119)
!148 = !DILocation(line: 37, column: 13, scope: !119)
!149 = !DILocation(line: 42, column: 12, scope: !53)
!150 = distinct !DISubprogram(name: "getROOK", linkageName: "piece.getROOK", scope: !8, file: !8, line: 46, type: !151, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !45)
!151 = !DISubroutineType(types: !152)
!152 = !{!56, !73, !36, !15}
