; ModuleID = 'std::thread::threadpool'
source_filename = "std::thread::threadpool"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%FixedThreadPool = type { %NativeMutex, %"QueueItem[]", i64, i64, i8, %"NativeThread[]", [6 x i64] }
%NativeMutex = type { [5 x i64], i8 }
%"QueueItem[]" = type { ptr, i64 }
%"NativeThread[]" = type { ptr, i64 }
%NativeThread = type { ptr, ptr, ptr }
%QueueItem = type { ptr, %"any[]" }

$std.thread.threadpool.FixedThreadPool.init = comdat any

$std.thread.threadpool.FixedThreadPool.destroy = comdat any

$std.thread.threadpool.FixedThreadPool.stop_and_destroy = comdat any

$std.thread.threadpool.FixedThreadPool.push = comdat any

$.dyn_search = comdat any

$"$ct.std.thread.threadpool.FixedThreadPool" = comdat any

$"$ct.std.thread.threadpool.QueueItem" = comdat any

$"$ct.fault" = comdat any

$"$ct.ulong" = comdat any

$"$sel.acquire" = comdat any

$std.thread.THREAD_QUEUE_FULL = comdat any

@"$ct.std.thread.threadpool.FixedThreadPool" = linkonce global %.introspect { i8 9, i64 0, ptr null, i64 152, i64 0, i64 7, [0 x i64] zeroinitializer }, comdat, align 8

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIE Level", i32 2}
!4 = !{i32 4, !"PIC Level", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = !{i32 2, !"frame-pointer", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !8, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!8 = !DIFile(filename: "fixed_pool.c3", directory: "/usr/lib/c3c/lib/std/threads")
!9 = distinct !DISubprogram(name: "init", linkageName: "std.thread.threadpool.FixedThreadPool.init", scope: !8, file: !8, line: 37, type: !10, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !83)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !14, !15, !25, !25}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !13)
!13 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "FixedThreadPool*", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "FixedThreadPool", scope: !8, file: !8, line: 11, size: 1216, align: 64, elements: !17, identifier: "std.thread.threadpool.FixedThreadPool")
!17 = !{!18, !30, !55, !56, !57, !59, !77}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !16, file: !8, line: 13, baseType: !19, size: 384, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mutex", scope: !8, file: !8, line: 11, baseType: !20, align: 8)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "NativeMutex", scope: !8, file: !8, line: 4, size: 384, align: 64, elements: !21, identifier: "std.thread.os.NativeMutex")
!21 = !{!22, !28}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !20, file: !8, line: 6, baseType: !23, size: 320, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pthread_mutex_t", scope: !8, file: !8, line: 108, baseType: !24, align: 8)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 320, align: 64, elements: !26)
!25 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!27}
!27 = !DISubrange(count: 5, lowerBound: 0)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !20, file: !8, line: 7, baseType: !29, size: 8, align: 8, offset: 320)
!29 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !16, file: !8, line: 14, baseType: !31, size: 128, align: 64, offset: 384)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueItem[]", size: 128, align: 64, elements: !32, identifier: "QueueItem[]")
!32 = !{!33, !54}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !31, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "QueueItem*", baseType: !35, size: 64, align: 64, dwarfAddressSpace: 0)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueItem", scope: !8, file: !8, line: 26, size: 192, align: 64, elements: !36, identifier: "std.thread.threadpool.QueueItem")
!36 = !{!37, !53}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !35, file: !8, line: 28, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadPoolFn", scope: !8, file: !8, line: 9, baseType: !39, align: 8)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ThreadPoolFn", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !42}
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !43, identifier: "any[]")
!43 = !{!44, !51}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !42, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !46, size: 64, align: 64, dwarfAddressSpace: 0)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !47, identifier: "any")
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !46, baseType: !14, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !46, baseType: !50, size: 64, align: 64, offset: 64)
!50 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !42, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !25)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !35, file: !8, line: 29, baseType: !42, size: 128, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !31, baseType: !52, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "qindex", scope: !16, file: !8, line: 15, baseType: !52, size: 64, align: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads", scope: !16, file: !8, line: 16, baseType: !52, size: 64, align: 64, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_member, scope: !16, file: !8, line: 17, baseType: !58, size: 8, align: 8, offset: 640)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !16, file: !8, line: 22, baseType: !60, size: 128, align: 64, offset: 704)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread[]", size: 128, align: 64, elements: !61, identifier: "Thread[]")
!61 = !{!62, !76}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !60, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Thread*", baseType: !64, size: 64, align: 64, dwarfAddressSpace: 0)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "Thread", scope: !8, file: !8, line: 16, baseType: !65, align: 8)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "NativeThread", scope: !8, file: !8, line: 14, size: 192, align: 64, elements: !66, identifier: "std.thread.os.NativeThread")
!66 = !{!67, !69, !75}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "pthread", scope: !65, file: !8, line: 16, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pthread_t", scope: !8, file: !8, line: 10, baseType: !14, align: 8)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "thread_fn", scope: !65, file: !8, line: 17, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFn", scope: !8, file: !8, line: 20, baseType: !71, align: 8)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ThreadFn", baseType: !72, size: 64, align: 64, dwarfAddressSpace: 0)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !14}
!74 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !65, file: !8, line: 18, baseType: !14, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !60, baseType: !52, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !16, file: !8, line: 23, baseType: !78, size: 384, align: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConditionVariable", scope: !8, file: !8, line: 15, baseType: !79, align: 8)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pthread_cond_t", scope: !8, file: !8, line: 105, baseType: !80, align: 8)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 384, align: 64, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 6, lowerBound: 0)
!83 = !{}
!84 = !DILocation(line: 38, column: 1, scope: !9)
!85 = !DILocalVariable(name: "self", arg: 1, scope: !9, file: !8, line: 37, type: !15)
!86 = !DILocation(line: 37, column: 31, scope: !9)
!87 = !DILocalVariable(name: "threads", arg: 2, scope: !9, file: !8, line: 37, type: !52)
!88 = !DILocation(line: 37, column: 42, scope: !9)
!89 = !DILocalVariable(name: "queue_size", arg: 3, scope: !9, file: !8, line: 37, type: !52)
!90 = !DILocation(line: 37, column: 55, scope: !9)
!91 = !DILocation(line: 33, column: 12, scope: !92)
!92 = distinct !DILexicalBlock(scope: !9, file: !8, line: 38, column: 1)
!93 = !DILocation(line: 33, column: 11, scope: !92)
!94 = !DILocation(line: 34, column: 11, scope: !92)
!95 = !DILocation(line: 34, column: 26, scope: !92)
!96 = !DILocation(line: 35, column: 11, scope: !92)
!97 = !DILocation(line: 39, column: 6, scope: !9)
!98 = !DILocation(line: 39, column: 36, scope: !9)
!99 = !DILocation(line: 41, column: 9, scope: !9)
!100 = !DILocation(line: 42, column: 3, scope: !9)
!101 = !DILocation(line: 43, column: 18, scope: !9)
!102 = !DILocation(line: 44, column: 18, scope: !9)
!103 = !DILocation(line: 303, column: 55, scope: !104, inlinedAt: !106)
!104 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !105, file: !105, line: 301, scopeLine: 301, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!105 = !DIFile(filename: "mem_allocator.c3", directory: "/usr/lib/c3c/lib/std/core")
!106 = !DILocation(line: 286, column: 9, scope: !107, inlinedAt: !108)
!107 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !105, file: !105, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!108 = !DILocation(line: 818, column: 9, scope: !109, inlinedAt: !111)
!109 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !110, file: !110, line: 816, scopeLine: 816, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!110 = !DIFile(filename: "mem.c3", directory: "/usr/lib/c3c/lib/std/core")
!111 = !DILocation(line: 45, column: 12, scope: !9)
!112 = !DILocation(line: 303, column: 40, scope: !104, inlinedAt: !106)
!113 = !DILocation(line: 79, column: 6, scope: !114, inlinedAt: !115)
!114 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !105, file: !105, line: 77, scopeLine: 77, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!115 = !DILocation(line: 303, column: 18, scope: !104, inlinedAt: !106)
!116 = !DILocation(line: 79, column: 20, scope: !114, inlinedAt: !115)
!117 = !DILocation(line: 85, column: 28, scope: !114, inlinedAt: !115)
!118 = !DILocation(line: 37, column: 12, scope: !114, inlinedAt: !115)
!119 = !DILocation(line: 973, column: 9, scope: !120, inlinedAt: !122)
!120 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !121, file: !121, line: 971, scopeLine: 971, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!121 = !DIFile(filename: "math.c3", directory: "/usr/lib/c3c/lib/std/math")
!122 = !DILocation(line: 37, column: 26, scope: !114, inlinedAt: !115)
!123 = !DILocation(line: 973, column: 20, scope: !120, inlinedAt: !122)
!124 = !DILocation(line: 973, column: 25, scope: !120, inlinedAt: !122)
!125 = !DILocation(line: 85, column: 10, scope: !114, inlinedAt: !115)
!126 = !DILocation(line: 303, column: 67, scope: !104, inlinedAt: !106)
