; ModuleID = 'std::os::env'
source_filename = "std::os::env"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%PathImp = type { %"char[]", i32, %any }

$std.os.env.get_var = comdat any

$std.os.env.tget_var = comdat any

$std.os.env.set_var = comdat any

$std.os.env.get_home_dir = comdat any

$std.os.env.get_config_dir = comdat any

$std.os.env.clear_var = comdat any

$std.os.env.executable_path = comdat any

$std.core.builtin.NOT_FOUND = comdat any

@.panic_msg = internal constant [34 x i8] c"@require \22name.len > 0\22 violated.\00", align 1
@.file = internal constant [7 x i8] c"env.c3\00", align 1
@.func = internal constant [8 x i8] c"get_var\00", align 1
@std.core.builtin.panic = extern_weak global ptr, align 8
@std.core.builtin.NOT_FOUND = linkonce constant %"char[]" { ptr @std.core.builtin.NOT_FOUND.nameof, i64 18 }, comdat, align 8
@std.core.builtin.NOT_FOUND.nameof = internal constant [19 x i8] c"builtin::NOT_FOUND\00", align 1
@std.core.mem.allocator.current_temp = extern_weak thread_local global %any, align 8
@.func.1 = internal constant [9 x i8] c"tget_var\00", align 1
@.func.2 = internal constant [8 x i8] c"set_var\00", align 1
@.str = private unnamed_addr constant [5 x i8] c"HOME\00", align 1
@.func.3 = internal constant [13 x i8] c"get_home_dir\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "DIR", linkageName: "get_config_dir.DIR", scope: !2, file: !2, line: 94, type: !3, isLocal: true, isDefinition: true, align: 8)
!2 = !DIFile(filename: "env.c3", directory: "/usr/lib/c3c/lib/std/os")
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !4)
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !5, identifier: "char[]")
!5 = !{!6, !9}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !4, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !8, size: 64, align: 64, dwarfAddressSpace: 0)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !4, baseType: !10, size: 64, align: 64, offset: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !11)
!11 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!12 = !{i32 2, !"Dwarf Version", i32 4}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{i32 2, !"wchar_size", i32 4}
!15 = !{i32 4, !"PIE Level", i32 2}
!16 = !{i32 4, !"PIC Level", i32 2}
!17 = !{i32 1, !"uwtable", i32 2}
!18 = !{i32 2, !"frame-pointer", i32 2}
!19 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !20, globals: !37, splitDebugInlining: false)
!20 = !{!21}
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !22, file: !2, line: 23, baseType: !33, size: 32, align: 32, elements: !34)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !2, file: !2, line: 16, size: 320, align: 64, elements: !23, identifier: "std.io.path.PathImp")
!23 = !{!24, !25, !26}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !22, file: !2, line: 18, baseType: !3, size: 128, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !22, file: !2, line: 19, baseType: !21, size: 32, align: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !22, file: !2, line: 20, baseType: !27, size: 128, align: 64, offset: 192)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !28, identifier: "Allocator")
!28 = !{!29, !31}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, baseType: !32, size: 64, align: 64, offset: 64)
!32 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !{!35, !36}
!35 = !DIEnumerator(name: "WIN32", value: 0)
!36 = !DIEnumerator(name: "POSIX", value: 1)
!37 = !{!0}
!38 = distinct !DISubprogram(name: "get_var", linkageName: "std.os.env.get_var", scope: !2, file: !2, line: 12, type: !39, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !44)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !43, !27, !3}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !42)
!42 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !{}
!45 = !DILocalVariable(name: "allocator", arg: 1, scope: !38, file: !2, line: 12, type: !27)
!46 = !DILocation(line: 12, column: 30, scope: !38)
!47 = !DILocalVariable(name: "name", arg: 2, scope: !38, file: !2, line: 12, type: !3)
!48 = !DILocation(line: 12, column: 48, scope: !38)
!49 = !DILocation(line: 9, column: 11, scope: !50)
!50 = distinct !DILexicalBlock(scope: !38, file: !2, line: 12, column: 57)
!51 = !DILocalVariable(name: "state", scope: !52, file: !2, line: 594, type: !54, align: 8)
!52 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !53, file: !53, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !19, retainedNodes: !44)
!53 = !DIFile(filename: "mem.c3", directory: "/usr/lib/c3c/lib/std/core")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 402, baseType: !55, align: 8)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !56, size: 64, align: 64, dwarfAddressSpace: 0)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 32, size: 512, align: 64, elements: !57, identifier: "std.core.mem.allocator.TempAllocator")
!57 = !{!58, !59, !71, !72, !74, !75, !76, !77}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !56, file: !2, line: 34, baseType: !27, size: 128, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !56, file: !2, line: 35, baseType: !60, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !61, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 52, size: 256, align: 64, elements: !62, identifier: "std.core.mem.allocator.TempAllocatorPage")
!62 = !{!63, !64, !65, !66, !67}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !61, file: !2, line: 54, baseType: !60, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !61, file: !2, line: 55, baseType: !30, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !61, file: !2, line: 56, baseType: !10, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !61, file: !2, line: 57, baseType: !10, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !61, file: !2, line: 58, baseType: !68, align: 8, offset: 256)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, align: 8, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 0, lowerBound: 0)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !56, file: !2, line: 36, baseType: !55, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !56, file: !2, line: 37, baseType: !73, size: 8, align: 8, offset: 256)
!73 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !56, file: !2, line: 38, baseType: !10, size: 64, align: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !56, file: !2, line: 39, baseType: !10, size: 64, align: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !56, file: !2, line: 40, baseType: !10, size: 64, align: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !56, file: !2, line: 41, baseType: !68, align: 8, offset: 512)
!78 = !DILocation(line: 594, column: 12, scope: !52, inlinedAt: !79)
!79 = !DILocation(line: 12, column: 57, scope: !38)
!80 = !DILocation(line: 594, column: 20, scope: !52, inlinedAt: !79)
!81 = !DILocalVariable(name: "val", scope: !82, file: !2, line: 17, type: !83, align: 8)
!82 = distinct !DILexicalBlock(scope: !38, file: !2, line: 13, column: 1)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !2, file: !2, line: 10, baseType: !7, align: 8)
!84 = !DILocation(line: 17, column: 11, scope: !82)
!85 = !DILocation(line: 17, column: 30, scope: !82)
!86 = !DILocation(line: 17, column: 17, scope: !82)
!87 = !DILocation(line: 18, column: 10, scope: !82)
!88 = !DILocation(line: 18, column: 25, scope: !82)
!89 = !DILocation(line: 18, column: 16, scope: !82)
!90 = !DILocation(line: 18, column: 38, scope: !82)
!91 = !DILocation(line: 597, column: 23, scope: !92, inlinedAt: !79)
!92 = distinct !DILexicalBlock(scope: !52, file: !53, line: 596, column: 2)
!93 = !DILocation(line: 597, column: 3, scope: !92, inlinedAt: !79)
!94 = !DILocation(line: 597, column: 23, scope: !95, inlinedAt: !79)
!95 = distinct !DILexicalBlock(scope: !52, file: !53, line: 596, column: 2)
!96 = !DILocation(line: 597, column: 3, scope: !95, inlinedAt: !79)
!97 = distinct !DISubprogram(name: "tget_var", linkageName: "std.os.env.tget_var", scope: !2, file: !2, line: 37, type: !98, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !44)
!98 = !DISubroutineType(types: !99)
!99 = !{!41, !43, !3}
!100 = !DILocalVariable(name: "name", arg: 1, scope: !97, file: !2, line: 37, type: !3)
!101 = !DILocation(line: 37, column: 28, scope: !97)
!102 = !DILocation(line: 39, column: 17, scope: !97)
!103 = !DILocation(line: 39, column: 23, scope: !97)
!104 = !DILocation(line: 9, column: 11, scope: !97)
!105 = !DILocation(line: 39, column: 9, scope: !97)
!106 = distinct !DISubprogram(name: "set_var", linkageName: "std.os.env.set_var", scope: !2, file: !2, line: 47, type: !107, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !44)
!107 = !DISubroutineType(types: !108)
!108 = !{!73, !3, !3, !73}
!109 = !DILocalVariable(name: "name", arg: 1, scope: !106, file: !2, line: 47, type: !3)
!110 = !DILocation(line: 47, column: 24, scope: !106)
!111 = !DILocalVariable(name: "value", arg: 2, scope: !106, file: !2, line: 47, type: !3)
!112 = !DILocation(line: 47, column: 37, scope: !106)
!113 = !DILocalVariable(name: "overwrite", arg: 3, scope: !106, file: !2, line: 47, type: !73)
!114 = !DILocation(line: 47, column: 49, scope: !106)
!115 = !DILocation(line: 45, column: 11, scope: !116)
!116 = distinct !DILexicalBlock(scope: !106, file: !2, line: 47, column: 70)
!117 = !DILocalVariable(name: "state", scope: !118, file: !2, line: 594, type: !54, align: 8)
!118 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !53, file: !53, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !19, retainedNodes: !44)
!119 = !DILocation(line: 594, column: 12, scope: !118, inlinedAt: !120)
!120 = !DILocation(line: 47, column: 70, scope: !106)
!121 = !DILocation(line: 594, column: 20, scope: !118, inlinedAt: !120)
!122 = !DILocation(line: 60, column: 23, scope: !123)
!123 = distinct !DILexicalBlock(scope: !106, file: !2, line: 48, column: 1)
!124 = !DILocation(line: 60, column: 42, scope: !123)
!125 = !DILocation(line: 60, column: 62, scope: !123)
!126 = !DILocation(line: 60, column: 10, scope: !123)
!127 = !DILocation(line: 597, column: 23, scope: !128, inlinedAt: !120)
!128 = distinct !DILexicalBlock(scope: !118, file: !53, line: 596, column: 2)
!129 = !DILocation(line: 597, column: 3, scope: !128, inlinedAt: !120)
