; ModuleID = 'std::os::process'
source_filename = "std::os::process"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%File = type { ptr }
%"char[][]" = type { ptr, i64 }
%SubProcess = type { ptr, ptr, ptr, i32, i32, i8 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"char*[]" = type { ptr, i64 }
%Posix_spawn_file_actions_t = type { i32, i32, ptr, [16 x i32] }

$std.os.process.SubProcess.stdout = comdat any

$std.os.process.SubProcess.stderr = comdat any

$std.os.process.SubProcess.destroy = comdat any

$std.os.process.SubProcess.terminate = comdat any

$std.os.process.SubProcess.read_stdout = comdat any

$std.os.process.SubProcess.read_stderr = comdat any

$std.os.process.SubProcess.is_running = comdat any

$std.os.process.SubProcess.join = comdat any

$std.os.process.execute_stdout_to_buffer = comdat any

$std.os.process.create = comdat any

$"$ct.std.os.process.SubProcess" = comdat any

$"$ct.std.os.process.SubProcessOptions" = comdat any

$"$ct.int" = comdat any

$std.os.process.EMPTY_ENVIRONMENT = comdat any

$"$ct.long" = comdat any

$"$ct.ulong" = comdat any

$std.os.process.FAILED_TO_INITIALIZE_ACTIONS = comdat any

$std.os.process.FAILED_TO_OPEN_STDIN = comdat any

$std.os.process.FAILED_TO_OPEN_STDOUT = comdat any

$std.os.process.FAILED_TO_OPEN_STDERR = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "EMPTY_ENVIRONMENT", linkageName: "std.os.process.EMPTY_ENVIRONMENT", scope: !2, file: !2, line: 280, type: !3, isLocal: false, isDefinition: true, align: 8)
!2 = !DIFile(filename: "subprocess.c3", directory: "/usr/lib/c3c/lib/std/os")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, align: 64, elements: !7)
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !2, file: !2, line: 10, baseType: !5, align: 8)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!6 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!7 = !{!8}
!8 = !DISubrange(count: 1, lowerBound: 0)
!9 = !{i32 2, !"Dwarf Version", i32 4}
!10 = !{i32 2, !"Debug Info Version", i32 3}
!11 = !{i32 2, !"wchar_size", i32 4}
!12 = !{i32 4, !"PIE Level", i32 2}
!13 = !{i32 4, !"PIC Level", i32 2}
!14 = !{i32 1, !"uwtable", i32 2}
!15 = !{i32 2, !"frame-pointer", i32 2}
!16 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !17, splitDebugInlining: false)
!17 = !{!0}
!18 = distinct !DISubprogram(name: "stdout", linkageName: "std.os.process.SubProcess.stdout", scope: !2, file: !2, line: 400, type: !19, scopeLine: 400, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !26}
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !2, file: !2, line: 4, size: 64, align: 64, elements: !22, identifier: "std.io.File")
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !21, file: !2, line: 6, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !2, file: !2, line: 374, baseType: !25, align: 8)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SubProcess*", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "SubProcess", scope: !2, file: !2, line: 17, size: 320, align: 64, elements: !28, identifier: "std.os.process.SubProcess")
!28 = !{!29, !30, !31, !32, !35, !36}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_file", scope: !27, file: !2, line: 19, baseType: !24, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "stdout_file", scope: !27, file: !2, line: 20, baseType: !24, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "stderr_file", scope: !27, file: !2, line: 21, baseType: !24, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !27, file: !2, line: 28, baseType: !33, size: 32, align: 32, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pid_t", scope: !2, file: !2, line: 21, baseType: !34, align: 4)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "return_status", scope: !27, file: !2, line: 29, baseType: !34, size: 32, align: 32, offset: 224)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "is_alive", scope: !27, file: !2, line: 31, baseType: !37, size: 8, align: 8, offset: 256)
!37 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!38 = !{}
!39 = !DILocation(line: 401, column: 1, scope: !18)
!40 = !DILocalVariable(name: "self", arg: 1, scope: !18, file: !2, line: 400, type: !26)
!41 = !DILocation(line: 400, column: 27, scope: !18)
!42 = !DILocation(line: 402, column: 7, scope: !18)
!43 = !DILocation(line: 403, column: 27, scope: !18)
!44 = !DILocation(line: 403, column: 9, scope: !18)
!45 = distinct !DISubprogram(name: "stderr", linkageName: "std.os.process.SubProcess.stderr", scope: !2, file: !2, line: 406, type: !19, scopeLine: 406, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!46 = !DILocation(line: 407, column: 1, scope: !45)
!47 = !DILocalVariable(name: "self", arg: 1, scope: !45, file: !2, line: 406, type: !26)
!48 = !DILocation(line: 406, column: 27, scope: !45)
!49 = !DILocation(line: 408, column: 7, scope: !45)
!50 = !DILocation(line: 409, column: 27, scope: !45)
!51 = !DILocation(line: 409, column: 9, scope: !45)
!52 = distinct !DISubprogram(name: "destroy", linkageName: "std.os.process.SubProcess.destroy", scope: !2, file: !2, line: 431, type: !53, scopeLine: 431, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!53 = !DISubroutineType(types: !54)
!54 = !{!37, !26}
!55 = !DILocation(line: 432, column: 1, scope: !52)
!56 = !DILocalVariable(name: "self", arg: 1, scope: !52, file: !2, line: 431, type: !26)
!57 = !DILocation(line: 431, column: 28, scope: !52)
!58 = !DILocation(line: 433, column: 6, scope: !52)
!59 = !DILocation(line: 433, column: 36, scope: !52)
!60 = !DILocation(line: 433, column: 23, scope: !52)
!61 = !DILocation(line: 434, column: 6, scope: !52)
!62 = !DILocation(line: 436, column: 16, scope: !63)
!63 = distinct !DILexicalBlock(scope: !52, file: !2, line: 435, column: 2)
!64 = !DILocation(line: 436, column: 3, scope: !63)
!65 = !DILocation(line: 437, column: 7, scope: !63)
!66 = !DILocation(line: 437, column: 27, scope: !63)
!67 = !DILocation(line: 437, column: 58, scope: !63)
!68 = !DILocation(line: 437, column: 45, scope: !63)
!69 = !DILocation(line: 439, column: 2, scope: !52)
!70 = !DILocation(line: 439, column: 20, scope: !52)
!71 = !DILocation(line: 439, column: 39, scope: !52)
!72 = !DILocation(line: 439, column: 58, scope: !52)
!73 = !DILocation(line: 447, column: 9, scope: !52)
!74 = distinct !DISubprogram(name: "terminate", linkageName: "std.os.process.SubProcess.terminate", scope: !2, file: !2, line: 450, type: !75, scopeLine: 450, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !25, !26}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !78)
!78 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!79 = !DILocation(line: 451, column: 1, scope: !74)
!80 = !DILocalVariable(name: "self", arg: 1, scope: !74, file: !2, line: 450, type: !26)
!81 = !DILocation(line: 450, column: 31, scope: !74)
!82 = !DILocation(line: 455, column: 19, scope: !74)
!83 = !DILocation(line: 455, column: 31, scope: !74)
!84 = !DILocation(line: 455, column: 7, scope: !74)
!85 = !DILocation(line: 455, column: 42, scope: !74)
!86 = distinct !DISubprogram(name: "read_stdout", linkageName: "std.os.process.SubProcess.read_stdout", scope: !2, file: !2, line: 495, type: !87, scopeLine: 495, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!87 = !DISubroutineType(types: !88)
!88 = !{!77, !89, !26, !5, !91}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !91)
!91 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!92 = !DILocation(line: 496, column: 1, scope: !86)
!93 = !DILocalVariable(name: "self", arg: 1, scope: !86, file: !2, line: 495, type: !26)
!94 = !DILocation(line: 495, column: 32, scope: !86)
!95 = !DILocalVariable(name: "buffer", arg: 2, scope: !86, file: !2, line: 495, type: !5)
!96 = !DILocation(line: 495, column: 45, scope: !86)
!97 = !DILocalVariable(name: "size", arg: 3, scope: !86, file: !2, line: 495, type: !90)
!98 = !DILocation(line: 495, column: 57, scope: !86)
!99 = !DILocation(line: 497, column: 7, scope: !86)
!100 = !DILocation(line: 497, column: 32, scope: !86)
!101 = !DILocation(line: 502, column: 31, scope: !86)
!102 = !DILocation(line: 502, column: 10, scope: !86)
!103 = distinct !DISubprogram(name: "read_stderr", linkageName: "std.os.process.SubProcess.read_stderr", scope: !2, file: !2, line: 507, type: !87, scopeLine: 507, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!104 = !DILocation(line: 508, column: 1, scope: !103)
!105 = !DILocalVariable(name: "self", arg: 1, scope: !103, file: !2, line: 507, type: !26)
!106 = !DILocation(line: 507, column: 32, scope: !103)
!107 = !DILocalVariable(name: "buffer", arg: 2, scope: !103, file: !2, line: 507, type: !5)
!108 = !DILocation(line: 507, column: 45, scope: !103)
!109 = !DILocalVariable(name: "size", arg: 3, scope: !103, file: !2, line: 507, type: !90)
!110 = !DILocation(line: 507, column: 57, scope: !103)
!111 = !DILocation(line: 509, column: 7, scope: !103)
!112 = !DILocation(line: 509, column: 32, scope: !103)
!113 = !DILocation(line: 514, column: 31, scope: !103)
!114 = !DILocation(line: 514, column: 10, scope: !103)
!115 = distinct !DISubprogram(name: "is_running", linkageName: "std.os.process.SubProcess.is_running", scope: !2, file: !2, line: 518, type: !116, scopeLine: 518, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!116 = !DISubroutineType(types: !117)
!117 = !{!77, !118, !26}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "bool*", baseType: !37, size: 64, align: 64, dwarfAddressSpace: 0)
!119 = !DILocation(line: 519, column: 1, scope: !115)
!120 = !DILocalVariable(name: "self", arg: 1, scope: !115, file: !2, line: 518, type: !26)
!121 = !DILocation(line: 518, column: 32, scope: !115)
!122 = !DILocation(line: 520, column: 7, scope: !115)
!123 = !DILocation(line: 520, column: 29, scope: !115)
!124 = !DILocalVariable(name: "status", scope: !115, file: !2, line: 526, type: !125, align: 4)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !2, file: !2, line: 21, baseType: !34, align: 4)
!126 = !DILocation(line: 526, column: 8, scope: !115)
!127 = !DILocalVariable(name: "is_alive", scope: !115, file: !2, line: 527, type: !37, align: 1)
!128 = !DILocation(line: 527, column: 8, scope: !115)
!129 = !DILocation(line: 527, column: 34, scope: !115)
!130 = !DILocation(line: 527, column: 55, scope: !115)
!131 = !DILocation(line: 527, column: 19, scope: !115)
!132 = !DILocation(line: 528, column: 7, scope: !115)
!133 = !DILocation(line: 528, column: 24, scope: !115)
!134 = !DILocation(line: 529, column: 3, scope: !115)
!135 = !DILocation(line: 529, column: 19, scope: !115)
!136 = !DILocation(line: 530, column: 3, scope: !115)
!137 = !DILocation(line: 44, column: 37, scope: !138, inlinedAt: !140)
!138 = distinct !DISubprogram(name: "wTERMSIG", linkageName: "wTERMSIG", scope: !139, file: !139, line: 44, scopeLine: 44, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!139 = !DIFile(filename: "process.c3", directory: "/usr/lib/c3c/lib/std/os/posix")
!140 = !DILocation(line: 46, column: 38, scope: !141, inlinedAt: !142)
!141 = distinct !DISubprogram(name: "wIFEXITED", linkageName: "wIFEXITED", scope: !139, file: !139, line: 46, scopeLine: 46, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!142 = !DILocation(line: 530, column: 24, scope: !115)
!143 = !DILocation(line: 43, column: 41, scope: !144, inlinedAt: !145)
!144 = distinct !DISubprogram(name: "wEXITSTATUS", linkageName: "wEXITSTATUS", scope: !139, file: !139, line: 43, scopeLine: 43, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!145 = !DILocation(line: 530, column: 51, scope: !115)
!146 = !DILocation(line: 530, column: 80, scope: !115)
!147 = !DILocation(line: 531, column: 3, scope: !115)
!148 = !DILocation(line: 531, column: 16, scope: !115)
!149 = !DILocation(line: 532, column: 3, scope: !115)
!150 = !DILocation(line: 533, column: 10, scope: !115)
!151 = distinct !DISubprogram(name: "join", linkageName: "std.os.process.SubProcess.join", scope: !2, file: !2, line: 384, type: !152, scopeLine: 384, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!152 = !DISubroutineType(types: !153)
!153 = !{!77, !154, !26}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CInt*", baseType: !125, size: 64, align: 64, dwarfAddressSpace: 0)
!155 = !DILocation(line: 385, column: 1, scope: !151)
!156 = !DILocalVariable(name: "self", arg: 1, scope: !151, file: !2, line: 384, type: !26)
!157 = !DILocation(line: 384, column: 26, scope: !151)
!158 = !DILocation(line: 386, column: 6, scope: !151)
!159 = !DILocation(line: 388, column: 16, scope: !160)
!160 = distinct !DILexicalBlock(scope: !151, file: !2, line: 387, column: 2)
!161 = !DILocation(line: 388, column: 3, scope: !160)
!162 = !DILocation(line: 389, column: 3, scope: !160)
!163 = !DILocation(line: 389, column: 21, scope: !160)
!164 = !DILocalVariable(name: "status", scope: !151, file: !2, line: 391, type: !125, align: 4)
!165 = !DILocation(line: 391, column: 7, scope: !151)
!166 = !DILocation(line: 392, column: 6, scope: !151)
!167 = !DILocation(line: 392, column: 20, scope: !151)
!168 = !DILocation(line: 392, column: 49, scope: !151)
!169 = !DILocation(line: 392, column: 70, scope: !151)
!170 = !DILocation(line: 392, column: 34, scope: !151)
!171 = !DILocation(line: 392, column: 81, scope: !151)
!172 = !DILocation(line: 394, column: 2, scope: !151)
!173 = !DILocation(line: 394, column: 15, scope: !151)
!174 = !DILocation(line: 395, column: 2, scope: !151)
!175 = !DILocation(line: 395, column: 18, scope: !151)
!176 = !DILocation(line: 397, column: 9, scope: !151)
!177 = !DILocation(line: 44, column: 37, scope: !178, inlinedAt: !179)
!178 = distinct !DISubprogram(name: "wTERMSIG", linkageName: "wTERMSIG", scope: !139, file: !139, line: 44, scopeLine: 44, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!179 = !DILocation(line: 46, column: 38, scope: !180, inlinedAt: !181)
!180 = distinct !DISubprogram(name: "wIFEXITED", linkageName: "wIFEXITED", scope: !139, file: !139, line: 46, scopeLine: 46, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!181 = !DILocation(line: 397, column: 30, scope: !151)
!182 = !DILocation(line: 43, column: 41, scope: !183, inlinedAt: !184)
!183 = distinct !DISubprogram(name: "wEXITSTATUS", linkageName: "wEXITSTATUS", scope: !139, file: !139, line: 43, scopeLine: 43, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!184 = !DILocation(line: 397, column: 57, scope: !151)
!185 = !DILocation(line: 397, column: 86, scope: !151)
!186 = distinct !DISubprogram(name: "execute_stdout_to_buffer", linkageName: "std.os.process.execute_stdout_to_buffer", scope: !2, file: !2, line: 293, type: !187, scopeLine: 293, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!187 = !DISubroutineType(types: !188)
!188 = !{!77, !189, !191, !195, !34, !195}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !190, size: 64, align: 64, dwarfAddressSpace: 0)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !191)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !192, identifier: "char[]")
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !191, baseType: !5, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !191, baseType: !90, size: 64, align: 64, offset: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !196, identifier: "String[]")
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !195, baseType: !189, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !195, baseType: !90, size: 64, align: 64, offset: 64)
!199 = !DILocalVariable(name: "buffer", arg: 1, scope: !186, file: !2, line: 293, type: !191)
!200 = !DILocation(line: 293, column: 44, scope: !186)
!201 = !DILocalVariable(name: "command_line", arg: 2, scope: !186, file: !2, line: 293, type: !195)
!202 = !DILocation(line: 293, column: 61, scope: !186)
!203 = !DILocalVariable(name: "options", arg: 3, scope: !186, file: !2, line: 293, type: !34)
!204 = !DILocation(line: 293, column: 93, scope: !186)
!205 = !DILocalVariable(name: "environment", arg: 4, scope: !186, file: !2, line: 293, type: !195)
!206 = !DILocation(line: 293, column: 116, scope: !186)
!207 = !DILocalVariable(name: "process", scope: !186, file: !2, line: 295, type: !27, align: 8)
!208 = !DILocation(line: 295, column: 13, scope: !186)
!209 = !DILocation(line: 295, column: 39, scope: !186)
!210 = !DILocation(line: 295, column: 53, scope: !186)
!211 = !DILocation(line: 295, column: 62, scope: !186)
!212 = !DILocation(line: 302, column: 12, scope: !186)
!213 = !DILocation(line: 302, column: 28, scope: !186)
!214 = !DILocation(line: 295, column: 23, scope: !186)
!215 = !DILocation(line: 296, column: 2, scope: !186)
!216 = !DILocalVariable(name: "len", scope: !186, file: !2, line: 297, type: !90, align: 8)
!217 = !DILocation(line: 297, column: 6, scope: !186)
!218 = !DILocation(line: 297, column: 44, scope: !186)
!219 = !DILocation(line: 297, column: 12, scope: !186)
!220 = !DILocation(line: 298, column: 17, scope: !186)
!221 = !DILocation(line: 298, column: 24, scope: !186)
!222 = !DILocation(line: 298, column: 25, scope: !186)
!223 = !DILocation(line: 298, column: 9, scope: !186)
!224 = distinct !DISubprogram(name: "tcopy_command_line", linkageName: "std.os.process.tcopy_command_line", scope: !2, file: !2, line: 269, type: !225, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16, retainedNodes: !38)
!225 = !DISubroutineType(types: !226)
!226 = !{!227, !195}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ZString*", baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!228 = !DILocalVariable(name: "command_line", arg: 1, scope: !224, file: !2, line: 269, type: !195)
!229 = !DILocation(line: 269, column: 41, scope: !224)
!230 = !DILocation(line: 267, column: 11, scope: !231)
!231 = distinct !DILexicalBlock(scope: !224, file: !2, line: 270, column: 1)
!232 = !DILocalVariable(name: "copy", scope: !224, file: !2, line: 271, type: !227, align: 8)
!233 = !DILocation(line: 271, column: 11, scope: !224)
!234 = !DILocation(line: 271, column: 45, scope: !224)
!235 = !DILocation(line: 832, column: 41, scope: !236, inlinedAt: !238)
!236 = distinct !DISubprogram(name: "talloc_array", linkageName: "talloc_array", scope: !237, file: !237, line: 830, scopeLine: 830, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!237 = !DIFile(filename: "mem.c3", directory: "/usr/lib/c3c/lib/std/core")
!238 = !DILocation(line: 271, column: 18, scope: !224)
!239 = !DILocation(line: 832, column: 26, scope: !236, inlinedAt: !238)
!240 = !DILocation(line: 832, column: 18, scope: !236, inlinedAt: !238)
!241 = !DILocation(line: 832, column: 68, scope: !236, inlinedAt: !238)
!242 = !DILocation(line: 832, column: 10, scope: !236, inlinedAt: !238)
!243 = !DILocation(line: 272, column: 20, scope: !244)
!244 = distinct !DILexicalBlock(scope: !224, file: !2, line: 272, column: 2)
!245 = !DILocalVariable(name: ".temp", scope: !244, file: !2, line: 272, type: !90, align: 8)
!246 = !DILocation(line: 272, column: 11, scope: !244)
!247 = !DILocalVariable(name: "i", scope: !248, file: !2, line: 272, type: !90, align: 8)
!248 = distinct !DILexicalBlock(scope: !244, file: !2, line: 273, column: 2)
!249 = !DILocation(line: 272, column: 11, scope: !248)
!250 = !DILocalVariable(name: "str", scope: !248, file: !2, line: 272, type: !190, align: 8)
!251 = !DILocation(line: 272, column: 14, scope: !248)
!252 = !DILocation(line: 272, column: 20, scope: !248)
!253 = !DILocation(line: 274, column: 3, scope: !254)
!254 = distinct !DILexicalBlock(scope: !248, file: !2, line: 273, column: 2)
!255 = !DILocation(line: 274, column: 8, scope: !254)
!256 = !DILocation(line: 274, column: 13, scope: !254)
!257 = !DILocation(line: 276, column: 2, scope: !224)
!258 = !DILocation(line: 276, column: 7, scope: !224)
!259 = !DILocation(line: 276, column: 27, scope: !224)
!260 = !DILocation(line: 277, column: 9, scope: !224)
!261 = distinct !DISubprogram(name: "tcopy_env", linkageName: "std.os.process.tcopy_env", scope: !2, file: !2, line: 281, type: !225, scopeLine: 281, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16, retainedNodes: !38)
!262 = !DILocalVariable(name: "environment", arg: 1, scope: !261, file: !2, line: 281, type: !195)
!263 = !DILocation(line: 281, column: 32, scope: !261)
!264 = !DILocation(line: 283, column: 6, scope: !261)
!265 = !DILocation(line: 283, column: 31, scope: !261)
!266 = !DILocalVariable(name: "copy", scope: !261, file: !2, line: 284, type: !227, align: 8)
!267 = !DILocation(line: 284, column: 11, scope: !261)
!268 = !DILocation(line: 284, column: 45, scope: !261)
!269 = !DILocation(line: 832, column: 41, scope: !270, inlinedAt: !271)
!270 = distinct !DISubprogram(name: "talloc_array", linkageName: "talloc_array", scope: !237, file: !237, line: 830, scopeLine: 830, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!271 = !DILocation(line: 284, column: 18, scope: !261)
!272 = !DILocation(line: 832, column: 26, scope: !270, inlinedAt: !271)
!273 = !DILocation(line: 832, column: 18, scope: !270, inlinedAt: !271)
!274 = !DILocation(line: 832, column: 68, scope: !270, inlinedAt: !271)
!275 = !DILocation(line: 832, column: 10, scope: !270, inlinedAt: !271)
!276 = !DILocation(line: 285, column: 2, scope: !261)
!277 = !DILocation(line: 285, column: 7, scope: !261)
!278 = !DILocation(line: 285, column: 26, scope: !261)
!279 = !DILocation(line: 286, column: 20, scope: !280)
!280 = distinct !DILexicalBlock(scope: !261, file: !2, line: 286, column: 2)
!281 = !DILocalVariable(name: ".temp", scope: !280, file: !2, line: 286, type: !90, align: 8)
!282 = !DILocation(line: 286, column: 11, scope: !280)
!283 = !DILocalVariable(name: "i", scope: !284, file: !2, line: 286, type: !90, align: 8)
!284 = distinct !DILexicalBlock(scope: !280, file: !2, line: 287, column: 2)
!285 = !DILocation(line: 286, column: 11, scope: !284)
!286 = !DILocalVariable(name: "str", scope: !284, file: !2, line: 286, type: !190, align: 8)
!287 = !DILocation(line: 286, column: 14, scope: !284)
!288 = !DILocation(line: 286, column: 20, scope: !284)
!289 = !DILocation(line: 288, column: 3, scope: !290)
!290 = distinct !DILexicalBlock(scope: !284, file: !2, line: 287, column: 2)
!291 = !DILocation(line: 288, column: 8, scope: !290)
!292 = !DILocation(line: 288, column: 13, scope: !290)
!293 = !DILocation(line: 290, column: 9, scope: !261)
!294 = distinct !DISubprogram(name: "create", linkageName: "std.os.process.create", scope: !2, file: !2, line: 304, type: !295, scopeLine: 304, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!295 = !DISubroutineType(types: !296)
!296 = !{!77, !26, !195, !34, !195}
!297 = !DILocalVariable(name: "command_line", arg: 1, scope: !294, file: !2, line: 304, type: !195)
!298 = !DILocation(line: 304, column: 32, scope: !294)
!299 = !DILocalVariable(name: "options", arg: 2, scope: !294, file: !2, line: 304, type: !34)
!300 = !DILocation(line: 304, column: 64, scope: !294)
!301 = !DILocalVariable(name: "environment", arg: 3, scope: !294, file: !2, line: 304, type: !195)
!302 = !DILocation(line: 304, column: 87, scope: !294)
!303 = !DILocation(line: 302, column: 12, scope: !304)
!304 = distinct !DILexicalBlock(scope: !294, file: !2, line: 305, column: 1)
!305 = !DILocation(line: 302, column: 28, scope: !304)
!306 = !DILocation(line: 302, column: 11, scope: !304)
!307 = !DILocalVariable(name: "stdinfd", scope: !294, file: !2, line: 306, type: !308, align: 4)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 64, align: 32, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 2, lowerBound: 0)
!311 = !DILocation(line: 306, column: 10, scope: !294)
!312 = !DILocalVariable(name: "stdoutfd", scope: !294, file: !2, line: 307, type: !308, align: 4)
!313 = !DILocation(line: 307, column: 10, scope: !294)
!314 = !DILocalVariable(name: "stderrfd", scope: !294, file: !2, line: 308, type: !308, align: 4)
!315 = !DILocation(line: 308, column: 10, scope: !294)
!316 = !DILocalVariable(name: "stdin", scope: !294, file: !2, line: 309, type: !24, align: 8)
!317 = !DILocation(line: 309, column: 8, scope: !294)
!318 = !DILocation(line: 309, column: 16, scope: !294)
!319 = !DILocalVariable(name: "stdout", scope: !294, file: !2, line: 310, type: !24, align: 8)
!320 = !DILocation(line: 310, column: 8, scope: !294)
!321 = !DILocation(line: 310, column: 17, scope: !294)
!322 = !DILocalVariable(name: "stderr", scope: !294, file: !2, line: 311, type: !24, align: 8)
!323 = !DILocation(line: 311, column: 8, scope: !294)
!324 = !DILocation(line: 311, column: 17, scope: !294)
!325 = !DILocalVariable(name: "actions", scope: !294, file: !2, line: 313, type: !326, align: 8)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "Posix_spawn_file_actions_t", scope: !2, file: !2, line: 4, size: 640, align: 64, elements: !327, identifier: "std.os.posix.Posix_spawn_file_actions_t")
!327 = !{!328, !329, !330, !331}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__allocated", scope: !326, file: !2, line: 6, baseType: !34, size: 32, align: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__used", scope: !326, file: !2, line: 7, baseType: !34, size: 32, align: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__actions", scope: !326, file: !2, line: 8, baseType: !25, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !326, file: !2, line: 9, baseType: !332, size: 512, align: 32, offset: 128)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 512, align: 32, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 16, lowerBound: 0)
!335 = !DILocation(line: 313, column: 29, scope: !294)
!336 = !DILocation(line: 314, column: 6, scope: !294)
!337 = !DILocation(line: 314, column: 55, scope: !294)
!338 = !DILocation(line: 318, column: 7, scope: !294)
!339 = !DILocation(line: 320, column: 7, scope: !340)
!340 = distinct !DILexicalBlock(scope: !294, file: !2, line: 319, column: 2)
!341 = !DILocation(line: 315, column: 8, scope: !342)
!342 = distinct !DILexicalBlock(scope: !294, file: !2, line: 315, column: 8)
!343 = !DILocation(line: 321, column: 7, scope: !340)
!344 = !DILocation(line: 315, column: 8, scope: !345)
!345 = distinct !DILexicalBlock(scope: !294, file: !2, line: 315, column: 8)
!346 = !DILocation(line: 322, column: 8, scope: !340)
!347 = !DILocation(line: 322, column: 42, scope: !340)
!348 = !DILocation(line: 315, column: 8, scope: !349)
!349 = distinct !DILexicalBlock(scope: !294, file: !2, line: 315, column: 8)
!350 = !DILocation(line: 324, column: 60, scope: !340)
!351 = !DILocation(line: 324, column: 7, scope: !340)
!352 = !DILocation(line: 315, column: 8, scope: !353)
!353 = distinct !DILexicalBlock(scope: !294, file: !2, line: 315, column: 8)
!354 = !DILocation(line: 325, column: 63, scope: !340)
!355 = !DILocation(line: 325, column: 7, scope: !340)
!356 = !DILocation(line: 315, column: 8, scope: !357)
!357 = distinct !DILexicalBlock(scope: !294, file: !2, line: 315, column: 8)
!358 = !DILocation(line: 326, column: 61, scope: !340)
!359 = !DILocation(line: 326, column: 7, scope: !340)
!360 = !DILocation(line: 315, column: 8, scope: !361)
!361 = distinct !DILexicalBlock(scope: !294, file: !2, line: 315, column: 8)
!362 = !DILocation(line: 327, column: 60, scope: !340)
!363 = !DILocation(line: 327, column: 64, scope: !340)
!364 = !DILocation(line: 327, column: 7, scope: !340)
!365 = !DILocation(line: 315, column: 8, scope: !366)
!366 = distinct !DILexicalBlock(scope: !294, file: !2, line: 315, column: 8)
!367 = !DILocation(line: 329, column: 7, scope: !340)
!368 = !DILocation(line: 331, column: 8, scope: !369)
!369 = distinct !DILexicalBlock(scope: !340, file: !2, line: 330, column: 3)
!370 = !DILocation(line: 315, column: 8, scope: !371)
!371 = distinct !DILexicalBlock(scope: !294, file: !2, line: 315, column: 8)
!372 = !DILocation(line: 335, column: 62, scope: !373)
!373 = distinct !DILexicalBlock(scope: !340, file: !2, line: 334, column: 3)
!374 = !DILocation(line: 335, column: 8, scope: !373)
!375 = !DILocation(line: 315, column: 8, scope: !376)
!376 = distinct !DILexicalBlock(scope: !294, file: !2, line: 315, column: 8)
!377 = !DILocation(line: 336, column: 61, scope: !373)
!378 = !DILocation(line: 336, column: 65, scope: !373)
!379 = !DILocation(line: 336, column: 8, scope: !373)
!380 = !DILocation(line: 315, column: 8, scope: !381)
!381 = distinct !DILexicalBlock(scope: !294, file: !2, line: 315, column: 8)
!382 = !DILocalVariable(name: "child", scope: !294, file: !2, line: 340, type: !33, align: 4)
!383 = !DILocation(line: 340, column: 8, scope: !294)
!384 = !DILocalVariable(name: "state", scope: !385, file: !2, line: 594, type: !386, align: 8)
!385 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !237, file: !237, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16, retainedNodes: !38)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 402, baseType: !387, align: 8)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !388, size: 64, align: 64, dwarfAddressSpace: 0)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 32, size: 512, align: 64, elements: !389, identifier: "std.core.mem.allocator.TempAllocator")
!389 = !{!390, !396, !408, !409, !410, !411, !412, !413}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !388, file: !2, line: 34, baseType: !391, size: 128, align: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !392, identifier: "Allocator")
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !391, baseType: !25, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !391, baseType: !395, size: 64, align: 64, offset: 64)
!395 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !388, file: !2, line: 35, baseType: !397, size: 64, align: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !398, size: 64, align: 64, dwarfAddressSpace: 0)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 52, size: 256, align: 64, elements: !399, identifier: "std.core.mem.allocator.TempAllocatorPage")
!399 = !{!400, !401, !402, !403, !404}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !398, file: !2, line: 54, baseType: !397, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !398, file: !2, line: 55, baseType: !25, size: 64, align: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !398, file: !2, line: 56, baseType: !90, size: 64, align: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !398, file: !2, line: 57, baseType: !90, size: 64, align: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !398, file: !2, line: 58, baseType: !405, align: 8, offset: 256)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, align: 8, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 0, lowerBound: 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !388, file: !2, line: 36, baseType: !387, size: 64, align: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !388, file: !2, line: 37, baseType: !37, size: 8, align: 8, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !388, file: !2, line: 38, baseType: !90, size: 64, align: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !388, file: !2, line: 39, baseType: !90, size: 64, align: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !388, file: !2, line: 40, baseType: !90, size: 64, align: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !388, file: !2, line: 41, baseType: !405, align: 8, offset: 512)
!414 = !DILocation(line: 594, column: 12, scope: !385, inlinedAt: !415)
!415 = !DILocation(line: 341, column: 2, scope: !294)
!416 = !DILocation(line: 594, column: 20, scope: !385, inlinedAt: !415)
!417 = !DILocalVariable(name: "command_line_copy", scope: !418, file: !2, line: 343, type: !227, align: 8)
!418 = distinct !DILexicalBlock(scope: !294, file: !2, line: 342, column: 2)
!419 = !DILocation(line: 343, column: 12, scope: !418)
!420 = !DILocation(line: 343, column: 51, scope: !418)
!421 = !DILocation(line: 267, column: 11, scope: !418)
!422 = !DILocation(line: 343, column: 32, scope: !418)
!423 = !DILocalVariable(name: "used_environment", scope: !418, file: !2, line: 344, type: !227, align: 8)
!424 = !DILocation(line: 344, column: 12, scope: !418)
!425 = !DILocation(line: 344, column: 31, scope: !418)
!426 = !DILocation(line: 344, column: 61, scope: !418)
!427 = !DILocation(line: 344, column: 88, scope: !418)
!428 = !DILocation(line: 344, column: 78, scope: !418)
!429 = !DILocation(line: 345, column: 7, scope: !418)
!430 = !DILocation(line: 347, column: 30, scope: !431)
!431 = distinct !DILexicalBlock(scope: !418, file: !2, line: 346, column: 3)
!432 = !DILocation(line: 347, column: 87, scope: !431)
!433 = !DILocation(line: 347, column: 8, scope: !431)
!434 = !DILocation(line: 597, column: 23, scope: !435, inlinedAt: !415)
!435 = distinct !DILexicalBlock(scope: !385, file: !237, line: 596, column: 2)
!436 = !DILocation(line: 597, column: 3, scope: !435, inlinedAt: !415)
!437 = !DILocation(line: 315, column: 8, scope: !438)
!438 = distinct !DILexicalBlock(scope: !294, file: !2, line: 315, column: 8)
!439 = !DILocation(line: 351, column: 30, scope: !440)
!440 = distinct !DILexicalBlock(scope: !418, file: !2, line: 350, column: 3)
!441 = !DILocation(line: 351, column: 87, scope: !440)
!442 = !DILocation(line: 351, column: 8, scope: !440)
!443 = !DILocation(line: 597, column: 23, scope: !444, inlinedAt: !415)
!444 = distinct !DILexicalBlock(scope: !385, file: !237, line: 596, column: 2)
!445 = !DILocation(line: 597, column: 3, scope: !444, inlinedAt: !415)
!446 = !DILocation(line: 315, column: 8, scope: !447)
!447 = distinct !DILexicalBlock(scope: !294, file: !2, line: 315, column: 8)
!448 = !DILocation(line: 597, column: 23, scope: !449, inlinedAt: !415)
!449 = distinct !DILexicalBlock(scope: !385, file: !237, line: 596, column: 2)
!450 = !DILocation(line: 597, column: 3, scope: !449, inlinedAt: !415)
!451 = !DILocation(line: 356, column: 7, scope: !294)
!452 = !DILocation(line: 358, column: 23, scope: !453)
!453 = distinct !DILexicalBlock(scope: !294, file: !2, line: 357, column: 2)
!454 = !DILocation(line: 358, column: 3, scope: !453)
!455 = !DILocation(line: 359, column: 32, scope: !453)
!456 = !DILocation(line: 359, column: 36, scope: !453)
!457 = !DILocation(line: 359, column: 11, scope: !453)
!458 = !DILocation(line: 360, column: 24, scope: !453)
!459 = !DILocation(line: 360, column: 3, scope: !453)
!460 = !DILocation(line: 361, column: 38, scope: !453)
!461 = !DILocation(line: 361, column: 12, scope: !453)
!462 = !DILocation(line: 365, column: 8, scope: !463)
!463 = distinct !DILexicalBlock(scope: !464, file: !2, line: 364, column: 3)
!464 = distinct !DILexicalBlock(scope: !453, file: !2, line: 363, column: 3)
!465 = !DILocation(line: 367, column: 14, scope: !466)
!466 = distinct !DILexicalBlock(scope: !463, file: !2, line: 366, column: 4)
!467 = !DILocation(line: 368, column: 5, scope: !466)
!468 = !DILocation(line: 370, column: 25, scope: !463)
!469 = !DILocation(line: 370, column: 4, scope: !463)
!470 = !DILocation(line: 371, column: 39, scope: !463)
!471 = !DILocation(line: 371, column: 13, scope: !463)
!472 = !DILocation(line: 376, column: 17, scope: !294)
!473 = !DILocation(line: 377, column: 18, scope: !294)
!474 = !DILocation(line: 378, column: 18, scope: !294)
