; ModuleID = 'std::encoding::json'
source_filename = "std::encoding::json"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%ByteReader = type { %"char[]", i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%JsonContext = type { i32, %any, %any, i32, ptr, double, i8, i8 }
%"any[]" = type { ptr, i64 }

$std.encoding.json.parse_string = comdat any

$std.encoding.json.tparse_string = comdat any

$std.encoding.json.parse = comdat any

$std.encoding.json.tparse = comdat any

$std.encoding.json.lex_string = comdat any

$.dyn_search = comdat any

$"$ct.std.encoding.json.JsonContext" = comdat any

$"$ct.int" = comdat any

$"$ct.std.encoding.json.JsonTokenType" = comdat any

$"$ct.std.io.ByteReader" = comdat any

$"$ct.std.core.mem.allocator.OnStackAllocator" = comdat any

$std.encoding.json.UNEXPECTED_CHARACTER = comdat any

$std.io.EOF = comdat any

$"$ct.ulong" = comdat any

$std.encoding.json.INVALID_NUMBER = comdat any

$std.encoding.json.DUPLICATE_MEMBERS = comdat any

$"$sel.read_byte" = comdat any

$std.encoding.json.INVALID_ESCAPE_SEQUENCE = comdat any

@"$ct.std.encoding.json.JsonContext" = linkonce global %.introspect { i8 9, i64 0, ptr null, i64 72, i64 0, i64 8, [0 x i64] zeroinitializer }, comdat, align 8

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIE Level", i32 2}
!4 = !{i32 4, !"PIC Level", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = !{i32 2, !"frame-pointer", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !8, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, splitDebugInlining: false)
!8 = !DIFile(filename: "json.c3", directory: "/usr/lib/c3c/lib/std/encoding")
!9 = !{!10}
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "JsonTokenType", scope: !11, file: !8, line: 39, baseType: !37, size: 32, align: 32, elements: !38)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "JsonContext", scope: !8, file: !8, line: 56, size: 576, align: 64, elements: !12, identifier: "std.encoding.json.JsonContext")
!12 = !{!13, !15, !22, !27, !28, !32, !34, !36}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !11, file: !8, line: 58, baseType: !14, size: 32, align: 32)
!14 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !11, file: !8, line: 59, baseType: !16, size: 128, align: 64, offset: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !17, identifier: "InStream")
!17 = !{!18, !20}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !16, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !16, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !11, file: !8, line: 60, baseType: !23, size: 128, align: 64, offset: 192)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !24, identifier: "Allocator")
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !23, baseType: !19, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !23, baseType: !21, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !11, file: !8, line: 61, baseType: !10, size: 32, align: 32, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "last_string", scope: !11, file: !8, line: 62, baseType: !29, size: 64, align: 64, offset: 384)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !8, file: !8, line: 7, baseType: !30, align: 8)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !8, file: !8, line: 8, baseType: null, align: 1)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "last_number", scope: !11, file: !8, line: 63, baseType: !33, size: 64, align: 64, offset: 448)
!33 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !11, file: !8, line: 64, baseType: !35, size: 8, align: 8, offset: 512)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_member, scope: !11, file: !8, line: 65, baseType: !35, size: 8, align: 8, offset: 520)
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!39 = !DIEnumerator(name: "NO_TOKEN", value: 0)
!40 = !DIEnumerator(name: "LBRACE", value: 1)
!41 = !DIEnumerator(name: "LBRACKET", value: 2)
!42 = !DIEnumerator(name: "COMMA", value: 3)
!43 = !DIEnumerator(name: "COLON", value: 4)
!44 = !DIEnumerator(name: "RBRACE", value: 5)
!45 = !DIEnumerator(name: "RBRACKET", value: 6)
!46 = !DIEnumerator(name: "STRING", value: 7)
!47 = !DIEnumerator(name: "NUMBER", value: 8)
!48 = !DIEnumerator(name: "TRUE", value: 9)
!49 = !DIEnumerator(name: "FALSE", value: 10)
!50 = !DIEnumerator(name: "NULL", value: 11)
!51 = !DIEnumerator(name: "EOF", value: 12)
!52 = distinct !DISubprogram(name: "parse_string", linkageName: "std.encoding.json.parse_string", scope: !8, file: !8, line: 10, type: !53, scopeLine: 10, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !115)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !57, !23, !72}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !56)
!56 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object**", baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object*", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !8, file: !8, line: 11, size: 640, align: 128, elements: !60, identifier: "std.collections.object.Object")
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !8, line: 13, baseType: !21, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !59, file: !8, line: 14, baseType: !23, size: 128, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, scope: !59, file: !8, line: 15, baseType: !64, size: 384, align: 128, offset: 256)
!64 = !DICompositeType(tag: DW_TAG_union_type, scope: !59, file: !8, line: 15, size: 384, align: 128, elements: !65)
!65 = !{!66, !68, !69, !71, !80, !81, !91}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !64, file: !8, line: 17, baseType: !67, size: 128, align: 128)
!67 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !64, file: !8, line: 18, baseType: !33, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !64, file: !8, line: 19, baseType: !70, size: 8, align: 8)
!70 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !64, file: !8, line: 20, baseType: !72, size: 128, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !74, identifier: "char[]")
!74 = !{!75, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !73, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !35, size: 64, align: 64, dwarfAddressSpace: 0)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !73, baseType: !78, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !79)
!79 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !64, file: !8, line: 21, baseType: !19, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !64, file: !8, line: 22, baseType: !82, size: 320, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !8, file: !8, line: 469, baseType: !83, align: 8)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !8, file: !8, line: 18, size: 320, align: 64, elements: !84, identifier: "std_collections_list$p$std.collections.object.Object$.List")
!84 = !{!85, !86, !87, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !83, file: !8, line: 20, baseType: !78, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !83, file: !8, line: 21, baseType: !78, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !83, file: !8, line: 22, baseType: !23, size: 128, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !83, file: !8, line: 23, baseType: !89, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !8, file: !8, line: 469, baseType: !58, align: 8)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !64, file: !8, line: 23, baseType: !92, size: 384, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !8, file: !8, line: 468, baseType: !93, align: 8)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !8, file: !8, line: 29, size: 384, align: 64, elements: !94, identifier: "std_collections_map$String$p$std.collections.object.Object$.HashMap")
!94 = !{!95, !110, !111, !112, !113}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !93, file: !8, line: 31, baseType: !96, size: 128, align: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !97, identifier: "Entry*[]")
!97 = !{!98, !109}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !96, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !101, size: 64, align: 64, dwarfAddressSpace: 0)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !8, file: !8, line: 21, size: 320, align: 64, elements: !102, identifier: "std_collections_map$String$p$std.collections.object.Object$.Entry")
!102 = !{!103, !104, !106, !108}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !101, file: !8, line: 23, baseType: !14, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !101, file: !8, line: 24, baseType: !105, size: 128, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !8, file: !8, line: 468, baseType: !72, align: 8)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !101, file: !8, line: 25, baseType: !107, size: 64, align: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !8, file: !8, line: 468, baseType: !58, align: 8)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !8, line: 26, baseType: !100, size: 64, align: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !96, baseType: !78, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !93, file: !8, line: 32, baseType: !23, size: 128, align: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !93, file: !8, line: 33, baseType: !14, size: 32, align: 32, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !93, file: !8, line: 34, baseType: !14, size: 32, align: 32, offset: 288)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !93, file: !8, line: 35, baseType: !114, size: 32, align: 32, offset: 320)
!114 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!115 = !{}
!116 = !DILocalVariable(name: "allocator", arg: 1, scope: !52, file: !8, line: 10, type: !23)
!117 = !DILocation(line: 10, column: 36, scope: !52)
!118 = !DILocalVariable(name: "s", arg: 2, scope: !52, file: !8, line: 10, type: !72)
!119 = !DILocation(line: 10, column: 54, scope: !52)
!120 = !DILocation(line: 12, column: 46, scope: !52)
!121 = !DILocation(line: 12, column: 26, scope: !52)
!122 = !DILocation(line: 12, column: 9, scope: !52)
!123 = distinct !DISubprogram(name: "tparse_string", linkageName: "std.encoding.json.tparse_string", scope: !8, file: !8, line: 15, type: !124, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !115)
!124 = !DISubroutineType(types: !125)
!125 = !{!55, !57, !72}
!126 = !DILocalVariable(name: "s", arg: 1, scope: !123, file: !8, line: 15, type: !72)
!127 = !DILocation(line: 15, column: 34, scope: !123)
!128 = !DILocation(line: 17, column: 41, scope: !123)
!129 = !DILocation(line: 17, column: 21, scope: !123)
!130 = !DILocation(line: 17, column: 9, scope: !123)
!131 = distinct !DISubprogram(name: "parse", linkageName: "std.encoding.json.parse", scope: !8, file: !8, line: 20, type: !132, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !115)
!132 = !DISubroutineType(types: !133)
!133 = !{!55, !57, !23, !16}
!134 = !DILocalVariable(name: "allocator", arg: 1, scope: !131, file: !8, line: 20, type: !23)
!135 = !DILocation(line: 20, column: 29, scope: !131)
!136 = !DILocalVariable(name: "s", arg: 2, scope: !131, file: !8, line: 20, type: !16)
!137 = !DILocation(line: 20, column: 49, scope: !131)
!138 = !DILocalVariable(name: "buffer", scope: !139, file: !8, line: 544, type: !141, align: 16)
!139 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !140, file: !140, line: 542, scopeLine: 542, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !115)
!140 = !DIFile(filename: "mem.c3", directory: "/usr/lib/c3c/lib/std/core")
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 4096, align: 8, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 512, lowerBound: 0)
!144 = !DILocation(line: 544, column: 14, scope: !139, inlinedAt: !145)
!145 = !DILocation(line: 22, column: 2, scope: !131)
!146 = !DILocalVariable(name: "allocator", scope: !139, file: !8, line: 545, type: !147, align: 8)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !8, file: !8, line: 12, size: 384, align: 64, elements: !148, identifier: "std.core.mem.allocator.OnStackAllocator")
!148 = !{!149, !150, !151, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !147, file: !8, line: 14, baseType: !23, size: 128, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !147, file: !8, line: 15, baseType: !73, size: 128, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !147, file: !8, line: 16, baseType: !78, size: 64, align: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !147, file: !8, line: 17, baseType: !153, size: 64, align: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !154, size: 64, align: 64, dwarfAddressSpace: 0)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !8, file: !8, line: 20, size: 192, align: 64, elements: !155, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!155 = !{!156, !157, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !154, file: !8, line: 22, baseType: !70, size: 8, align: 8)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !154, file: !8, line: 23, baseType: !153, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !154, file: !8, line: 24, baseType: !19, size: 64, align: 64, offset: 128)
!159 = !DILocation(line: 545, column: 19, scope: !139, inlinedAt: !145)
!160 = !DILocation(line: 546, column: 18, scope: !139, inlinedAt: !145)
!161 = !DILocation(line: 546, column: 26, scope: !139, inlinedAt: !145)
!162 = !DILocation(line: 546, column: 2, scope: !139, inlinedAt: !145)
!163 = !DILocalVariable(name: "smem", scope: !131, file: !8, line: 22, type: !23, align: 8)
!164 = !DILocation(line: 22, column: 28, scope: !131)
!165 = !DILocation(line: 548, column: 8, scope: !166, inlinedAt: !145)
!166 = distinct !DILexicalBlock(scope: !139, file: !140, line: 548, column: 2)
!167 = !DILocalVariable(name: "context", scope: !168, file: !8, line: 24, type: !11, align: 8)
!168 = distinct !DILexicalBlock(scope: !131, file: !8, line: 23, column: 2)
!169 = !DILocation(line: 24, column: 15, scope: !168)
!170 = !DILocation(line: 24, column: 75, scope: !168)
!171 = !DILocation(line: 24, column: 42, scope: !168)
!172 = !DILocation(line: 24, column: 90, scope: !168)
!173 = !DILocation(line: 24, column: 106, scope: !168)
!174 = !DILocalVariable(name: "state", scope: !175, file: !8, line: 594, type: !176, align: 8)
!175 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !140, file: !140, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !115)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !8, file: !8, line: 402, baseType: !177, align: 8)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !178, size: 64, align: 64, dwarfAddressSpace: 0)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !8, file: !8, line: 32, size: 512, align: 64, elements: !179, identifier: "std.core.mem.allocator.TempAllocator")
!179 = !{!180, !181, !193, !194, !195, !196, !197, !198}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !178, file: !8, line: 34, baseType: !23, size: 128, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !178, file: !8, line: 35, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !183, size: 64, align: 64, dwarfAddressSpace: 0)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !8, file: !8, line: 52, size: 256, align: 64, elements: !184, identifier: "std.core.mem.allocator.TempAllocatorPage")
!184 = !{!185, !186, !187, !188, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !183, file: !8, line: 54, baseType: !182, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !183, file: !8, line: 55, baseType: !19, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !183, file: !8, line: 56, baseType: !78, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !183, file: !8, line: 57, baseType: !78, size: 64, align: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !183, file: !8, line: 58, baseType: !190, align: 8, offset: 256)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, align: 8, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 0, lowerBound: 0)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !178, file: !8, line: 36, baseType: !177, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !178, file: !8, line: 37, baseType: !70, size: 8, align: 8, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !178, file: !8, line: 38, baseType: !78, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !178, file: !8, line: 39, baseType: !78, size: 64, align: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !178, file: !8, line: 40, baseType: !78, size: 64, align: 64, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !178, file: !8, line: 41, baseType: !190, align: 8, offset: 512)
!199 = !DILocation(line: 594, column: 12, scope: !175, inlinedAt: !200)
!200 = !DILocation(line: 25, column: 3, scope: !168)
!201 = !DILocation(line: 594, column: 20, scope: !175, inlinedAt: !200)
!202 = !DILocation(line: 27, column: 11, scope: !203)
!203 = distinct !DILexicalBlock(scope: !168, file: !8, line: 26, column: 3)
!204 = !DILocation(line: 597, column: 23, scope: !205, inlinedAt: !200)
!205 = distinct !DILexicalBlock(scope: !175, file: !140, line: 596, column: 2)
!206 = !DILocation(line: 597, column: 3, scope: !205, inlinedAt: !200)
!207 = !DILocation(line: 547, column: 8, scope: !208, inlinedAt: !145)
!208 = distinct !DILexicalBlock(scope: !139, file: !140, line: 547, column: 8)
!209 = !DILocation(line: 597, column: 23, scope: !210, inlinedAt: !200)
!210 = distinct !DILexicalBlock(scope: !175, file: !140, line: 596, column: 2)
!211 = !DILocation(line: 597, column: 3, scope: !210, inlinedAt: !200)
!212 = !DILocation(line: 547, column: 8, scope: !213, inlinedAt: !145)
!213 = distinct !DILexicalBlock(scope: !139, file: !140, line: 547, column: 8)
!214 = distinct !DISubprogram(name: "tparse", linkageName: "std.encoding.json.tparse", scope: !8, file: !8, line: 32, type: !215, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !115)
!215 = !DISubroutineType(types: !216)
!216 = !{!55, !57, !16}
!217 = !DILocalVariable(name: "s", arg: 1, scope: !214, file: !8, line: 32, type: !16)
!218 = !DILocation(line: 32, column: 29, scope: !214)
!219 = !DILocation(line: 34, column: 9, scope: !214)
!220 = distinct !DISubprogram(name: "parse_from_token", linkageName: "std.encoding.json.parse_from_token", scope: !8, file: !8, line: 73, type: !221, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !115)
!221 = !DISubroutineType(types: !222)
!222 = !{!55, !57, !223, !10}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "JsonContext*", baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!224 = !DILocalVariable(name: "context", arg: 1, scope: !220, file: !8, line: 73, type: !223)
!225 = !DILocation(line: 73, column: 43, scope: !220)
!226 = !DILocalVariable(name: "token", arg: 2, scope: !220, file: !8, line: 73, type: !10)
!227 = !DILocation(line: 73, column: 66, scope: !220)
!228 = !DILocation(line: 206, column: 33, scope: !229, inlinedAt: !231)
!229 = distinct !DISubprogram(name: "unreachable", linkageName: "unreachable", scope: !230, file: !230, line: 203, scopeLine: 203, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!230 = !DIFile(filename: "builtin.c3", directory: "/usr/lib/c3c/lib/std/core")
!231 = !DILocation(line: 77, column: 18, scope: !232)
!232 = distinct !DILexicalBlock(scope: !233, file: !8, line: 77, column: 18)
!233 = distinct !DILexicalBlock(scope: !220, file: !8, line: 75, column: 2)
!234 = !DILocation(line: 206, column: 2, scope: !229, inlinedAt: !231)
!235 = !DILocation(line: 208, column: 2, scope: !229, inlinedAt: !231)
!236 = !DILocation(line: 78, column: 23, scope: !237)
!237 = distinct !DILexicalBlock(scope: !233, file: !8, line: 78, column: 16)
!238 = !DILocation(line: 79, column: 25, scope: !239)
!239 = distinct !DILexicalBlock(scope: !233, file: !8, line: 79, column: 18)
!240 = !DILocation(line: 83, column: 22, scope: !241)
!241 = distinct !DILexicalBlock(scope: !233, file: !8, line: 83, column: 15)
!242 = !DILocation(line: 84, column: 42, scope: !243)
!243 = distinct !DILexicalBlock(scope: !233, file: !8, line: 84, column: 16)
!244 = !DILocation(line: 84, column: 74, scope: !243)
!245 = !DILocation(line: 84, column: 23, scope: !243)
!246 = !DILocation(line: 85, column: 41, scope: !247)
!247 = distinct !DILexicalBlock(scope: !233, file: !8, line: 85, column: 16)
!248 = !DILocation(line: 85, column: 62, scope: !247)
!249 = !DILocation(line: 85, column: 23, scope: !247)
