; ModuleID = 'std::core::mem'
source_filename = "std::core::mem"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.core.mem.aligned_offset = comdat any

$std.core.mem.ptr_is_aligned = comdat any

$std.core.mem.temp_push = comdat any

$std.core.mem.temp_pop = comdat any

$std.core.mem.malloc = comdat any

$std.core.mem.malloc_aligned = comdat any

$std.core.mem.tmalloc = comdat any

$std.core.mem.calloc = comdat any

$std.core.mem.calloc_aligned = comdat any

$std.core.mem.tcalloc = comdat any

$std.core.mem.realloc = comdat any

$std.core.mem.realloc_aligned = comdat any

$std.core.mem.free = comdat any

$std.core.mem.free_aligned = comdat any

$std.core.mem.trealloc = comdat any

$.dyn_search = comdat any

$"$ct.int" = comdat any

$"$ct.std.core.mem.AtomicOrdering" = comdat any

$std.core.mem.MAX_MEMORY_ALIGNMENT = comdat any

$std.core.mem.DEFAULT_MEM_ALIGNMENT = comdat any

$"$sel.acquire" = comdat any

$"$ct.fault" = comdat any

$"$sel.release" = comdat any

$"$sel.resize" = comdat any

@.enum.NOT_ATOMIC = internal constant [11 x i8] c"NOT_ATOMIC\00", align 1
@.enum.UNORDERED = internal constant [10 x i8] c"UNORDERED\00", align 1
@.enum.RELAXED = internal constant [8 x i8] c"RELAXED\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "MAX_MEMORY_ALIGNMENT", linkageName: "std.core.mem.MAX_MEMORY_ALIGNMENT", scope: !2, file: !2, line: 8, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "mem.c3", directory: "/usr/lib/c3c/lib/std/core")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "DEFAULT_MEM_ALIGNMENT", linkageName: "std.core.mem.DEFAULT_MEM_ALIGNMENT", scope: !2, file: !2, line: 9, type: !6, isLocal: false, isDefinition: true, align: 8)
!6 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!7 = !{i32 2, !"Dwarf Version", i32 4}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{i32 2, !"wchar_size", i32 4}
!10 = !{i32 4, !"PIE Level", i32 2}
!11 = !{i32 4, !"PIC Level", i32 2}
!12 = !{i32 1, !"uwtable", i32 2}
!13 = !{i32 2, !"frame-pointer", i32 2}
!14 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !15, splitDebugInlining: false)
!15 = !{!0, !4}
!16 = distinct !DISubprogram(name: "aligned_offset", linkageName: "std.core.mem.aligned_offset", scope: !2, file: !2, line: 283, type: !17, scopeLine: 283, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !21)
!17 = !DISubroutineType(types: !18)
!18 = !{!19, !20, !20}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !20)
!20 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!21 = !{}
!22 = !DILocalVariable(name: "offset", arg: 1, scope: !16, file: !2, line: 283, type: !19)
!23 = !DILocation(line: 283, column: 27, scope: !16)
!24 = !DILocalVariable(name: "alignment", arg: 2, scope: !16, file: !2, line: 283, type: !19)
!25 = !DILocation(line: 283, column: 39, scope: !16)
!26 = !DILocation(line: 973, column: 9, scope: !27, inlinedAt: !29)
!27 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !28, file: !28, line: 971, scopeLine: 971, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!28 = !DIFile(filename: "math.c3", directory: "/usr/lib/c3c/lib/std/math")
!29 = !DILocation(line: 281, column: 11, scope: !30)
!30 = distinct !DILexicalBlock(scope: !16, file: !2, line: 284, column: 1)
!31 = !DILocation(line: 973, column: 20, scope: !27, inlinedAt: !29)
!32 = !DILocation(line: 973, column: 25, scope: !27, inlinedAt: !29)
!33 = !DILocation(line: 285, column: 9, scope: !16)
!34 = !DILocation(line: 285, column: 23, scope: !16)
!35 = !DILocation(line: 285, column: 32, scope: !16)
!36 = !DILocation(line: 285, column: 49, scope: !16)
!37 = distinct !DISubprogram(name: "ptr_is_aligned", linkageName: "std.core.mem.ptr_is_aligned", scope: !2, file: !2, line: 296, type: !38, scopeLine: 296, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !21)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !41, !20}
!40 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DILocalVariable(name: "ptr", arg: 1, scope: !37, file: !2, line: 296, type: !41)
!43 = !DILocation(line: 296, column: 30, scope: !37)
!44 = !DILocalVariable(name: "alignment", arg: 2, scope: !37, file: !2, line: 296, type: !19)
!45 = !DILocation(line: 296, column: 39, scope: !37)
!46 = !DILocation(line: 973, column: 9, scope: !47, inlinedAt: !48)
!47 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !28, file: !28, line: 971, scopeLine: 971, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!48 = !DILocation(line: 294, column: 11, scope: !49)
!49 = distinct !DILexicalBlock(scope: !37, file: !2, line: 297, column: 1)
!50 = !DILocation(line: 973, column: 20, scope: !47, inlinedAt: !48)
!51 = !DILocation(line: 973, column: 25, scope: !47, inlinedAt: !48)
!52 = !DILocation(line: 298, column: 9, scope: !37)
!53 = !DILocation(line: 298, column: 22, scope: !37)
!54 = distinct !DISubprogram(name: "temp_push", linkageName: "std.core.mem.temp_push", scope: !2, file: !2, line: 566, type: !55, scopeLine: 566, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14)
!55 = !DISubroutineType(types: !56)
!56 = !{!57}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 402, baseType: !58, align: 8)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 32, size: 512, align: 64, elements: !60, identifier: "std.core.mem.allocator.TempAllocator")
!60 = !{!61, !67, !80, !81, !82, !83, !84, !85}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !59, file: !2, line: 34, baseType: !62, size: 128, align: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !63, identifier: "Allocator")
!63 = !{!64, !65}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !62, baseType: !41, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !62, baseType: !66, size: 64, align: 64, offset: 64)
!66 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !59, file: !2, line: 35, baseType: !68, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !69, size: 64, align: 64, dwarfAddressSpace: 0)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 52, size: 256, align: 64, elements: !70, identifier: "std.core.mem.allocator.TempAllocatorPage")
!70 = !{!71, !72, !73, !74, !75}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !69, file: !2, line: 54, baseType: !68, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !69, file: !2, line: 55, baseType: !41, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !69, file: !2, line: 56, baseType: !19, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !69, file: !2, line: 57, baseType: !19, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !69, file: !2, line: 58, baseType: !76, align: 8, offset: 256)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, align: 8, elements: !78)
!77 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!78 = !{!79}
!79 = !DISubrange(count: 0, lowerBound: 0)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !59, file: !2, line: 36, baseType: !58, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !59, file: !2, line: 37, baseType: !40, size: 8, align: 8, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !59, file: !2, line: 38, baseType: !19, size: 64, align: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !59, file: !2, line: 39, baseType: !19, size: 64, align: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !59, file: !2, line: 40, baseType: !19, size: 64, align: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !59, file: !2, line: 41, baseType: !76, align: 8, offset: 512)
!86 = !DILocation(line: 568, column: 9, scope: !54)
!87 = distinct !DISubprogram(name: "temp_pop", linkageName: "std.core.mem.temp_pop", scope: !2, file: !2, line: 574, type: !88, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !21)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !57}
!90 = !DILocalVariable(name: "old_state", arg: 1, scope: !87, file: !2, line: 574, type: !57)
!91 = !DILocation(line: 574, column: 28, scope: !87)
!92 = !DILocation(line: 576, column: 22, scope: !87)
!93 = !DILocation(line: 576, column: 2, scope: !87)
!94 = distinct !DISubprogram(name: "malloc", linkageName: "std.core.mem.malloc", scope: !2, file: !2, line: 662, type: !95, scopeLine: 662, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !21)
!95 = !DISubroutineType(types: !96)
!96 = !{!41, !20}
!97 = !DILocalVariable(name: "size", arg: 1, scope: !94, file: !2, line: 662, type: !19)
!98 = !DILocation(line: 662, column: 21, scope: !94)
!99 = !DILocation(line: 79, column: 6, scope: !100, inlinedAt: !102)
!100 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !101, file: !101, line: 77, scopeLine: 77, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!101 = !DIFile(filename: "mem_allocator.c3", directory: "/usr/lib/c3c/lib/std/core")
!102 = !DILocation(line: 74, column: 9, scope: !103, inlinedAt: !104)
!103 = distinct !DISubprogram(name: "malloc", linkageName: "malloc", scope: !101, file: !101, line: 72, scopeLine: 72, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!104 = !DILocation(line: 664, column: 9, scope: !94)
!105 = !DILocation(line: 79, column: 20, scope: !100, inlinedAt: !102)
!106 = !DILocation(line: 85, column: 28, scope: !100, inlinedAt: !102)
!107 = !DILocation(line: 37, column: 12, scope: !100, inlinedAt: !102)
!108 = !DILocation(line: 973, column: 9, scope: !109, inlinedAt: !110)
!109 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !28, file: !28, line: 971, scopeLine: 971, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!110 = !DILocation(line: 37, column: 26, scope: !100, inlinedAt: !102)
!111 = !DILocation(line: 973, column: 20, scope: !109, inlinedAt: !110)
!112 = !DILocation(line: 973, column: 25, scope: !109, inlinedAt: !110)
!113 = !DILocation(line: 85, column: 10, scope: !100, inlinedAt: !102)
!114 = distinct !DISubprogram(name: "malloc_aligned", linkageName: "std.core.mem.malloc_aligned", scope: !2, file: !2, line: 671, type: !115, scopeLine: 671, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !21)
!115 = !DISubroutineType(types: !116)
!116 = !{!41, !20, !20}
!117 = !DILocalVariable(name: "size", arg: 1, scope: !114, file: !2, line: 671, type: !19)
!118 = !DILocation(line: 671, column: 29, scope: !114)
!119 = !DILocalVariable(name: "alignment", arg: 2, scope: !114, file: !2, line: 671, type: !19)
!120 = !DILocation(line: 671, column: 39, scope: !114)
!121 = !DILocation(line: 127, column: 6, scope: !122, inlinedAt: !123)
!122 = distinct !DISubprogram(name: "malloc_aligned", linkageName: "malloc_aligned", scope: !101, file: !101, line: 125, scopeLine: 125, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!123 = !DILocation(line: 673, column: 9, scope: !114)
!124 = !DILocation(line: 127, column: 20, scope: !122, inlinedAt: !123)
!125 = !DILocation(line: 133, column: 28, scope: !122, inlinedAt: !123)
!126 = !DILocation(line: 133, column: 43, scope: !122, inlinedAt: !123)
!127 = !DILocation(line: 37, column: 12, scope: !122, inlinedAt: !123)
!128 = !DILocation(line: 973, column: 9, scope: !129, inlinedAt: !130)
!129 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !28, file: !28, line: 971, scopeLine: 971, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
