; ModuleID = 'std::encoding::csv'
source_filename = "std::encoding::csv"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%CsvReader = type { %any, %"char[]" }
%"char[][]" = type { ptr, i64 }
%CsvRow = type { %"char[][]", %"char[]", %any }

$std.encoding.csv.CsvRow.to_format = comdat any

$std.encoding.csv.CsvRow.len = comdat any

$std.encoding.csv.CsvRow.get_col = comdat any

$std.encoding.csv.CsvReader.init = comdat any

$std.encoding.csv.CsvReader.read_row = comdat any

$std.encoding.csv.CsvReader.tread_row = comdat any

$std.encoding.csv.CsvRow.free = comdat any

$std.encoding.csv.CsvReader.skip_row = comdat any

$.dyn_search = comdat any

$"$ct.std.encoding.csv.CsvReader" = comdat any

$"$ct.std.encoding.csv.CsvRow" = comdat any

$"$ct.sa$String" = comdat any

$"$ct.String" = comdat any

$"$ct.sa$char" = comdat any

$"$ct.char" = comdat any

$"$ct.ulong" = comdat any

$"$sel.read_byte" = comdat any

$std.io.EOF = comdat any

$"$sel.release" = comdat any

$"$ct.void" = comdat any

$"$ct.dyn.std.encoding.csv.CsvRow.to_format" = comdat any

$"$sel.to_format" = comdat any

@"$ct.std.encoding.csv.CsvReader" = linkonce global %.introspect { i8 9, i64 0, ptr null, i64 32, i64 0, i64 2, [0 x i64] zeroinitializer }, comdat, align 8

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIE Level", i32 2}
!4 = !{i32 4, !"PIC Level", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = !{i32 2, !"frame-pointer", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !8, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!8 = !DIFile(filename: "csv.c3", directory: "/usr/lib/c3c/lib/std/encoding")
!9 = distinct !DISubprogram(name: "to_format", linkageName: "std.encoding.csv.CsvRow.to_format", scope: !8, file: !8, line: 18, type: !10, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !59)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !14, !17, !41}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !13)
!13 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !16)
!16 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CsvRow*", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "CsvRow", scope: !8, file: !8, line: 11, size: 384, align: 64, elements: !19, identifier: "std.encoding.csv.CsvRow")
!19 = !{!20, !33, !34}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !18, file: !8, line: 13, baseType: !21, size: 128, align: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !22, identifier: "String[]")
!22 = !{!23, !32}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !21, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !27, identifier: "char[]")
!27 = !{!28, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !26, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !26, baseType: !15, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !21, baseType: !15, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !18, file: !8, line: 14, baseType: !25, size: 128, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !18, file: !8, line: 15, baseType: !35, size: 128, align: 64, offset: 256)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !36, identifier: "Allocator")
!36 = !{!37, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !35, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !35, baseType: !40, size: 64, align: 64, offset: 64)
!40 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !8, file: !8, line: 63, size: 384, align: 64, elements: !43, identifier: "std.io.Formatter")
!43 = !{!44, !45, !50}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !42, file: !8, line: 65, baseType: !38, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !42, file: !8, line: 66, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !8, file: !8, line: 16, baseType: !47, align: 8)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !48, size: 64, align: 64, dwarfAddressSpace: 0)
!48 = !DISubroutineType(types: !49)
!49 = !{!12, !38, !38, !30}
!50 = !DIDerivedType(tag: DW_TAG_member, scope: !42, file: !8, line: 67, baseType: !51, size: 256, align: 64, offset: 128)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !42, file: !8, line: 67, size: 256, align: 64, elements: !52)
!52 = !{!53, !55, !56, !57, !58}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !51, file: !8, line: 69, baseType: !54, size: 32, align: 32)
!54 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !51, file: !8, line: 70, baseType: !54, size: 32, align: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !51, file: !8, line: 71, baseType: !54, size: 32, align: 32, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !51, file: !8, line: 72, baseType: !15, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !51, file: !8, line: 73, baseType: !12, size: 64, align: 64, offset: 192)
!59 = !{}
!60 = !DILocation(line: 19, column: 1, scope: !9)
!61 = !DILocalVariable(name: "self", arg: 1, scope: !9, file: !8, line: 18, type: !17)
!62 = !DILocation(line: 18, column: 26, scope: !9)
!63 = !DILocalVariable(name: "f", arg: 2, scope: !9, file: !8, line: 18, type: !41)
!64 = !DILocation(line: 18, column: 44, scope: !9)
!65 = !DILocation(line: 20, column: 24, scope: !9)
!66 = !DILocation(line: 20, column: 9, scope: !9)
!67 = distinct !DISubprogram(name: "len", linkageName: "std.encoding.csv.CsvRow.len", scope: !8, file: !8, line: 23, type: !68, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !59)
!68 = !DISubroutineType(types: !69)
!69 = !{!15, !17}
!70 = !DILocation(line: 24, column: 1, scope: !67)
!71 = !DILocalVariable(name: "self", arg: 1, scope: !67, file: !8, line: 23, type: !17)
!72 = !DILocation(line: 23, column: 19, scope: !67)
!73 = !DILocation(line: 25, column: 9, scope: !67)
!74 = distinct !DISubprogram(name: "get_col", linkageName: "std.encoding.csv.CsvRow.get_col", scope: !8, file: !8, line: 31, type: !75, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !59)
!75 = !DISubroutineType(types: !76)
!76 = !{!25, !17, !16}
!77 = !DILocation(line: 32, column: 1, scope: !74)
!78 = !DILocalVariable(name: "self", arg: 1, scope: !74, file: !8, line: 31, type: !17)
!79 = !DILocation(line: 31, column: 26, scope: !74)
!80 = !DILocalVariable(name: "col", arg: 2, scope: !74, file: !8, line: 31, type: !15)
!81 = !DILocation(line: 31, column: 37, scope: !74)
!82 = !DILocation(line: 29, column: 11, scope: !83)
!83 = distinct !DILexicalBlock(scope: !74, file: !8, line: 32, column: 1)
!84 = !DILocation(line: 29, column: 17, scope: !83)
!85 = !DILocation(line: 33, column: 9, scope: !74)
!86 = !DILocation(line: 33, column: 19, scope: !74)
!87 = distinct !DISubprogram(name: "init", linkageName: "std.encoding.csv.CsvReader.init", scope: !8, file: !8, line: 36, type: !88, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !59)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !90, !94, !25}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CsvReader*", baseType: !91, size: 64, align: 64, dwarfAddressSpace: 0)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "CsvReader", scope: !8, file: !8, line: 5, size: 256, align: 64, elements: !92, identifier: "std.encoding.csv.CsvReader")
!92 = !{!93, !98}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !91, file: !8, line: 7, baseType: !94, size: 128, align: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !95, identifier: "InStream")
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !94, baseType: !38, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, baseType: !40, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "separator", scope: !91, file: !8, line: 8, baseType: !25, size: 128, align: 64, offset: 128)
!99 = !DILocation(line: 37, column: 1, scope: !87)
!100 = !DILocalVariable(name: "self", arg: 1, scope: !87, file: !8, line: 36, type: !90)
!101 = !DILocation(line: 36, column: 24, scope: !87)
!102 = !DILocalVariable(name: "stream", arg: 2, scope: !87, file: !8, line: 36, type: !94)
!103 = !DILocation(line: 36, column: 40, scope: !87)
!104 = !DILocalVariable(name: "separator", arg: 3, scope: !87, file: !8, line: 36, type: !25)
!105 = !DILocation(line: 36, column: 55, scope: !87)
!106 = !DILocation(line: 38, column: 2, scope: !87)
!107 = !DILocation(line: 38, column: 16, scope: !87)
!108 = !DILocation(line: 39, column: 2, scope: !87)
!109 = !DILocation(line: 39, column: 19, scope: !87)
!110 = distinct !DISubprogram(name: "read_row", linkageName: "std.encoding.csv.CsvReader.read_row", scope: !8, file: !8, line: 44, type: !111, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !59)
!111 = !DISubroutineType(types: !112)
!112 = !{!12, !17, !91, !35}
!113 = !DILocalVariable(name: "self", arg: 1, scope: !110, file: !8, line: 44, type: !91)
!114 = !DILocation(line: 44, column: 31, scope: !110)
!115 = !DILocalVariable(name: "allocator", arg: 2, scope: !110, file: !8, line: 44, type: !35)
!116 = !DILocation(line: 44, column: 47, scope: !110)
!117 = !DILocalVariable(name: "row", scope: !110, file: !8, line: 46, type: !25, align: 8)
!118 = !DILocation(line: 46, column: 9, scope: !110)
!119 = !DILocalVariable(name: "func", scope: !120, file: !8, line: 60, type: !122, align: 8)
!120 = distinct !DISubprogram(name: "readline", linkageName: "readline", scope: !121, file: !121, line: 56, scopeLine: 56, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !59)
!121 = !DIFile(filename: "io.c3", directory: "/usr/lib/c3c/lib/std/io")
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "read_byte", baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !29, !38}
!125 = !DILocation(line: 60, column: 30, scope: !120, inlinedAt: !126)
!126 = !DILocation(line: 46, column: 15, scope: !110)
!127 = !DILocation(line: 60, column: 38, scope: !120, inlinedAt: !126)
!128 = !DILocalVariable(name: "val", scope: !120, file: !8, line: 61, type: !30, align: 1)
!129 = !DILocation(line: 61, column: 8, scope: !120, inlinedAt: !126)
!130 = !DILocation(line: 61, column: 14, scope: !120, inlinedAt: !126)
!131 = !DILocation(line: 66, column: 6, scope: !120, inlinedAt: !126)
!132 = !DILocation(line: 66, column: 26, scope: !120, inlinedAt: !126)
!133 = !DILocalVariable(name: "state", scope: !134, file: !8, line: 594, type: !136, align: 8)
!134 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !135, file: !135, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !59)
!135 = !DIFile(filename: "mem.c3", directory: "/usr/lib/c3c/lib/std/core")
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !8, file: !8, line: 402, baseType: !137, align: 8)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !138, size: 64, align: 64, dwarfAddressSpace: 0)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !8, file: !8, line: 32, size: 512, align: 64, elements: !139, identifier: "std.core.mem.allocator.TempAllocator")
!139 = !{!140, !141, !153, !154, !156, !157, !158, !159}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !138, file: !8, line: 34, baseType: !35, size: 128, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !138, file: !8, line: 35, baseType: !142, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !143, size: 64, align: 64, dwarfAddressSpace: 0)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !8, file: !8, line: 52, size: 256, align: 64, elements: !144, identifier: "std.core.mem.allocator.TempAllocatorPage")
!144 = !{!145, !146, !147, !148, !149}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !143, file: !8, line: 54, baseType: !142, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !143, file: !8, line: 55, baseType: !38, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !143, file: !8, line: 56, baseType: !15, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !143, file: !8, line: 57, baseType: !15, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !143, file: !8, line: 58, baseType: !150, align: 8, offset: 256)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, align: 8, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 0, lowerBound: 0)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !138, file: !8, line: 36, baseType: !137, size: 64, align: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !138, file: !8, line: 37, baseType: !155, size: 8, align: 8, offset: 256)
!155 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !138, file: !8, line: 38, baseType: !15, size: 64, align: 64, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !138, file: !8, line: 39, baseType: !15, size: 64, align: 64, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !138, file: !8, line: 40, baseType: !15, size: 64, align: 64, offset: 448)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !138, file: !8, line: 41, baseType: !150, align: 8, offset: 512)
!160 = !DILocation(line: 594, column: 12, scope: !134, inlinedAt: !161)
!161 = !DILocation(line: 67, column: 2, scope: !120, inlinedAt: !126)
!162 = !DILocation(line: 594, column: 20, scope: !134, inlinedAt: !161)
!163 = !DILocalVariable(name: "str", scope: !164, file: !8, line: 69, type: !165, align: 8)
!164 = distinct !DILexicalBlock(scope: !120, file: !121, line: 68, column: 2)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !8, file: !8, line: 7, baseType: !166, align: 8)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !167, size: 64, align: 64, dwarfAddressSpace: 0)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !8, file: !8, line: 8, baseType: null, align: 1)
!168 = !DILocation(line: 69, column: 11, scope: !164, inlinedAt: !126)
!169 = !DILocation(line: 69, column: 17, scope: !164, inlinedAt: !126)
!170 = !DILocation(line: 70, column: 7, scope: !164, inlinedAt: !126)
!171 = !DILocation(line: 395, column: 27, scope: !172, inlinedAt: !175)
!172 = distinct !DILexicalBlock(scope: !174, file: !173, line: 396, column: 1)
!173 = !DIFile(filename: "dstring.c3", directory: "/usr/lib/c3c/lib/std/core")
!174 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !173, file: !173, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!175 = !DILocation(line: 70, column: 20, scope: !164, inlinedAt: !126)
!176 = !DILocation(line: 401, column: 21, scope: !174, inlinedAt: !175)
!177 = !DILocation(line: 401, column: 4, scope: !174, inlinedAt: !175)
!178 = !DILocation(line: 71, column: 3, scope: !164, inlinedAt: !126)
!179 = !DILocalVariable(name: "c", scope: !180, file: !8, line: 74, type: !30, align: 1)
!180 = distinct !DILexicalBlock(scope: !181, file: !121, line: 72, column: 3)
!181 = distinct !DILexicalBlock(scope: !164, file: !121, line: 71, column: 3)
!182 = !DILocation(line: 74, column: 11, scope: !180, inlinedAt: !126)
!183 = !DILocation(line: 74, column: 15, scope: !180, inlinedAt: !126)
!184 = !DILocalVariable(name: "err", scope: !180, file: !8, line: 78, type: !12, align: 8)
!185 = !DILocation(line: 78, column: 14, scope: !180, inlinedAt: !126)
!186 = !DILocation(line: 78, column: 20, scope: !180, inlinedAt: !126)
!187 = !DILocation(line: 80, column: 9, scope: !188, inlinedAt: !126)
!188 = distinct !DILexicalBlock(scope: !180, file: !121, line: 79, column: 4)
!189 = !DILocation(line: 80, column: 25, scope: !188, inlinedAt: !126)
!190 = !DILocation(line: 81, column: 12, scope: !188, inlinedAt: !126)
!191 = !DILocation(line: 597, column: 23, scope: !192, inlinedAt: !161)
!192 = distinct !DILexicalBlock(scope: !134, file: !135, line: 596, column: 2)
!193 = !DILocation(line: 597, column: 3, scope: !192, inlinedAt: !161)
!194 = !DILocation(line: 83, column: 8, scope: !180, inlinedAt: !126)
!195 = !DILocation(line: 83, column: 19, scope: !180, inlinedAt: !126)
!196 = !DILocation(line: 84, column: 8, scope: !180, inlinedAt: !126)
!197 = !DILocation(line: 84, column: 19, scope: !180, inlinedAt: !126)
!198 = !DILocation(line: 85, column: 20, scope: !180, inlinedAt: !126)
!199 = !DILocation(line: 85, column: 4, scope: !180, inlinedAt: !126)
!200 = !DILocation(line: 87, column: 23, scope: !164, inlinedAt: !126)
!201 = !DILocation(line: 87, column: 10, scope: !164, inlinedAt: !126)
!202 = !DILocation(line: 597, column: 23, scope: !203, inlinedAt: !161)
!203 = distinct !DILexicalBlock(scope: !134, file: !135, line: 596, column: 2)
!204 = !DILocation(line: 597, column: 3, scope: !203, inlinedAt: !161)
!205 = !DILocation(line: 597, column: 3, scope: !206, inlinedAt: !161)
!206 = distinct !DILexicalBlock(scope: !134, file: !135, line: 596, column: 2)
!207 = !DILocalVariable(name: "list", scope: !110, file: !8, line: 48, type: !21, align: 8)
!208 = !DILocation(line: 48, column: 11, scope: !110)
