; ModuleID = 'std::core::runtime'
source_filename = "std::core::runtime"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"fn void()[]" = type { ptr, i64 }
%"char[][]" = type { ptr, i64 }
%"TestUnit[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%TestUnit = type { %"char[]", ptr }
%"char[]" = type { ptr, i64 }
%TestContext = type { [25 x i64], %"char[]", i8, i8, i8, i8, i8, i8, %"char[]", ptr, ptr, ptr, i64, %File, %stored }
%File = type { ptr }
%stored = type { %File, %File, %any }
%TrackingAllocator = type { %any, %HashMap, i64, i64 }
%HashMap = type { %"Entry*[]", %any, i32, i32, float }
%"Entry*[]" = type { ptr, i64 }
%"BenchmarkUnit[]" = type { ptr, i64 }
%BenchmarkUnit = type { %"char[]", ptr }

$std.core.runtime.test_collection_create = comdat any

$std.core.runtime.cmp_test_unit = comdat any

$std.core.runtime.default_test_runner = comdat any

$std.core.runtime.benchmark_collection_create = comdat any

$std.core.runtime.set_benchmark_warmup_iterations = comdat any

$std.core.runtime.set_benchmark_max_iterations = comdat any

$std.core.runtime.run_benchmarks = comdat any

$std.core.runtime.default_benchmark_runner = comdat any

$.dyn_search = comdat any

$"$ct.std.core.runtime.stored" = comdat any

$"$ct.std.core.runtime.TestContext" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "test_context", linkageName: "std.core.runtime.test_context", scope: !2, file: !2, line: 12, type: !3, isLocal: true, isDefinition: true, align: 8)
!2 = !DIFile(filename: "runtime_test.c3", directory: "/usr/lib/c3c/lib/std/core")
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestContext*", baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestContext", scope: !2, file: !2, line: 14, size: 2496, align: 64, elements: !5, identifier: "std.core.runtime.TestContext")
!5 = !{!6, !12, !21, !23, !24, !25, !26, !27, !28, !29, !34, !35, !36, !37, !43}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !4, file: !2, line: 16, baseType: !7, size: 1600, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "JmpBuf", scope: !2, file: !2, line: 52, baseType: !8, align: 8)
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1600, align: 64, elements: !10)
!9 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!10 = !{!11}
!11 = !DISubrange(count: 25, lowerBound: 0)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "test_filter", scope: !4, file: !2, line: 18, baseType: !13, size: 128, align: 64, offset: 1600)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !15, identifier: "char[]")
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !14, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !14, baseType: !20, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !9)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint_on_assert", scope: !4, file: !2, line: 20, baseType: !22, size: 8, align: 8, offset: 1728)
!22 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "assert_print_backtrace", scope: !4, file: !2, line: 23, baseType: !22, size: 8, align: 8, offset: 1736)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "has_ansi_codes", scope: !4, file: !2, line: 24, baseType: !22, size: 8, align: 8, offset: 1744)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "is_in_panic", scope: !4, file: !2, line: 25, baseType: !22, size: 8, align: 8, offset: 1752)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "is_quiet_mode", scope: !4, file: !2, line: 26, baseType: !22, size: 8, align: 8, offset: 1760)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "is_no_capture", scope: !4, file: !2, line: 27, baseType: !22, size: 8, align: 8, offset: 1768)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "current_test_name", scope: !4, file: !2, line: 28, baseType: !13, size: 128, align: 64, offset: 1792)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "setup_fn", scope: !4, file: !2, line: 29, baseType: !30, size: 64, align: 64, offset: 1920)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "TestFn", scope: !2, file: !2, line: 10, baseType: !31, align: 8)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestFn", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!32 = !DISubroutineType(types: !33)
!33 = !{null}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "teardown_fn", scope: !4, file: !2, line: 30, baseType: !30, size: 64, align: 64, offset: 1984)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "error_buffer", scope: !4, file: !2, line: 32, baseType: !17, size: 64, align: 64, offset: 2048)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "error_buffer_capacity", scope: !4, file: !2, line: 33, baseType: !20, size: 64, align: 64, offset: 2112)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "fake_stdout", scope: !4, file: !2, line: 34, baseType: !38, size: 64, align: 64, offset: 2176)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !4, file: !2, line: 4, size: 64, align: 64, elements: !39, identifier: "std.io.File")
!39 = !{!40}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !38, file: !2, line: 6, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !2, file: !2, line: 374, baseType: !42, align: 8)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "stored", scope: !4, file: !2, line: 35, baseType: !44, size: 256, align: 64, offset: 2240)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "stored", scope: !4, file: !2, line: 35, size: 256, align: 64, elements: !45, identifier: "std.core.runtime.stored")
!45 = !{!46, !47, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "stdout", scope: !44, file: !2, line: 37, baseType: !38, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "stderr", scope: !44, file: !2, line: 38, baseType: !38, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !44, file: !2, line: 39, baseType: !49, size: 128, align: 64, offset: 128)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !50, identifier: "Allocator")
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !49, baseType: !42, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !49, baseType: !53, size: 64, align: 64, offset: 64)
!53 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "DEFAULT_BENCHMARK_WARMUP_ITERATIONS", linkageName: "std.core.runtime.DEFAULT_BENCHMARK_WARMUP_ITERATIONS", scope: !56, file: !56, line: 24, type: !57, isLocal: false, isDefinition: true, align: 4)
!56 = !DIFile(filename: "runtime_benchmark.c3", directory: "/usr/lib/c3c/lib/std/core")
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "DEFAULT_BENCHMARK_MAX_ITERATIONS", linkageName: "std.core.runtime.DEFAULT_BENCHMARK_MAX_ITERATIONS", scope: !56, file: !56, line: 25, type: !57, isLocal: false, isDefinition: true, align: 4)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "benchmark_warmup_iterations", linkageName: "std.core.runtime.benchmark_warmup_iterations", scope: !56, file: !56, line: 27, type: !62, isLocal: true, isDefinition: true, align: 4)
!62 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "benchmark_max_iterations", linkageName: "std.core.runtime.benchmark_max_iterations", scope: !56, file: !56, line: 28, type: !62, isLocal: true, isDefinition: true, align: 4)
!65 = !{i32 2, !"Dwarf Version", i32 4}
!66 = !{i32 2, !"Debug Info Version", i32 3}
!67 = !{i32 2, !"wchar_size", i32 4}
!68 = !{i32 4, !"PIE Level", i32 2}
!69 = !{i32 4, !"PIC Level", i32 2}
!70 = !{i32 1, !"uwtable", i32 2}
!71 = !{i32 2, !"frame-pointer", i32 2}
!72 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !73, splitDebugInlining: false)
!73 = !{!0, !54, !58, !60, !63}
!74 = distinct !DISubprogram(name: "test_collection_create", linkageName: "std.core.runtime.test_collection_create", scope: !2, file: !2, line: 49, type: !75, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !72, retainedNodes: !86)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !49}
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestUnit[]", size: 128, align: 64, elements: !78, identifier: "TestUnit[]")
!78 = !{!79, !85}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !77, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestUnit*", baseType: !81, size: 64, align: 64, dwarfAddressSpace: 0)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestUnit", scope: !2, file: !2, line: 43, size: 192, align: 64, elements: !82, identifier: "std.core.runtime.TestUnit")
!82 = !{!83, !84}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !2, line: 45, baseType: !13, size: 128, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !81, file: !2, line: 46, baseType: !30, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !77, baseType: !20, size: 64, align: 64, offset: 64)
!86 = !{}
!87 = !DILocalVariable(name: "allocator", arg: 1, scope: !74, file: !2, line: 49, type: !49)
!88 = !DILocation(line: 49, column: 48, scope: !74)
!89 = !DILocalVariable(name: "fns", scope: !74, file: !2, line: 51, type: !90, align: 8)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestFn[]", size: 128, align: 64, elements: !91, identifier: "TestFn[]")
!91 = !{!92, !94}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !90, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestFn*", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !90, baseType: !20, size: 64, align: 64, offset: 64)
!95 = !DILocation(line: 51, column: 11, scope: !74)
!96 = !DILocation(line: 51, column: 17, scope: !74)
!97 = !DILocalVariable(name: "names", scope: !74, file: !2, line: 52, type: !98, align: 8)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !99, identifier: "String[]")
!99 = !{!100, !102}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !98, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !98, baseType: !20, size: 64, align: 64, offset: 64)
!103 = !DILocation(line: 52, column: 11, scope: !74)
!104 = !DILocation(line: 52, column: 19, scope: !74)
!105 = !DILocalVariable(name: "tests", scope: !74, file: !2, line: 53, type: !77, align: 8)
!106 = !DILocation(line: 53, column: 13, scope: !74)
!107 = !DILocation(line: 53, column: 65, scope: !74)
!108 = !DILocation(line: 303, column: 55, scope: !109, inlinedAt: !111)
!109 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !110, file: !110, line: 301, scopeLine: 301, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!110 = !DIFile(filename: "mem_allocator.c3", directory: "/usr/lib/c3c/lib/std/core")
!111 = !DILocation(line: 286, column: 9, scope: !112, inlinedAt: !113)
!112 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !110, file: !110, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!113 = !DILocation(line: 53, column: 21, scope: !74)
!114 = !DILocation(line: 303, column: 40, scope: !109, inlinedAt: !111)
!115 = !DILocation(line: 79, column: 6, scope: !116, inlinedAt: !117)
!116 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !110, file: !110, line: 77, scopeLine: 77, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!117 = !DILocation(line: 303, column: 18, scope: !109, inlinedAt: !111)
!118 = !DILocation(line: 79, column: 20, scope: !116, inlinedAt: !117)
!119 = !DILocation(line: 85, column: 28, scope: !116, inlinedAt: !117)
!120 = !DILocation(line: 37, column: 12, scope: !116, inlinedAt: !117)
!121 = !DILocation(line: 973, column: 9, scope: !122, inlinedAt: !124)
!122 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !123, file: !123, line: 971, scopeLine: 971, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!123 = !DIFile(filename: "math.c3", directory: "/usr/lib/c3c/lib/std/math")
!124 = !DILocation(line: 37, column: 26, scope: !116, inlinedAt: !117)
!125 = !DILocation(line: 973, column: 20, scope: !122, inlinedAt: !124)
!126 = !DILocation(line: 973, column: 25, scope: !122, inlinedAt: !124)
!127 = !DILocation(line: 85, column: 10, scope: !116, inlinedAt: !117)
!128 = !DILocation(line: 303, column: 67, scope: !109, inlinedAt: !111)
!129 = !DILocation(line: 303, column: 10, scope: !109, inlinedAt: !111)
!130 = !DILocation(line: 54, column: 21, scope: !131)
!131 = distinct !DILexicalBlock(scope: !74, file: !2, line: 54, column: 2)
!132 = !DILocalVariable(name: ".temp", scope: !131, file: !2, line: 54, type: !20, align: 8)
!133 = !DILocation(line: 54, column: 11, scope: !131)
!134 = !DILocalVariable(name: "i", scope: !135, file: !2, line: 54, type: !20, align: 8)
!135 = distinct !DILexicalBlock(scope: !131, file: !2, line: 55, column: 2)
!136 = !DILocation(line: 54, column: 11, scope: !135)
!137 = !DILocalVariable(name: "test", scope: !135, file: !2, line: 54, type: !31, align: 8)
!138 = !DILocation(line: 54, column: 14, scope: !135)
!139 = !DILocation(line: 54, column: 21, scope: !135)
!140 = !DILocation(line: 56, column: 3, scope: !141)
!141 = distinct !DILexicalBlock(scope: !135, file: !2, line: 55, column: 2)
!142 = !DILocation(line: 56, column: 9, scope: !141)
!143 = !DILocation(line: 56, column: 16, scope: !141)
!144 = !DILocation(line: 56, column: 22, scope: !141)
!145 = !DILocation(line: 56, column: 26, scope: !141)
!146 = !DILocation(line: 56, column: 30, scope: !141)
!147 = !DILocation(line: 58, column: 9, scope: !74)
!148 = distinct !DISubprogram(name: "cmp_test_unit", linkageName: "std.core.runtime.cmp_test_unit", scope: !2, file: !2, line: 62, type: !149, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !72, retainedNodes: !86)
!149 = !DISubroutineType(types: !150)
!150 = !{!57, !81, !81}
!151 = !DILocalVariable(name: "a", arg: 1, scope: !148, file: !2, line: 62, type: !81)
!152 = !DILocation(line: 62, column: 31, scope: !148)
!153 = !DILocalVariable(name: "b", arg: 2, scope: !148, file: !2, line: 62, type: !81)
!154 = !DILocation(line: 62, column: 43, scope: !148)
!155 = !DILocalVariable(name: "an", scope: !148, file: !2, line: 64, type: !20, align: 8)
!156 = !DILocation(line: 64, column: 6, scope: !148)
!157 = !DILocation(line: 64, column: 11, scope: !148)
!158 = !DILocalVariable(name: "bn", scope: !148, file: !2, line: 65, type: !20, align: 8)
!159 = !DILocation(line: 65, column: 6, scope: !148)
!160 = !DILocation(line: 65, column: 11, scope: !148)
!161 = !DILocation(line: 66, column: 6, scope: !148)
!162 = !DILocation(line: 66, column: 11, scope: !148)
!163 = !DILocalVariable(name: "temp", scope: !164, file: !2, line: 79, type: !81, align: 8)
!164 = distinct !DISubprogram(name: "@swap", linkageName: "@swap", scope: !165, file: !165, line: 77, scopeLine: 77, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72, retainedNodes: !86)
!165 = !DIFile(filename: "builtin.c3", directory: "/usr/lib/c3c/lib/std/core")
!166 = !DILocation(line: 79, column: 6, scope: !164, inlinedAt: !167)
!167 = !DILocation(line: 66, column: 15, scope: !148)
!168 = !DILocation(line: 79, column: 13, scope: !164, inlinedAt: !167)
!169 = !DILocation(line: 80, column: 7, scope: !164, inlinedAt: !167)
!170 = !DILocation(line: 81, column: 7, scope: !164, inlinedAt: !167)
!171 = !DILocation(line: 67, column: 19, scope: !172)
!172 = distinct !DILexicalBlock(scope: !148, file: !2, line: 67, column: 2)
!173 = !DILocalVariable(name: ".temp", scope: !172, file: !2, line: 67, type: !20, align: 8)
!174 = !DILocation(line: 67, column: 11, scope: !172)
!175 = !DILocalVariable(name: "i", scope: !176, file: !2, line: 67, type: !20, align: 8)
!176 = distinct !DILexicalBlock(scope: !172, file: !2, line: 68, column: 2)
!177 = !DILocation(line: 67, column: 11, scope: !176)
!178 = !DILocalVariable(name: "ac", scope: !176, file: !2, line: 67, type: !18, align: 1)
!179 = !DILocation(line: 67, column: 14, scope: !176)
!180 = !DILocation(line: 67, column: 19, scope: !176)
!181 = !DILocalVariable(name: "bc", scope: !182, file: !2, line: 69, type: !18, align: 1)
!182 = distinct !DILexicalBlock(scope: !176, file: !2, line: 68, column: 2)
!183 = !DILocation(line: 69, column: 8, scope: !182)
!184 = !DILocation(line: 69, column: 13, scope: !182)
!185 = !DILocation(line: 69, column: 20, scope: !182)
!186 = !DILocation(line: 70, column: 7, scope: !182)
!187 = !DILocation(line: 70, column: 13, scope: !182)
!188 = !DILocation(line: 70, column: 24, scope: !182)
!189 = !DILocation(line: 70, column: 29, scope: !182)
!190 = !DILocation(line: 70, column: 34, scope: !182)
!191 = !DILocation(line: 70, column: 39, scope: !182)
!192 = !DILocation(line: 70, column: 44, scope: !182)
!193 = !DILocation(line: 70, column: 49, scope: !182)
!194 = !DILocation(line: 72, column: 15, scope: !148)
!195 = !DILocation(line: 72, column: 20, scope: !148)
!196 = !DILocation(line: 72, column: 9, scope: !148)
!197 = distinct !DISubprogram(name: "terminal_has_ansi_codes", linkageName: "std.core.runtime.terminal_has_ansi_codes", scope: !2, file: !2, line: 75, type: !198, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72, retainedNodes: !86)
!198 = !DISubroutineType(types: !199)
!199 = !{!22}
!200 = !DILocalVariable(name: "state", scope: !201, file: !2, line: 594, type: !203, align: 8)
!201 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !202, file: !202, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72, retainedNodes: !86)
!202 = !DIFile(filename: "mem.c3", directory: "/usr/lib/c3c/lib/std/core")
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 402, baseType: !204, align: 8)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !205, size: 64, align: 64, dwarfAddressSpace: 0)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 32, size: 512, align: 64, elements: !206, identifier: "std.core.mem.allocator.TempAllocator")
!206 = !{!207, !208, !220, !221, !222, !223, !224, !225}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !205, file: !2, line: 34, baseType: !49, size: 128, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !205, file: !2, line: 35, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !210, size: 64, align: 64, dwarfAddressSpace: 0)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 52, size: 256, align: 64, elements: !211, identifier: "std.core.mem.allocator.TempAllocatorPage")
!211 = !{!212, !213, !214, !215, !216}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !210, file: !2, line: 54, baseType: !209, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !210, file: !2, line: 55, baseType: !42, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !210, file: !2, line: 56, baseType: !20, size: 64, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !210, file: !2, line: 57, baseType: !20, size: 64, align: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !210, file: !2, line: 58, baseType: !217, align: 8, offset: 256)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, align: 8, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 0, lowerBound: 0)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !205, file: !2, line: 36, baseType: !204, size: 64, align: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !205, file: !2, line: 37, baseType: !22, size: 8, align: 8, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !205, file: !2, line: 38, baseType: !20, size: 64, align: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !205, file: !2, line: 39, baseType: !20, size: 64, align: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !205, file: !2, line: 40, baseType: !20, size: 64, align: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !205, file: !2, line: 41, baseType: !217, align: 8, offset: 512)
!226 = !DILocation(line: 594, column: 12, scope: !201, inlinedAt: !227)
!227 = !DILocation(line: 75, column: 45, scope: !197)
!228 = !DILocation(line: 594, column: 20, scope: !201, inlinedAt: !227)
!229 = !DILocalVariable(name: "v", scope: !230, file: !2, line: 78, type: !13, align: 8)
!230 = distinct !DILexicalBlock(scope: !197, file: !2, line: 76, column: 1)
!231 = !DILocation(line: 78, column: 10, scope: !230)
!232 = !DILocation(line: 78, column: 14, scope: !230)
!233 = !DILocation(line: 80, column: 18, scope: !234)
!234 = distinct !DILexicalBlock(scope: !230, file: !2, line: 79, column: 2)
!235 = !DILocation(line: 80, column: 7, scope: !234)
!236 = !DILocation(line: 80, column: 41, scope: !234)
!237 = !DILocation(line: 80, column: 30, scope: !234)
!238 = !DILocation(line: 80, column: 64, scope: !234)
!239 = !DILocation(line: 80, column: 53, scope: !234)
!240 = !DILocation(line: 597, column: 23, scope: !241, inlinedAt: !227)
!241 = distinct !DILexicalBlock(scope: !201, file: !202, line: 596, column: 2)
!242 = !DILocation(line: 597, column: 3, scope: !241, inlinedAt: !227)
!243 = !DILocation(line: 85, column: 10, scope: !230)
!244 = !DILocation(line: 597, column: 23, scope: !245, inlinedAt: !227)
!245 = distinct !DILexicalBlock(scope: !201, file: !202, line: 596, column: 2)
!246 = !DILocation(line: 597, column: 3, scope: !245, inlinedAt: !227)
!247 = distinct !DISubprogram(name: "test_panic", linkageName: "std.core.runtime.test_panic", scope: !2, file: !2, line: 89, type: !248, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72, retainedNodes: !86)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !13, !13, !13, !62}
!250 = !DILocalVariable(name: "message", arg: 1, scope: !247, file: !2, line: 89, type: !13)
!251 = !DILocation(line: 89, column: 27, scope: !247)
!252 = !DILocalVariable(name: "file", arg: 2, scope: !247, file: !2, line: 89, type: !13)
!253 = !DILocation(line: 89, column: 43, scope: !247)
!254 = !DILocalVariable(name: "function", arg: 3, scope: !247, file: !2, line: 89, type: !13)
!255 = !DILocation(line: 89, column: 56, scope: !247)
!256 = !DILocalVariable(name: "line", arg: 4, scope: !247, file: !2, line: 89, type: !62)
!257 = !DILocation(line: 89, column: 71, scope: !247)
!258 = !DILocation(line: 91, column: 6, scope: !247)
!259 = !DILocation(line: 91, column: 38, scope: !247)
!260 = !DILocation(line: 92, column: 2, scope: !247)
!261 = !DILocation(line: 92, column: 29, scope: !247)
!262 = !DILocation(line: 94, column: 2, scope: !247)
!263 = !DILocation(line: 95, column: 8, scope: !247)
!264 = !DILocation(line: 220, column: 11, scope: !247)
!265 = !DILocation(line: 95, column: 2, scope: !247)
!266 = !DILocation(line: 96, column: 6, scope: !247)
!267 = !DILocation(line: 99, column: 41, scope: !268)
!268 = distinct !DILexicalBlock(scope: !247, file: !2, line: 97, column: 2)
!269 = !DILocation(line: 99, column: 7, scope: !268)
!270 = !DILocation(line: 102, column: 50, scope: !247)
!271 = !DILocation(line: 102, column: 56, scope: !247)
!272 = !DILocation(line: 102, column: 62, scope: !247)
!273 = !DILocation(line: 102, column: 2, scope: !247)
!274 = !DILocation(line: 103, column: 2, scope: !247)
!275 = !DILocation(line: 103, column: 40, scope: !247)
!276 = !DILocation(line: 105, column: 6, scope: !247)
!277 = !DILocation(line: 226, column: 2, scope: !278, inlinedAt: !279)
!278 = distinct !DISubprogram(name: "breakpoint", linkageName: "breakpoint", scope: !165, file: !165, line: 224, scopeLine: 224, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!279 = !DILocation(line: 107, column: 3, scope: !280)
!280 = distinct !DILexicalBlock(scope: !247, file: !2, line: 106, column: 2)
!281 = !DILocation(line: 110, column: 6, scope: !247)
!282 = !DILocation(line: 112, column: 3, scope: !283)
!283 = distinct !DILexicalBlock(scope: !247, file: !2, line: 111, column: 2)
!284 = !DILocation(line: 115, column: 2, scope: !247)
!285 = !DILocation(line: 115, column: 29, scope: !247)
!286 = !DILocation(line: 116, column: 32, scope: !247)
!287 = !DILocation(line: 117, column: 17, scope: !247)
!288 = !DILocation(line: 117, column: 2, scope: !247)
!289 = distinct !DISubprogram(name: "mute_output", linkageName: "std.core.runtime.mute_output", scope: !2, file: !2, line: 120, type: !32, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72, retainedNodes: !86)
!290 = !DILocation(line: 122, column: 6, scope: !289)
!291 = !DILocation(line: 122, column: 37, scope: !289)
!292 = !DILocation(line: 122, column: 74, scope: !289)
!293 = !DILocalVariable(name: "stdout", scope: !289, file: !2, line: 123, type: !294, align: 8)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "File*", baseType: !38, size: 64, align: 64, dwarfAddressSpace: 0)
!295 = !DILocation(line: 123, column: 8, scope: !289)
!296 = !DILocation(line: 123, column: 17, scope: !289)
!297 = !DILocalVariable(name: "stderr", scope: !289, file: !2, line: 124, type: !294, align: 8)
!298 = !DILocation(line: 124, column: 11, scope: !289)
!299 = !DILocation(line: 124, column: 20, scope: !289)
!300 = !DILocation(line: 125, column: 3, scope: !289)
!301 = !DILocation(line: 125, column: 12, scope: !289)
!302 = !DILocation(line: 126, column: 3, scope: !289)
!303 = !DILocation(line: 126, column: 12, scope: !289)
!304 = !DILocation(line: 127, column: 8, scope: !289)
!305 = !DILocation(line: 62, column: 11, scope: !289)
!306 = !DILocation(line: 127, column: 2, scope: !289)
!307 = distinct !DISubprogram(name: "unmute_output", linkageName: "std.core.runtime.unmute_output", scope: !2, file: !2, line: 130, type: !308, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72, retainedNodes: !86)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !22}
!310 = !DILocalVariable(name: "has_error", arg: 1, scope: !307, file: !2, line: 130, type: !22)
!311 = !DILocation(line: 130, column: 28, scope: !307)
!312 = !DILocation(line: 132, column: 6, scope: !307)
!313 = !DILocation(line: 132, column: 37, scope: !307)
!314 = !DILocation(line: 132, column: 74, scope: !307)
!315 = !DILocalVariable(name: "stdout", scope: !307, file: !2, line: 134, type: !294, align: 8)
!316 = !DILocation(line: 134, column: 8, scope: !307)
!317 = !DILocation(line: 134, column: 17, scope: !307)
!318 = !DILocalVariable(name: "stderr", scope: !307, file: !2, line: 135, type: !294, align: 8)
!319 = !DILocation(line: 135, column: 8, scope: !307)
!320 = !DILocation(line: 135, column: 17, scope: !307)
!321 = !DILocation(line: 137, column: 3, scope: !307)
!322 = !DILocation(line: 137, column: 12, scope: !307)
!323 = !DILocation(line: 138, column: 3, scope: !307)
!324 = !DILocation(line: 138, column: 12, scope: !307)
!325 = !DILocalVariable(name: "log_size", scope: !307, file: !2, line: 140, type: !20, align: 8)
!326 = !DILocation(line: 140, column: 6, scope: !307)
!327 = !DILocation(line: 140, column: 17, scope: !307)
!328 = !DILocation(line: 62, column: 11, scope: !307)
!329 = !DILocation(line: 141, column: 6, scope: !307)
!330 = !DILocation(line: 143, column: 31, scope: !331)
!331 = distinct !DILexicalBlock(scope: !307, file: !2, line: 142, column: 2)
!332 = !DILocation(line: 143, column: 3, scope: !331)
!333 = !DILocation(line: 144, column: 14, scope: !331)
!334 = !DILocation(line: 144, column: 68, scope: !331)
!335 = !DILocation(line: 198, column: 16, scope: !336, inlinedAt: !338)
!336 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !337, file: !337, line: 196, scopeLine: 196, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!337 = !DIFile(filename: "io.c3", directory: "/usr/lib/c3c/lib/std/io")
!338 = !DILocation(line: 144, column: 3, scope: !331)
!339 = !DILocalVariable(name: "len", scope: !340, file: !2, line: 172, type: !20, align: 8)
!340 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !337, file: !337, line: 170, scopeLine: 170, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72, retainedNodes: !86)
!341 = !DILocation(line: 172, column: 6, scope: !340, inlinedAt: !342)
!342 = !DILocation(line: 198, column: 2, scope: !336, inlinedAt: !338)
!343 = !DILocation(line: 116, column: 24, scope: !344, inlinedAt: !345)
!344 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !337, file: !337, line: 112, scopeLine: 112, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!345 = !DILocation(line: 172, column: 12, scope: !340, inlinedAt: !342)
!346 = !DILocation(line: 116, column: 34, scope: !344, inlinedAt: !345)
!347 = !DILocation(line: 139, column: 11, scope: !344, inlinedAt: !345)
!348 = !DILocation(line: 173, column: 2, scope: !340, inlinedAt: !342)
!349 = !DILocation(line: 88, column: 11, scope: !340, inlinedAt: !342)
!350 = !DILocation(line: 178, column: 4, scope: !340, inlinedAt: !342)
!351 = !DILocation(line: 220, column: 11, scope: !340, inlinedAt: !342)
!352 = !DILocation(line: 180, column: 9, scope: !340, inlinedAt: !342)
!353 = !DILocation(line: 147, column: 6, scope: !307)
!354 = !DILocation(line: 147, column: 19, scope: !307)
!355 = !DILocation(line: 149, column: 3, scope: !356)
!356 = distinct !DILexicalBlock(scope: !307, file: !2, line: 148, column: 2)
!357 = !DILocation(line: 88, column: 11, scope: !356)
!358 = !DILocation(line: 150, column: 3, scope: !356)
!359 = !DILocation(line: 151, column: 9, scope: !356)
!360 = !DILocation(line: 62, column: 11, scope: !356)
!361 = !DILocation(line: 151, column: 3, scope: !356)
!362 = !DILocation(line: 153, column: 3, scope: !356)
!363 = !DILocation(line: 154, column: 23, scope: !356)
!364 = !DILocation(line: 154, column: 3, scope: !356)
!365 = !DILocation(line: 155, column: 3, scope: !356)
!366 = !DILocalVariable(name: "c", scope: !367, file: !2, line: 155, type: !18, align: 1)
!367 = distinct !DILexicalBlock(scope: !356, file: !2, line: 155, column: 3)
!368 = !DILocation(line: 155, column: 14, scope: !367)
!369 = !DILocation(line: 155, column: 18, scope: !367)
!370 = !DILocation(line: 157, column: 18, scope: !371, inlinedAt: !372)
!371 = distinct !DISubprogram(name: "@unlikely", linkageName: "@unlikely", scope: !165, file: !165, line: 322, scopeLine: 322, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!372 = !DILocation(line: 157, column: 8, scope: !373)
!373 = distinct !DILexicalBlock(scope: !367, file: !2, line: 156, column: 3)
!374 = !DILocation(line: 328, column: 18, scope: !371, inlinedAt: !372)
!375 = !DILocation(line: 328, column: 26, scope: !371, inlinedAt: !372)
!376 = !DILocation(line: 160, column: 5, scope: !377)
!377 = distinct !DILexicalBlock(scope: !373, file: !2, line: 158, column: 4)
!378 = !DILocation(line: 162, column: 18, scope: !373)
!379 = !DILocation(line: 162, column: 4, scope: !373)
!380 = !DILocation(line: 164, column: 3, scope: !356)
!381 = !DILocation(line: 166, column: 8, scope: !307)
!382 = !DILocation(line: 220, column: 11, scope: !307)
!383 = !DILocation(line: 166, column: 2, scope: !307)
!384 = distinct !DISubprogram(name: "run_tests", linkageName: "std.core.runtime.run_tests", scope: !2, file: !2, line: 169, type: !385, scopeLine: 169, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72, retainedNodes: !86)
!385 = !DISubroutineType(types: !386)
!386 = !{!22, !98, !77}
!387 = !DILocalVariable(name: "args", arg: 1, scope: !384, file: !2, line: 169, type: !98)
!388 = !DILocation(line: 169, column: 28, scope: !384)
!389 = !DILocalVariable(name: "tests", arg: 2, scope: !384, file: !2, line: 169, type: !77)
!390 = !DILocation(line: 169, column: 45, scope: !384)
!391 = !DILocalVariable(name: "max_name", scope: !384, file: !2, line: 171, type: !20, align: 8)
!392 = !DILocation(line: 171, column: 6, scope: !384)
!393 = !DILocalVariable(name: "sort_tests", scope: !384, file: !2, line: 172, type: !22, align: 1)
!394 = !DILocation(line: 172, column: 7, scope: !384)
!395 = !DILocation(line: 172, column: 20, scope: !384)
!396 = !DILocalVariable(name: "check_leaks", scope: !384, file: !2, line: 173, type: !22, align: 1)
!397 = !DILocation(line: 173, column: 7, scope: !384)
!398 = !DILocation(line: 173, column: 21, scope: !384)
!399 = !DILocation(line: 174, column: 19, scope: !400)
!400 = distinct !DILexicalBlock(scope: !384, file: !2, line: 174, column: 2)
!401 = !DILocalVariable(name: ".temp", scope: !400, file: !2, line: 174, type: !20, align: 8)
!402 = !DILocalVariable(name: "unit", scope: !403, file: !2, line: 174, type: !80, align: 8)
!403 = distinct !DILexicalBlock(scope: !400, file: !2, line: 175, column: 2)
!404 = !DILocation(line: 174, column: 12, scope: !403)
!405 = !DILocation(line: 174, column: 19, scope: !403)
!406 = !DILocation(line: 176, column: 7, scope: !407)
!407 = distinct !DILexicalBlock(scope: !403, file: !2, line: 175, column: 2)
!408 = !DILocation(line: 176, column: 18, scope: !407)
!409 = !DILocation(line: 176, column: 44, scope: !407)
!410 = !DILocalVariable(name: "context", scope: !384, file: !2, line: 178, type: !4, align: 8)
!411 = !DILocation(line: 178, column: 14, scope: !384)
!412 = !DILocation(line: 180, column: 29, scope: !384)
!413 = !DILocation(line: 181, column: 27, scope: !384)
!414 = !DILocation(line: 182, column: 18, scope: !384)
!415 = !DILocation(line: 183, column: 21, scope: !384)
!416 = !DILocation(line: 184, column: 23, scope: !384)
!417 = !DILocation(line: 185, column: 21, scope: !384)
!418 = !DILocation(line: 186, column: 21, scope: !384)
!419 = !DILocalVariable(name: "i", scope: !420, file: !2, line: 188, type: !57, align: 4)
!420 = distinct !DILexicalBlock(scope: !384, file: !2, line: 188, column: 2)
!421 = !DILocation(line: 188, column: 11, scope: !420)
!422 = !DILocation(line: 188, column: 15, scope: !420)
!423 = !DILocation(line: 188, column: 18, scope: !420)
!424 = !DILocation(line: 188, column: 22, scope: !420)
!425 = !DILocation(line: 190, column: 11, scope: !426)
!426 = distinct !DILexicalBlock(scope: !427, file: !2, line: 190, column: 3)
!427 = distinct !DILexicalBlock(scope: !420, file: !2, line: 189, column: 2)
!428 = !DILocation(line: 190, column: 16, scope: !426)
!429 = !DILocation(line: 192, column: 9, scope: !426)
!430 = !DILocation(line: 193, column: 5, scope: !431)
!431 = distinct !DILexicalBlock(scope: !426, file: !2, line: 193, column: 5)
!432 = !DILocation(line: 193, column: 36, scope: !431)
!433 = !DILocation(line: 194, column: 9, scope: !426)
!434 = !DILocation(line: 195, column: 18, scope: !435)
!435 = distinct !DILexicalBlock(scope: !426, file: !2, line: 195, column: 5)
!436 = !DILocation(line: 196, column: 9, scope: !426)
!437 = !DILocation(line: 197, column: 19, scope: !438)
!438 = distinct !DILexicalBlock(scope: !426, file: !2, line: 197, column: 5)
!439 = !DILocation(line: 198, column: 9, scope: !426)
!440 = !DILocation(line: 199, column: 5, scope: !441)
!441 = distinct !DILexicalBlock(scope: !426, file: !2, line: 199, column: 5)
!442 = !DILocation(line: 199, column: 29, scope: !441)
!443 = !DILocation(line: 200, column: 9, scope: !426)
!444 = !DILocation(line: 201, column: 5, scope: !445)
!445 = distinct !DILexicalBlock(scope: !426, file: !2, line: 201, column: 5)
!446 = !DILocation(line: 201, column: 30, scope: !445)
!447 = !DILocation(line: 202, column: 9, scope: !426)
!448 = !DILocation(line: 203, column: 5, scope: !449)
!449 = distinct !DILexicalBlock(scope: !426, file: !2, line: 203, column: 5)
!450 = !DILocation(line: 203, column: 30, scope: !449)
!451 = !DILocation(line: 204, column: 9, scope: !426)
!452 = !DILocation(line: 205, column: 5, scope: !453)
!453 = distinct !DILexicalBlock(scope: !426, file: !2, line: 205, column: 5)
!454 = !DILocation(line: 205, column: 29, scope: !453)
!455 = !DILocation(line: 206, column: 9, scope: !426)
!456 = !DILocation(line: 207, column: 9, scope: !457)
!457 = distinct !DILexicalBlock(scope: !426, file: !2, line: 207, column: 5)
!458 = !DILocation(line: 207, column: 14, scope: !457)
!459 = !DILocation(line: 198, column: 16, scope: !460, inlinedAt: !461)
!460 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !337, file: !337, line: 196, scopeLine: 196, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!461 = !DILocation(line: 209, column: 6, scope: !462)
!462 = distinct !DILexicalBlock(scope: !457, file: !2, line: 208, column: 5)
!463 = !DILocalVariable(name: "len", scope: !464, file: !2, line: 172, type: !20, align: 8)
!464 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !337, file: !337, line: 170, scopeLine: 170, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72, retainedNodes: !86)
!465 = !DILocation(line: 172, column: 6, scope: !464, inlinedAt: !466)
!466 = !DILocation(line: 198, column: 2, scope: !460, inlinedAt: !461)
!467 = !DILocation(line: 116, column: 24, scope: !468, inlinedAt: !469)
!468 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !337, file: !337, line: 112, scopeLine: 112, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!469 = !DILocation(line: 172, column: 12, scope: !464, inlinedAt: !466)
!470 = !DILocation(line: 116, column: 34, scope: !468, inlinedAt: !469)
!471 = !DILocation(line: 139, column: 11, scope: !468, inlinedAt: !469)
!472 = !DILocation(line: 173, column: 2, scope: !464, inlinedAt: !466)
!473 = !DILocation(line: 88, column: 11, scope: !464, inlinedAt: !466)
!474 = !DILocation(line: 178, column: 4, scope: !464, inlinedAt: !466)
!475 = !DILocation(line: 220, column: 11, scope: !464, inlinedAt: !466)
!476 = !DILocation(line: 180, column: 9, scope: !464, inlinedAt: !466)
!477 = !DILocation(line: 210, column: 13, scope: !462)
!478 = !DILocation(line: 212, column: 5, scope: !457)
!479 = !DILocation(line: 212, column: 27, scope: !457)
!480 = !DILocation(line: 212, column: 32, scope: !457)
!481 = !DILocation(line: 213, column: 5, scope: !457)
!482 = !DILocation(line: 215, column: 41, scope: !483)
!483 = distinct !DILexicalBlock(scope: !426, file: !2, line: 215, column: 5)
!484 = !DILocation(line: 215, column: 46, scope: !483)
!485 = !DILocation(line: 215, column: 5, scope: !483)
!486 = !DILocation(line: 188, column: 32, scope: !420)
!487 = !DILocation(line: 218, column: 18, scope: !384)
!488 = !DILocation(line: 220, column: 6, scope: !384)
!489 = !DILocalVariable(name: "len", scope: !490, file: !2, line: 16, type: !20, align: 8)
!490 = distinct !DISubprogram(name: "quicksort", linkageName: "quicksort", scope: !491, file: !491, line: 10, scopeLine: 10, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72, retainedNodes: !86)
!491 = !DIFile(filename: "quicksort.c3", directory: "/usr/lib/c3c/lib/std/sort")
!492 = !DILocation(line: 16, column: 7, scope: !490, inlinedAt: !493)
!493 = !DILocation(line: 222, column: 3, scope: !494)
!494 = distinct !DILexicalBlock(scope: !384, file: !2, line: 221, column: 2)
!495 = !DILocation(line: 8, column: 10, scope: !496, inlinedAt: !498)
!496 = distinct !DISubprogram(name: "len_from_list", linkageName: "len_from_list", scope: !497, file: !497, line: 3, scopeLine: 3, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!497 = !DIFile(filename: "sort.c3", directory: "/usr/lib/c3c/lib/std/sort")
!498 = !DILocation(line: 16, column: 13, scope: !490, inlinedAt: !493)
!499 = !DILocation(line: 17, column: 69, scope: !490, inlinedAt: !493)
!500 = !DILocation(line: 17, column: 88, scope: !490, inlinedAt: !493)
!501 = !DILocation(line: 17, column: 3, scope: !490, inlinedAt: !493)
!502 = !DILocation(line: 227, column: 3, scope: !384)
!503 = !DILocation(line: 227, column: 30, scope: !384)
!504 = !DILocation(line: 229, column: 6, scope: !384)
!505 = !DILocation(line: 188, column: 15, scope: !506, inlinedAt: !507)
!506 = distinct !DISubprogram(name: "print", linkageName: "print", scope: !337, file: !337, line: 186, scopeLine: 186, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!507 = !DILocation(line: 231, column: 3, scope: !508)
!508 = distinct !DILexicalBlock(scope: !384, file: !2, line: 230, column: 2)
!509 = !DILocation(line: 116, column: 24, scope: !510, inlinedAt: !511)
!510 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !337, file: !337, line: 112, scopeLine: 112, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!511 = !DILocation(line: 188, column: 2, scope: !506, inlinedAt: !507)
!512 = !DILocation(line: 116, column: 34, scope: !510, inlinedAt: !511)
!513 = !DILocation(line: 139, column: 11, scope: !510, inlinedAt: !511)
!514 = !DILocalVariable(name: "old_panic", scope: !384, file: !2, line: 234, type: !515, align: 8)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "PanicFn", scope: !2, file: !2, line: 175, baseType: !516, align: 8)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PanicFn", baseType: !248, size: 64, align: 64, dwarfAddressSpace: 0)
!517 = !DILocation(line: 234, column: 10, scope: !384)
!518 = !DILocation(line: 234, column: 22, scope: !384)
!519 = !DILocation(line: 236, column: 20, scope: !384)
!520 = !DILocalVariable(name: "tests_passed", scope: !384, file: !2, line: 237, type: !57, align: 4)
!521 = !DILocation(line: 237, column: 6, scope: !384)
!522 = !DILocation(line: 237, column: 21, scope: !384)
!523 = !DILocalVariable(name: "tests_skipped", scope: !384, file: !2, line: 238, type: !57, align: 4)
!524 = !DILocation(line: 238, column: 6, scope: !384)
!525 = !DILocation(line: 238, column: 22, scope: !384)
!526 = !DILocalVariable(name: "test_count", scope: !384, file: !2, line: 239, type: !57, align: 4)
!527 = !DILocation(line: 239, column: 6, scope: !384)
!528 = !DILocation(line: 239, column: 19, scope: !384)
!529 = !DILocalVariable(name: "name", scope: !384, file: !2, line: 240, type: !530, align: 8)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 7, baseType: !531, align: 8)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !532, size: 64, align: 64, dwarfAddressSpace: 0)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 8, baseType: null, align: 1)
!533 = !DILocation(line: 240, column: 10, scope: !384)
!534 = !DILocation(line: 240, column: 17, scope: !384)
!535 = !DILocalVariable(name: "len", scope: !384, file: !2, line: 241, type: !20, align: 8)
!536 = !DILocation(line: 241, column: 6, scope: !384)
!537 = !DILocation(line: 241, column: 12, scope: !384)
!538 = !DILocation(line: 242, column: 26, scope: !384)
!539 = !DILocation(line: 242, column: 2, scope: !384)
!540 = !DILocation(line: 395, column: 27, scope: !541, inlinedAt: !544)
!541 = distinct !DILexicalBlock(scope: !543, file: !542, line: 396, column: 1)
!542 = !DIFile(filename: "dstring.c3", directory: "/usr/lib/c3c/lib/std/core")
!543 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !542, file: !542, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!544 = !DILocation(line: 243, column: 2, scope: !384)
!545 = !DILocation(line: 405, column: 22, scope: !543, inlinedAt: !544)
!546 = !DILocation(line: 405, column: 4, scope: !543, inlinedAt: !544)
!547 = !DILocation(line: 244, column: 26, scope: !384)
!548 = !DILocation(line: 244, column: 32, scope: !384)
!549 = !DILocation(line: 244, column: 2, scope: !384)
!550 = !DILocation(line: 245, column: 7, scope: !384)
!551 = !DILocation(line: 198, column: 16, scope: !552, inlinedAt: !553)
!552 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !337, file: !337, line: 196, scopeLine: 196, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!553 = !DILocation(line: 245, column: 30, scope: !384)
!554 = !DILocalVariable(name: "len", scope: !555, file: !2, line: 172, type: !20, align: 8)
!555 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !337, file: !337, line: 170, scopeLine: 170, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72, retainedNodes: !86)
!556 = !DILocation(line: 172, column: 6, scope: !555, inlinedAt: !557)
!557 = !DILocation(line: 198, column: 2, scope: !552, inlinedAt: !553)
!558 = !DILocation(line: 118, column: 25, scope: !559, inlinedAt: !560)
!559 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !337, file: !337, line: 112, scopeLine: 112, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!560 = !DILocation(line: 172, column: 12, scope: !555, inlinedAt: !557)
!561 = !DILocation(line: 118, column: 35, scope: !559, inlinedAt: !560)
!562 = !DILocation(line: 139, column: 11, scope: !559, inlinedAt: !560)
!563 = !DILocation(line: 173, column: 2, scope: !555, inlinedAt: !557)
!564 = !DILocation(line: 88, column: 11, scope: !555, inlinedAt: !557)
!565 = !DILocation(line: 178, column: 4, scope: !555, inlinedAt: !557)
!566 = !DILocation(line: 220, column: 11, scope: !555, inlinedAt: !557)
!567 = !DILocation(line: 180, column: 9, scope: !555, inlinedAt: !557)
!568 = !DILocation(line: 246, column: 2, scope: !384)
!569 = !DILocalVariable(name: "temp_state", scope: !384, file: !2, line: 247, type: !203, align: 8)
!570 = !DILocation(line: 247, column: 12, scope: !384)
!571 = !DILocation(line: 247, column: 25, scope: !384)
!572 = !DILocation(line: 249, column: 17, scope: !573)
!573 = distinct !DILexicalBlock(scope: !384, file: !2, line: 249, column: 2)
!574 = !DILocalVariable(name: ".temp", scope: !573, file: !2, line: 249, type: !20, align: 8)
!575 = !DILocalVariable(name: "unit", scope: !576, file: !2, line: 249, type: !81, align: 8)
!576 = distinct !DILexicalBlock(scope: !573, file: !2, line: 250, column: 2)
!577 = !DILocation(line: 249, column: 10, scope: !576)
!578 = !DILocation(line: 249, column: 17, scope: !576)
!579 = !DILocation(line: 251, column: 17, scope: !580)
!580 = distinct !DILexicalBlock(scope: !576, file: !2, line: 250, column: 2)
!581 = !DILocation(line: 251, column: 3, scope: !580)
!582 = !DILocation(line: 252, column: 7, scope: !580)
!583 = !DILocation(line: 252, column: 50, scope: !580)
!584 = !DILocation(line: 252, column: 31, scope: !580)
!585 = !DILocation(line: 254, column: 4, scope: !586)
!586 = distinct !DILexicalBlock(scope: !580, file: !2, line: 253, column: 3)
!587 = !DILocation(line: 255, column: 4, scope: !586)
!588 = !DILocation(line: 257, column: 3, scope: !580)
!589 = !DILocation(line: 257, column: 22, scope: !580)
!590 = !DILocation(line: 258, column: 3, scope: !580)
!591 = !DILocation(line: 258, column: 25, scope: !580)
!592 = !DILocation(line: 259, column: 3, scope: !580)
!593 = !DILocation(line: 259, column: 31, scope: !580)
!594 = !DILocation(line: 262, column: 31, scope: !580)
!595 = !DILocation(line: 262, column: 3, scope: !580)
!596 = !DILocation(line: 263, column: 27, scope: !580)
!597 = !DILocation(line: 263, column: 38, scope: !580)
!598 = !DILocation(line: 263, column: 3, scope: !580)
!599 = !DILocation(line: 264, column: 7, scope: !580)
!600 = !DILocation(line: 188, column: 15, scope: !601, inlinedAt: !602)
!601 = distinct !DISubprogram(name: "print", linkageName: "print", scope: !337, file: !337, line: 186, scopeLine: 186, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!602 = !DILocation(line: 266, column: 4, scope: !603)
!603 = distinct !DILexicalBlock(scope: !580, file: !2, line: 265, column: 3)
!604 = !DILocation(line: 116, column: 24, scope: !605, inlinedAt: !606)
!605 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !337, file: !337, line: 112, scopeLine: 112, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!606 = !DILocation(line: 188, column: 2, scope: !601, inlinedAt: !602)
!607 = !DILocation(line: 116, column: 34, scope: !605, inlinedAt: !606)
!608 = !DILocation(line: 139, column: 11, scope: !605, inlinedAt: !606)
!609 = !DILocation(line: 270, column: 22, scope: !610)
!610 = distinct !DILexicalBlock(scope: !580, file: !2, line: 269, column: 3)
!611 = !DILocation(line: 270, column: 4, scope: !610)
!612 = !DILocation(line: 272, column: 9, scope: !580)
!613 = !DILocation(line: 220, column: 11, scope: !580)
!614 = !DILocation(line: 272, column: 3, scope: !580)
!615 = !DILocalVariable(name: "mem", scope: !580, file: !2, line: 273, type: !616, align: 8)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "TrackingAllocator", scope: !2, file: !2, line: 25, size: 640, align: 64, elements: !617, identifier: "std.core.mem.allocator.TrackingAllocator")
!617 = !{!618, !619, !651, !652}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "inner_allocator", scope: !616, file: !2, line: 27, baseType: !49, size: 128, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !616, file: !2, line: 28, baseType: !620, size: 384, align: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "AllocMap", scope: !2, file: !2, line: 16, baseType: !621, align: 8)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !2, file: !2, line: 29, size: 384, align: 64, elements: !622, identifier: "std_collections_map$ulong$std.core.mem.allocator.Allocation$.HashMap")
!622 = !{!623, !646, !647, !648, !649}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !621, file: !2, line: 31, baseType: !624, size: 128, align: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !625, identifier: "Entry*[]")
!625 = !{!626, !645}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !624, baseType: !627, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !628, size: 64, align: 64, dwarfAddressSpace: 0)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !629, size: 64, align: 64, dwarfAddressSpace: 0)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !2, file: !2, line: 21, size: 1344, align: 64, elements: !630, identifier: "std_collections_map$ulong$std.core.mem.allocator.Allocation$.Entry")
!630 = !{!631, !632, !634, !644}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !629, file: !2, line: 23, baseType: !62, size: 32, align: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !629, file: !2, line: 24, baseType: !633, size: 64, align: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !2, file: !2, line: 16, baseType: !9, align: 8)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !629, file: !2, line: 25, baseType: !635, size: 1152, align: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !2, file: !2, line: 16, baseType: !636, align: 8)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocation", scope: !2, file: !2, line: 9, size: 1152, align: 64, elements: !637, identifier: "std.core.mem.allocator.Allocation")
!637 = !{!638, !639, !640}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !636, file: !2, line: 11, baseType: !42, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !636, file: !2, line: 12, baseType: !20, size: 64, align: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "backtrace", scope: !636, file: !2, line: 13, baseType: !641, size: 1024, align: 64, offset: 128)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 1024, align: 64, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 16, lowerBound: 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !629, file: !2, line: 26, baseType: !628, size: 64, align: 64, offset: 1280)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !624, baseType: !20, size: 64, align: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !621, file: !2, line: 32, baseType: !49, size: 128, align: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !621, file: !2, line: 33, baseType: !62, size: 32, align: 32, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !621, file: !2, line: 34, baseType: !62, size: 32, align: 32, offset: 288)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !621, file: !2, line: 35, baseType: !650, size: 32, align: 32, offset: 320)
!650 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mem_total", scope: !616, file: !2, line: 29, baseType: !20, size: 64, align: 64, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "allocs_total", scope: !616, file: !2, line: 30, baseType: !20, size: 64, align: 64, offset: 576)
!653 = !DILocation(line: 273, column: 21, scope: !580)
!654 = !DILocation(line: 275, column: 12, scope: !580)
!655 = !DILocation(line: 275, column: 3, scope: !580)
!656 = !DILocation(line: 276, column: 7, scope: !580)
!657 = !DILocation(line: 278, column: 4, scope: !658)
!658 = distinct !DILexicalBlock(scope: !580, file: !2, line: 277, column: 3)
!659 = !DILocation(line: 279, column: 4, scope: !658)
!660 = !DILocation(line: 280, column: 8, scope: !658)
!661 = !DILocation(line: 280, column: 51, scope: !658)
!662 = !DILocation(line: 281, column: 4, scope: !658)
!663 = !DILocation(line: 283, column: 8, scope: !658)
!664 = !DILocation(line: 285, column: 5, scope: !665)
!665 = distinct !DILexicalBlock(scope: !658, file: !2, line: 284, column: 4)
!666 = !DILocation(line: 287, column: 8, scope: !658)
!667 = !DILocation(line: 287, column: 51, scope: !658)
!668 = !DILocation(line: 289, column: 4, scope: !658)
!669 = !DILocation(line: 290, column: 8, scope: !658)
!670 = !DILocation(line: 292, column: 9, scope: !671)
!671 = distinct !DILexicalBlock(scope: !658, file: !2, line: 291, column: 4)
!672 = !DILocation(line: 292, column: 52, scope: !671)
!673 = !DILocation(line: 292, column: 32, scope: !671)
!674 = !DILocation(line: 293, column: 15, scope: !671)
!675 = !DILocation(line: 293, column: 64, scope: !671)
!676 = !DILocation(line: 188, column: 15, scope: !677, inlinedAt: !678)
!677 = distinct !DISubprogram(name: "print", linkageName: "print", scope: !337, file: !337, line: 186, scopeLine: 186, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!678 = !DILocation(line: 293, column: 5, scope: !671)
!679 = !DILocation(line: 116, column: 24, scope: !680, inlinedAt: !681)
!680 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !337, file: !337, line: 112, scopeLine: 112, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!681 = !DILocation(line: 188, column: 2, scope: !677, inlinedAt: !678)
!682 = !DILocation(line: 116, column: 34, scope: !680, inlinedAt: !681)
!683 = !DILocation(line: 139, column: 11, scope: !680, inlinedAt: !681)
!684 = !DILocation(line: 198, column: 16, scope: !685, inlinedAt: !686)
!685 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !337, file: !337, line: 196, scopeLine: 196, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!686 = !DILocation(line: 294, column: 5, scope: !671)
!687 = !DILocalVariable(name: "len", scope: !688, file: !2, line: 172, type: !20, align: 8)
!688 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !337, file: !337, line: 170, scopeLine: 170, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72, retainedNodes: !86)
!689 = !DILocation(line: 172, column: 6, scope: !688, inlinedAt: !690)
!690 = !DILocation(line: 198, column: 2, scope: !685, inlinedAt: !686)
!691 = !DILocation(line: 116, column: 24, scope: !692, inlinedAt: !693)
!692 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !337, file: !337, line: 112, scopeLine: 112, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!693 = !DILocation(line: 172, column: 12, scope: !688, inlinedAt: !690)
!694 = !DILocation(line: 116, column: 34, scope: !692, inlinedAt: !693)
!695 = !DILocation(line: 139, column: 11, scope: !692, inlinedAt: !693)
!696 = !DILocation(line: 173, column: 2, scope: !688, inlinedAt: !690)
!697 = !DILocation(line: 88, column: 11, scope: !688, inlinedAt: !690)
!698 = !DILocation(line: 178, column: 4, scope: !688, inlinedAt: !690)
!699 = !DILocation(line: 220, column: 11, scope: !688, inlinedAt: !690)
!700 = !DILocation(line: 180, column: 9, scope: !688, inlinedAt: !690)
!701 = !DILocation(line: 295, column: 5, scope: !671)
!702 = !DILocation(line: 299, column: 10, scope: !703)
!703 = distinct !DILexicalBlock(scope: !658, file: !2, line: 298, column: 4)
!704 = !DILocation(line: 301, column: 18, scope: !705)
!705 = distinct !DILexicalBlock(scope: !703, file: !2, line: 300, column: 5)
!706 = !DILocation(line: 301, column: 67, scope: !705)
!707 = !DILocation(line: 301, column: 6, scope: !705)
!708 = !DILocation(line: 303, column: 5, scope: !703)
!709 = !DILocation(line: 306, column: 3, scope: !580)
!710 = !DILocation(line: 261, column: 9, scope: !711)
!711 = distinct !DILexicalBlock(scope: !580, file: !2, line: 261, column: 9)
!712 = !DILocation(line: 308, column: 36, scope: !384)
!713 = !DILocation(line: 308, column: 47, scope: !384)
!714 = !DILocation(line: 308, column: 62, scope: !384)
!715 = !DILocation(line: 308, column: 85, scope: !384)
!716 = !DILocation(line: 308, column: 2, scope: !384)
!717 = !DILocalVariable(name: "n_failed", scope: !384, file: !2, line: 310, type: !57, align: 4)
!718 = !DILocation(line: 310, column: 6, scope: !384)
!719 = !DILocation(line: 310, column: 17, scope: !384)
!720 = !DILocation(line: 310, column: 30, scope: !384)
!721 = !DILocation(line: 310, column: 45, scope: !384)
!722 = !DILocation(line: 312, column: 5, scope: !384)
!723 = !DILocation(line: 312, column: 31, scope: !384)
!724 = !DILocation(line: 312, column: 55, scope: !384)
!725 = !DILocation(line: 312, column: 69, scope: !384)
!726 = !DILocation(line: 313, column: 5, scope: !384)
!727 = !DILocation(line: 313, column: 27, scope: !384)
!728 = !DILocation(line: 314, column: 5, scope: !384)
!729 = !DILocation(line: 314, column: 40, scope: !384)
!730 = !DILocation(line: 311, column: 2, scope: !384)
!731 = !DILocation(line: 318, column: 5, scope: !384)
!732 = !DILocation(line: 319, column: 5, scope: !384)
!733 = !DILocation(line: 320, column: 5, scope: !384)
!734 = !DILocation(line: 317, column: 2, scope: !384)
!735 = !DILocation(line: 323, column: 6, scope: !384)
!736 = !DILocation(line: 323, column: 45, scope: !384)
!737 = !DILocation(line: 323, column: 32, scope: !384)
!738 = !DILocation(line: 324, column: 2, scope: !384)
!739 = !DILocation(line: 324, column: 29, scope: !384)
!740 = !DILocation(line: 326, column: 9, scope: !384)
!741 = !DILocation(line: 248, column: 22, scope: !742)
!742 = distinct !DILexicalBlock(scope: !384, file: !2, line: 248, column: 8)
!743 = !DILocation(line: 248, column: 8, scope: !742)
!744 = !DILocation(line: 235, column: 25, scope: !745)
!745 = distinct !DILexicalBlock(scope: !384, file: !2, line: 235, column: 8)
!746 = distinct !DISubprogram(name: "default_test_runner", linkageName: "std.core.runtime.default_test_runner", scope: !2, file: !2, line: 329, type: !747, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !72, retainedNodes: !86)
!747 = !DISubroutineType(types: !748)
!748 = !{!22, !98}
!749 = !DILocalVariable(name: "args", arg: 1, scope: !746, file: !2, line: 329, type: !98)
!750 = !DILocation(line: 329, column: 38, scope: !746)
!751 = !DILocalVariable(name: "state", scope: !752, file: !2, line: 594, type: !203, align: 8)
!752 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !202, file: !202, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72, retainedNodes: !86)
!753 = !DILocation(line: 594, column: 12, scope: !752, inlinedAt: !754)
!754 = !DILocation(line: 329, column: 47, scope: !746)
!755 = !DILocation(line: 594, column: 20, scope: !752, inlinedAt: !754)
!756 = !DILocation(line: 331, column: 9, scope: !757)
!757 = distinct !DILexicalBlock(scope: !746, file: !2, line: 330, column: 1)
!758 = !DILocation(line: 332, column: 48, scope: !757)
!759 = !DILocation(line: 332, column: 25, scope: !757)
!760 = !DILocation(line: 332, column: 9, scope: !757)
!761 = !DILocation(line: 597, column: 23, scope: !762, inlinedAt: !754)
!762 = distinct !DILexicalBlock(scope: !752, file: !202, line: 596, column: 2)
!763 = !DILocation(line: 597, column: 3, scope: !762, inlinedAt: !754)
!764 = distinct !DISubprogram(name: "benchmark_collection_create", linkageName: "std.core.runtime.benchmark_collection_create", scope: !56, file: !56, line: 12, type: !765, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !72, retainedNodes: !86)
!765 = !DISubroutineType(types: !766)
!766 = !{!767, !49}
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkUnit[]", size: 128, align: 64, elements: !768, identifier: "BenchmarkUnit[]")
!768 = !{!769, !777}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !767, baseType: !770, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkUnit*", baseType: !771, size: 64, align: 64, dwarfAddressSpace: 0)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkUnit", scope: !56, file: !56, line: 6, size: 192, align: 64, elements: !772, identifier: "std.core.runtime.BenchmarkUnit")
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !771, file: !56, line: 8, baseType: !13, size: 128, align: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !771, file: !56, line: 9, baseType: !775, size: 64, align: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "BenchmarkFn", scope: !56, file: !56, line: 4, baseType: !776, align: 8)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkFn", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !767, baseType: !20, size: 64, align: 64, offset: 64)
!778 = !DILocalVariable(name: "allocator", arg: 1, scope: !764, file: !56, line: 12, type: !49)
!779 = !DILocation(line: 12, column: 58, scope: !764)
!780 = !DILocalVariable(name: "fns", scope: !764, file: !56, line: 14, type: !781, align: 8)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkFn[]", size: 128, align: 64, elements: !782, identifier: "BenchmarkFn[]")
!782 = !{!783, !785}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !781, baseType: !784, size: 64, align: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkFn*", baseType: !775, size: 64, align: 64, dwarfAddressSpace: 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !781, baseType: !20, size: 64, align: 64, offset: 64)
!786 = !DILocation(line: 14, column: 16, scope: !764)
!787 = !DILocation(line: 14, column: 22, scope: !764)
!788 = !DILocalVariable(name: "names", scope: !764, file: !56, line: 15, type: !98, align: 8)
!789 = !DILocation(line: 15, column: 11, scope: !764)
!790 = !DILocation(line: 15, column: 19, scope: !764)
!791 = !DILocalVariable(name: "benchmarks", scope: !764, file: !56, line: 16, type: !767, align: 8)
!792 = !DILocation(line: 16, column: 18, scope: !764)
!793 = !DILocation(line: 16, column: 80, scope: !764)
!794 = !DILocation(line: 303, column: 55, scope: !795, inlinedAt: !796)
!795 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !110, file: !110, line: 301, scopeLine: 301, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!796 = !DILocation(line: 286, column: 9, scope: !797, inlinedAt: !798)
!797 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !110, file: !110, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!798 = !DILocation(line: 16, column: 31, scope: !764)
!799 = !DILocation(line: 303, column: 40, scope: !795, inlinedAt: !796)
!800 = !DILocation(line: 79, column: 6, scope: !801, inlinedAt: !802)
!801 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !110, file: !110, line: 77, scopeLine: 77, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!802 = !DILocation(line: 303, column: 18, scope: !795, inlinedAt: !796)
!803 = !DILocation(line: 79, column: 20, scope: !801, inlinedAt: !802)
!804 = !DILocation(line: 85, column: 28, scope: !801, inlinedAt: !802)
!805 = !DILocation(line: 37, column: 12, scope: !801, inlinedAt: !802)
!806 = !DILocation(line: 973, column: 9, scope: !807, inlinedAt: !808)
!807 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !123, file: !123, line: 971, scopeLine: 971, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !72)
!808 = !DILocation(line: 37, column: 26, scope: !801, inlinedAt: !802)
!809 = !DILocation(line: 973, column: 20, scope: !807, inlinedAt: !808)
!810 = !DILocation(line: 973, column: 25, scope: !807, inlinedAt: !808)
!811 = !DILocation(line: 85, column: 10, scope: !801, inlinedAt: !802)
!812 = !DILocation(line: 303, column: 67, scope: !795, inlinedAt: !796)
!813 = !DILocation(line: 303, column: 10, scope: !795, inlinedAt: !796)
!814 = !DILocation(line: 17, column: 26, scope: !815)
!815 = distinct !DILexicalBlock(scope: !764, file: !56, line: 17, column: 2)
!816 = !DILocalVariable(name: ".temp", scope: !815, file: !56, line: 17, type: !20, align: 8)
!817 = !DILocation(line: 17, column: 11, scope: !815)
!818 = !DILocalVariable(name: "i", scope: !819, file: !56, line: 17, type: !20, align: 8)
!819 = distinct !DILexicalBlock(scope: !815, file: !56, line: 18, column: 2)
!820 = !DILocation(line: 17, column: 11, scope: !819)
!821 = !DILocalVariable(name: "benchmark", scope: !819, file: !56, line: 17, type: !776, align: 8)
!822 = !DILocation(line: 17, column: 14, scope: !819)
!823 = !DILocation(line: 17, column: 26, scope: !819)
!824 = !DILocation(line: 19, column: 3, scope: !825)
!825 = distinct !DILexicalBlock(scope: !819, file: !56, line: 18, column: 2)
!826 = !DILocation(line: 19, column: 14, scope: !825)
!827 = !DILocation(line: 19, column: 21, scope: !825)
!828 = !DILocation(line: 19, column: 27, scope: !825)
!829 = !DILocation(line: 19, column: 31, scope: !825)
!830 = !DILocation(line: 19, column: 35, scope: !825)
!831 = !DILocation(line: 21, column: 9, scope: !764)
!832 = distinct !DISubprogram(name: "set_benchmark_warmup_iterations", linkageName: "std.core.runtime.set_benchmark_warmup_iterations", scope: !56, file: !56, line: 30, type: !833, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !72, retainedNodes: !86)
!833 = !DISubroutineType(types: !834)
