; ModuleID = 'std::compression::qoi'
source_filename = "std::compression::qoi"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Header = type <{ i32, i32, i32, i8, i8 }>
%OpRGBA = type { i8, i8, i8, i8, i8 }
%OpRGB = type { i8, i8, i8, i8 }

$std.compression.qoi.write = comdat any

$std.compression.qoi.read = comdat any

$std.compression.qoi.encode = comdat any

$std.compression.qoi.decode = comdat any

$.dyn_search = comdat any

$"$ct.std.compression.qoi.QOIDesc" = comdat any

$"$ct.char" = comdat any

$"$ct.std.compression.qoi.QOIColorspace" = comdat any

$"std.compression.qoi.QOIColorspace$id" = comdat any

$"$ct.std.compression.qoi.QOIChannels" = comdat any

$"std.compression.qoi.QOIChannels$id" = comdat any

$"$ct.std.compression.qoi.Header" = comdat any

$"$ct.std.compression.qoi.Pixel" = comdat any

$"$ct.v4$char" = comdat any

$"$ct.std.compression.qoi.OpRGB" = comdat any

$"$ct.std.compression.qoi.OpRGBA" = comdat any

$"$ct.std.compression.qoi.OpIndex" = comdat any

$"$ct.std.compression.qoi.OpDiff" = comdat any

$"$ct.std.compression.qoi.OpLuma" = comdat any

$"$ct.ushort" = comdat any

$"$ct.std.compression.qoi.OpRun" = comdat any

$std.compression.qoi.PIXELS_MAX = comdat any

$std.compression.qoi.FILE_OPEN_FAILED = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PIXELS_MAX", linkageName: "std.compression.qoi.PIXELS_MAX", scope: !2, file: !2, line: 3, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "qoi.c3", directory: "/usr/lib/c3c/lib/std/compression")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "OP_RGB", linkageName: "std.compression.qoi.OP_RGB", scope: !2, file: !2, line: 384, type: !6, isLocal: true, isDefinition: true, align: 1)
!6 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "OP_RGBA", linkageName: "std.compression.qoi.OP_RGBA", scope: !2, file: !2, line: 385, type: !6, isLocal: true, isDefinition: true, align: 1)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "OP_INDEX", linkageName: "std.compression.qoi.OP_INDEX", scope: !2, file: !2, line: 387, type: !6, isLocal: true, isDefinition: true, align: 1)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "OP_DIFF", linkageName: "std.compression.qoi.OP_DIFF", scope: !2, file: !2, line: 388, type: !6, isLocal: true, isDefinition: true, align: 1)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "OP_LUMA", linkageName: "std.compression.qoi.OP_LUMA", scope: !2, file: !2, line: 389, type: !6, isLocal: true, isDefinition: true, align: 1)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "OP_RUN", linkageName: "std.compression.qoi.OP_RUN", scope: !2, file: !2, line: 390, type: !6, isLocal: true, isDefinition: true, align: 1)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "END_OF_STREAM", linkageName: "std.compression.qoi.END_OF_STREAM", scope: !2, file: !2, line: 403, type: !19, isLocal: true, isDefinition: true, align: 1)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, align: 8, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 8, lowerBound: 0)
!22 = !{i32 2, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 2, !"wchar_size", i32 4}
!25 = !{i32 4, !"PIE Level", i32 2}
!26 = !{i32 4, !"PIC Level", i32 2}
!27 = !{i32 1, !"uwtable", i32 2}
!28 = !{i32 2, !"frame-pointer", i32 2}
!29 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !30, globals: !46, splitDebugInlining: false)
!30 = !{!31, !38}
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "QOIChannels", scope: !32, file: !2, line: 22, baseType: !6, size: 8, align: 8, elements: !42)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "QOIDesc", scope: !2, file: !2, line: 33, size: 96, align: 32, elements: !33, identifier: "std.compression.qoi.QOIDesc")
!33 = !{!34, !35, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !32, file: !2, line: 35, baseType: !3, size: 32, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !32, file: !2, line: 36, baseType: !3, size: 32, align: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !32, file: !2, line: 37, baseType: !31, size: 8, align: 8, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !32, file: !2, line: 38, baseType: !38, size: 8, align: 8, offset: 72)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "QOIColorspace", scope: !32, file: !2, line: 10, baseType: !6, size: 8, align: 8, elements: !39)
!39 = !{!40, !41}
!40 = !DIEnumerator(name: "SRGB", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "LINEAR", value: 1, isUnsigned: true)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "AUTO", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "RGB", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "RGBA", value: 2, isUnsigned: true)
!46 = !{!0, !4, !7, !9, !11, !13, !15, !17}
!47 = distinct !DISubprogram(name: "write", linkageName: "std.compression.qoi.write", scope: !2, file: !2, line: 66, type: !48, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !29, retainedNodes: !62)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !52, !55, !56, !61}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !51)
!51 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !54)
!54 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !57, identifier: "char[]")
!57 = !{!58, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !56, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !56, baseType: !53, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "QOIDesc*", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!62 = !{}
!63 = !DILocalVariable(name: "filename", arg: 1, scope: !47, file: !2, line: 66, type: !55)
!64 = !DILocation(line: 66, column: 22, scope: !47)
!65 = !DILocalVariable(name: "input", arg: 2, scope: !47, file: !2, line: 66, type: !56)
!66 = !DILocation(line: 66, column: 39, scope: !47)
!67 = !DILocalVariable(name: "desc", arg: 3, scope: !47, file: !2, line: 66, type: !61)
!68 = !DILocation(line: 66, column: 55, scope: !47)
!69 = !DILocalVariable(name: "state", scope: !70, file: !2, line: 594, type: !72, align: 8)
!70 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !71, file: !71, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29, retainedNodes: !62)
!71 = !DIFile(filename: "mem.c3", directory: "/usr/lib/c3c/lib/std/core")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 402, baseType: !73, align: 8)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !74, size: 64, align: 64, dwarfAddressSpace: 0)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 32, size: 512, align: 64, elements: !75, identifier: "std.core.mem.allocator.TempAllocator")
!75 = !{!76, !83, !95, !96, !98, !99, !100, !101}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !74, file: !2, line: 34, baseType: !77, size: 128, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !78, identifier: "Allocator")
!78 = !{!79, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !77, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !77, baseType: !82, size: 64, align: 64, offset: 64)
!82 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !74, file: !2, line: 35, baseType: !84, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !85, size: 64, align: 64, dwarfAddressSpace: 0)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 52, size: 256, align: 64, elements: !86, identifier: "std.core.mem.allocator.TempAllocatorPage")
!86 = !{!87, !88, !89, !90, !91}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !85, file: !2, line: 54, baseType: !84, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !85, file: !2, line: 55, baseType: !80, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !85, file: !2, line: 56, baseType: !53, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !85, file: !2, line: 57, baseType: !53, size: 64, align: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !2, line: 58, baseType: !92, align: 8, offset: 256)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 0, lowerBound: 0)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !74, file: !2, line: 36, baseType: !73, size: 64, align: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !74, file: !2, line: 37, baseType: !97, size: 8, align: 8, offset: 256)
!97 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !74, file: !2, line: 38, baseType: !53, size: 64, align: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !74, file: !2, line: 39, baseType: !53, size: 64, align: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !74, file: !2, line: 40, baseType: !53, size: 64, align: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !2, line: 41, baseType: !92, align: 8, offset: 512)
!102 = !DILocation(line: 594, column: 12, scope: !70, inlinedAt: !103)
!103 = !DILocation(line: 66, column: 64, scope: !47)
!104 = !DILocation(line: 594, column: 20, scope: !70, inlinedAt: !103)
!105 = !DILocalVariable(name: "output", scope: !106, file: !2, line: 69, type: !56, align: 8)
!106 = distinct !DILexicalBlock(scope: !47, file: !2, line: 67, column: 1)
!107 = !DILocation(line: 69, column: 9, scope: !106)
!108 = !DILocation(line: 69, column: 18, scope: !106)
!109 = !DILocation(line: 597, column: 23, scope: !110, inlinedAt: !103)
!110 = distinct !DILexicalBlock(scope: !70, file: !71, line: 596, column: 2)
!111 = !DILocation(line: 597, column: 3, scope: !110, inlinedAt: !103)
!112 = !DILocation(line: 71, column: 23, scope: !106)
!113 = !DILocation(line: 71, column: 2, scope: !106)
!114 = !DILocation(line: 597, column: 23, scope: !115, inlinedAt: !103)
!115 = distinct !DILexicalBlock(scope: !70, file: !71, line: 596, column: 2)
!116 = !DILocation(line: 597, column: 3, scope: !115, inlinedAt: !103)
!117 = !DILocation(line: 72, column: 9, scope: !106)
!118 = !DILocation(line: 597, column: 23, scope: !119, inlinedAt: !103)
!119 = distinct !DILexicalBlock(scope: !70, file: !71, line: 596, column: 2)
!120 = !DILocation(line: 597, column: 3, scope: !119, inlinedAt: !103)
!121 = distinct !DISubprogram(name: "read", linkageName: "std.compression.qoi.read", scope: !2, file: !2, line: 98, type: !122, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !29, retainedNodes: !62)
!122 = !DISubroutineType(types: !123)
!123 = !{!50, !124, !77, !55, !61, !31}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char[]*", baseType: !56, size: 64, align: 64, dwarfAddressSpace: 0)
!125 = !DILocalVariable(name: "allocator", arg: 1, scope: !121, file: !2, line: 98, type: !77)
!126 = !DILocation(line: 98, column: 27, scope: !121)
!127 = !DILocalVariable(name: "filename", arg: 2, scope: !121, file: !2, line: 98, type: !55)
!128 = !DILocation(line: 98, column: 45, scope: !121)
!129 = !DILocalVariable(name: "desc", arg: 3, scope: !121, file: !2, line: 98, type: !61)
!130 = !DILocation(line: 98, column: 64, scope: !121)
!131 = !DILocalVariable(name: "channels", arg: 4, scope: !121, file: !2, line: 98, type: !31)
!132 = !DILocation(line: 98, column: 82, scope: !121)
!133 = !DILocalVariable(name: "state", scope: !134, file: !2, line: 594, type: !72, align: 8)
!134 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !71, file: !71, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29, retainedNodes: !62)
!135 = !DILocation(line: 594, column: 12, scope: !134, inlinedAt: !136)
!136 = !DILocation(line: 98, column: 102, scope: !121)
!137 = !DILocation(line: 594, column: 20, scope: !134, inlinedAt: !136)
!138 = !DILocalVariable(name: "data", scope: !139, file: !2, line: 101, type: !56, align: 8)
!139 = distinct !DILexicalBlock(scope: !121, file: !2, line: 99, column: 1)
!140 = !DILocation(line: 101, column: 9, scope: !139)
!141 = !DILocation(line: 101, column: 16, scope: !139)
!142 = !DILocation(line: 101, column: 45, scope: !139)
!143 = !DILocation(line: 597, column: 23, scope: !144, inlinedAt: !136)
!144 = distinct !DILexicalBlock(scope: !134, file: !71, line: 596, column: 2)
!145 = !DILocation(line: 597, column: 3, scope: !144, inlinedAt: !136)
!146 = !DILocation(line: 103, column: 9, scope: !139)
!147 = !DILocation(line: 597, column: 23, scope: !148, inlinedAt: !136)
!148 = distinct !DILexicalBlock(scope: !134, file: !71, line: 596, column: 2)
!149 = !DILocation(line: 597, column: 3, scope: !148, inlinedAt: !136)
!150 = !DILocation(line: 597, column: 23, scope: !151, inlinedAt: !136)
!151 = distinct !DILexicalBlock(scope: !134, file: !71, line: 596, column: 2)
!152 = !DILocation(line: 597, column: 3, scope: !151, inlinedAt: !136)
!153 = distinct !DISubprogram(name: "encode", linkageName: "std.compression.qoi.encode", scope: !2, file: !2, line: 126, type: !154, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !29, retainedNodes: !62)
!154 = !DISubroutineType(types: !155)
!155 = !{!50, !124, !77, !56, !61}
!156 = !DILocalVariable(name: "allocator", arg: 1, scope: !153, file: !2, line: 126, type: !77)
!157 = !DILocation(line: 126, column: 29, scope: !153)
!158 = !DILocalVariable(name: "input", arg: 2, scope: !153, file: !2, line: 126, type: !56)
!159 = !DILocation(line: 126, column: 47, scope: !153)
!160 = !DILocalVariable(name: "desc", arg: 3, scope: !153, file: !2, line: 126, type: !61)
!161 = !DILocation(line: 126, column: 63, scope: !153)
!162 = !DILocation(line: 129, column: 6, scope: !153)
!163 = !DILocation(line: 129, column: 25, scope: !153)
!164 = !DILocation(line: 129, column: 50, scope: !153)
!165 = !DILocation(line: 130, column: 6, scope: !153)
!166 = !DILocation(line: 130, column: 36, scope: !153)
!167 = !DILocalVariable(name: "pixels", scope: !153, file: !2, line: 131, type: !3, align: 4)
!168 = !DILocation(line: 131, column: 7, scope: !153)
!169 = !DILocation(line: 131, column: 16, scope: !153)
!170 = !DILocation(line: 131, column: 29, scope: !153)
!171 = !DILocation(line: 132, column: 6, scope: !153)
!172 = !DILocation(line: 132, column: 34, scope: !153)
!173 = !DILocalVariable(name: "image_size", scope: !153, file: !2, line: 135, type: !3, align: 4)
!174 = !DILocation(line: 135, column: 7, scope: !153)
!175 = !DILocation(line: 135, column: 20, scope: !153)
!176 = !DILocation(line: 135, column: 29, scope: !153)
!177 = !DILocation(line: 136, column: 6, scope: !153)
!178 = !DILocation(line: 136, column: 20, scope: !153)
!179 = !DILocation(line: 136, column: 38, scope: !153)
!180 = !DILocalVariable(name: "max_size", scope: !153, file: !2, line: 140, type: !3, align: 4)
!181 = !DILocation(line: 140, column: 7, scope: !153)
!182 = !DILocation(line: 140, column: 34, scope: !153)
!183 = !DILocation(line: 140, column: 18, scope: !153)
!184 = !DILocation(line: 140, column: 43, scope: !153)
!185 = !DILocalVariable(name: "output", scope: !153, file: !2, line: 141, type: !56, align: 8)
!186 = !DILocation(line: 141, column: 9, scope: !153)
!187 = !DILocation(line: 141, column: 58, scope: !153)
!188 = !DILocation(line: 303, column: 55, scope: !189, inlinedAt: !191)
!189 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !190, file: !190, line: 301, scopeLine: 301, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!190 = !DIFile(filename: "mem_allocator.c3", directory: "/usr/lib/c3c/lib/std/core")
!191 = !DILocation(line: 286, column: 9, scope: !192, inlinedAt: !193)
!192 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !190, file: !190, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!193 = !DILocation(line: 141, column: 18, scope: !153)
!194 = !DILocation(line: 303, column: 40, scope: !189, inlinedAt: !191)
!195 = !DILocation(line: 79, column: 6, scope: !196, inlinedAt: !197)
!196 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !190, file: !190, line: 77, scopeLine: 77, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!197 = !DILocation(line: 303, column: 18, scope: !189, inlinedAt: !191)
!198 = !DILocation(line: 79, column: 20, scope: !196, inlinedAt: !197)
!199 = !DILocation(line: 85, column: 28, scope: !196, inlinedAt: !197)
!200 = !DILocation(line: 37, column: 12, scope: !196, inlinedAt: !197)
!201 = !DILocation(line: 973, column: 9, scope: !202, inlinedAt: !204)
!202 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !203, file: !203, line: 971, scopeLine: 971, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!203 = !DIFile(filename: "math.c3", directory: "/usr/lib/c3c/lib/std/math")
!204 = !DILocation(line: 37, column: 26, scope: !196, inlinedAt: !197)
!205 = !DILocation(line: 973, column: 20, scope: !202, inlinedAt: !204)
!206 = !DILocation(line: 973, column: 25, scope: !202, inlinedAt: !204)
!207 = !DILocation(line: 85, column: 10, scope: !196, inlinedAt: !197)
!208 = !DILocation(line: 303, column: 67, scope: !189, inlinedAt: !191)
!209 = !DILocation(line: 303, column: 10, scope: !189, inlinedAt: !191)
!210 = !DILocation(line: 145, column: 12, scope: !153)
!211 = !DILocation(line: 11, column: 36, scope: !212, inlinedAt: !214)
!212 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !213, file: !213, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!213 = !DIFile(filename: "bits.c3", directory: "/usr/lib/c3c/lib/std")
!214 = !DILocation(line: 146, column: 15, scope: !153)
!215 = !DILocation(line: 147, column: 21, scope: !153)
!216 = !DILocation(line: 11, column: 36, scope: !217, inlinedAt: !218)
!217 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !213, file: !213, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!218 = !DILocation(line: 147, column: 15, scope: !153)
!219 = !DILocation(line: 148, column: 22, scope: !153)
!220 = !DILocation(line: 11, column: 36, scope: !221, inlinedAt: !222)
!221 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !213, file: !213, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!222 = !DILocation(line: 148, column: 16, scope: !153)
!223 = !DILocation(line: 149, column: 15, scope: !153)
!224 = !DILocation(line: 150, column: 17, scope: !153)
!225 = !DILocalVariable(name: "pos", scope: !153, file: !2, line: 153, type: !3, align: 4)
!226 = !DILocation(line: 153, column: 7, scope: !153)
!227 = !DILocation(line: 153, column: 13, scope: !153)
!228 = !DILocalVariable(name: "loc", scope: !153, file: !2, line: 154, type: !3, align: 4)
!229 = !DILocation(line: 154, column: 7, scope: !153)
!230 = !DILocalVariable(name: "loc_end", scope: !153, file: !2, line: 155, type: !3, align: 4)
!231 = !DILocation(line: 155, column: 7, scope: !153)
!232 = !DILocation(line: 155, column: 17, scope: !153)
!233 = !DILocation(line: 155, column: 30, scope: !153)
!234 = !DILocalVariable(name: "run_length", scope: !153, file: !2, line: 156, type: !6, align: 1)
!235 = !DILocation(line: 156, column: 7, scope: !153)
!236 = !DILocation(line: 156, column: 20, scope: !153)
!237 = !DILocalVariable(name: "palette", scope: !153, file: !2, line: 158, type: !238, align: 16)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 2048, align: 32, elements: !243)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixel", scope: !2, file: !2, line: 419, baseType: !240, align: 4)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32, align: 8, flags: DIFlagVector, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 4, lowerBound: 0)
!243 = !{!244}
!244 = !DISubrange(count: 64, lowerBound: 0)
!245 = !DILocation(line: 158, column: 12, scope: !153)
!246 = !DILocalVariable(name: "prev", scope: !153, file: !2, line: 159, type: !239, align: 4)
!247 = !DILocation(line: 159, column: 8, scope: !153)
!248 = !DILocation(line: 159, column: 15, scope: !153)
!249 = !DILocalVariable(name: "p", scope: !153, file: !2, line: 160, type: !239, align: 4)
!250 = !DILocation(line: 160, column: 8, scope: !153)
!251 = !DILocation(line: 160, column: 12, scope: !153)
!252 = !DILocalVariable(name: "diff", scope: !153, file: !2, line: 162, type: !253, align: 4)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 32, align: 8, flags: DIFlagVector, elements: !255)
!254 = !DIBasicType(name: "ichar", size: 8, encoding: DW_ATE_signed_char)
!255 = !{!256}
!256 = !DISubrange(count: 3, lowerBound: 0)
!257 = !DILocation(line: 162, column: 13, scope: !153)
!258 = !DILocalVariable(name: "luma", scope: !153, file: !2, line: 163, type: !253, align: 4)
!259 = !DILocation(line: 163, column: 13, scope: !153)
!260 = !DILocation(line: 166, column: 13, scope: !261)
!261 = distinct !DILexicalBlock(scope: !153, file: !2, line: 166, column: 2)
!262 = !DILocation(line: 166, column: 16, scope: !261)
!263 = !DILocation(line: 166, column: 22, scope: !261)
!264 = !DILocation(line: 169, column: 10, scope: !265)
!265 = distinct !DILexicalBlock(scope: !261, file: !2, line: 167, column: 2)
!266 = !DILocation(line: 172, column: 11, scope: !265)
!267 = !DILocation(line: 172, column: 17, scope: !265)
!268 = !DILocation(line: 172, column: 3, scope: !265)
!269 = !DILocation(line: 173, column: 7, scope: !265)
!270 = !DILocation(line: 173, column: 30, scope: !265)
!271 = !DILocation(line: 173, column: 36, scope: !265)
!272 = !DILocation(line: 173, column: 42, scope: !265)
!273 = !DILocation(line: 176, column: 7, scope: !265)
!274 = !DILocation(line: 176, column: 15, scope: !265)
!275 = !DILocation(line: 178, column: 4, scope: !276)
!276 = distinct !DILexicalBlock(scope: !265, file: !2, line: 177, column: 3)
!277 = !DILocation(line: 179, column: 8, scope: !276)
!278 = !DILocation(line: 179, column: 28, scope: !276)
!279 = !DILocation(line: 179, column: 35, scope: !276)
!280 = !DILocalVariable(name: "chunk", scope: !281, file: !2, line: 470, type: !282, align: 8)
!281 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 467, scopeLine: 467, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29, retainedNodes: !62)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRun*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!283 = !DILocation(line: 470, column: 9, scope: !281, inlinedAt: !284)
!284 = !DILocation(line: 181, column: 6, scope: !285)
!285 = distinct !DILexicalBlock(scope: !276, file: !2, line: 180, column: 4)
!286 = !DILocation(line: 470, column: 25, scope: !281, inlinedAt: !284)
!287 = !DILocation(line: 470, column: 31, scope: !281, inlinedAt: !284)
!288 = !DILocation(line: 471, column: 3, scope: !281, inlinedAt: !284)
!289 = !DILocation(line: 471, column: 2, scope: !281, inlinedAt: !284)
!290 = !DILocation(line: 472, column: 9, scope: !281, inlinedAt: !284)
!291 = !DILocation(line: 181, column: 48, scope: !285)
!292 = !DILocation(line: 182, column: 18, scope: !285)
!293 = !DILocation(line: 184, column: 4, scope: !276)
!294 = !DILocation(line: 187, column: 7, scope: !265)
!295 = !DILocalVariable(name: "chunk", scope: !296, file: !2, line: 470, type: !282, align: 8)
!296 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 467, scopeLine: 467, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29, retainedNodes: !62)
!297 = !DILocation(line: 470, column: 9, scope: !296, inlinedAt: !298)
!298 = !DILocation(line: 189, column: 5, scope: !299)
!299 = distinct !DILexicalBlock(scope: !265, file: !2, line: 188, column: 3)
!300 = !DILocation(line: 470, column: 25, scope: !296, inlinedAt: !298)
!301 = !DILocation(line: 470, column: 31, scope: !296, inlinedAt: !298)
!302 = !DILocation(line: 471, column: 3, scope: !296, inlinedAt: !298)
!303 = !DILocation(line: 471, column: 2, scope: !296, inlinedAt: !298)
!304 = !DILocation(line: 472, column: 9, scope: !296, inlinedAt: !298)
!305 = !DILocation(line: 189, column: 47, scope: !299)
!306 = !DILocation(line: 190, column: 17, scope: !299)
!307 = !DILocation(line: 422, column: 10, scope: !308, inlinedAt: !309)
!308 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 420, scopeLine: 420, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!309 = !DILocation(line: 196, column: 18, scope: !310)
!310 = distinct !DILexicalBlock(scope: !265, file: !2, line: 193, column: 3)
!311 = !DILocation(line: 422, column: 20, scope: !308, inlinedAt: !309)
!312 = !DILocation(line: 422, column: 30, scope: !308, inlinedAt: !309)
!313 = !DILocation(line: 422, column: 40, scope: !308, inlinedAt: !309)
!314 = !DILocation(line: 196, column: 31, scope: !310)
!315 = !DILocation(line: 196, column: 10, scope: !310)
!316 = !DILocalVariable(name: "chunk", scope: !317, file: !2, line: 470, type: !318, align: 8)
!317 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 467, scopeLine: 467, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29, retainedNodes: !62)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpIndex*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!319 = !DILocation(line: 470, column: 9, scope: !317, inlinedAt: !320)
!320 = !DILocation(line: 197, column: 6, scope: !321)
!321 = distinct !DILexicalBlock(scope: !310, file: !2, line: 197, column: 5)
!322 = !DILocation(line: 470, column: 25, scope: !317, inlinedAt: !320)
!323 = !DILocation(line: 470, column: 31, scope: !317, inlinedAt: !320)
!324 = !DILocation(line: 471, column: 3, scope: !317, inlinedAt: !320)
!325 = !DILocation(line: 471, column: 2, scope: !317, inlinedAt: !320)
!326 = !DILocation(line: 472, column: 9, scope: !317, inlinedAt: !320)
!327 = !DILocation(line: 422, column: 10, scope: !328, inlinedAt: !329)
!328 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 420, scopeLine: 420, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!329 = !DILocation(line: 199, column: 6, scope: !321)
!330 = !DILocation(line: 422, column: 20, scope: !328, inlinedAt: !329)
!331 = !DILocation(line: 422, column: 30, scope: !328, inlinedAt: !329)
!332 = !DILocation(line: 422, column: 40, scope: !328, inlinedAt: !329)
!333 = !DILocation(line: 203, column: 10, scope: !310)
!334 = !DILocation(line: 203, column: 18, scope: !310)
!335 = !DILocation(line: 203, column: 23, scope: !310)
!336 = !DILocation(line: 203, column: 33, scope: !310)
!337 = !DILocation(line: 205, column: 12, scope: !338)
!338 = distinct !DILexicalBlock(scope: !310, file: !2, line: 205, column: 5)
!339 = !DILocation(line: 205, column: 20, scope: !338)
!340 = !DILocation(line: 206, column: 9, scope: !338)
!341 = !DILocation(line: 206, column: 24, scope: !338)
!342 = !DILocation(line: 207, column: 9, scope: !338)
!343 = !DILocation(line: 207, column: 24, scope: !338)
!344 = !DILocation(line: 208, column: 9, scope: !338)
!345 = !DILocation(line: 208, column: 24, scope: !338)
!346 = !DILocalVariable(name: "chunk", scope: !347, file: !2, line: 470, type: !348, align: 8)
!347 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 467, scopeLine: 467, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29, retainedNodes: !62)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpDiff*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!349 = !DILocation(line: 470, column: 9, scope: !347, inlinedAt: !350)
!350 = !DILocation(line: 210, column: 7, scope: !351)
!351 = distinct !DILexicalBlock(scope: !338, file: !2, line: 209, column: 5)
!352 = !DILocation(line: 470, column: 25, scope: !347, inlinedAt: !350)
!353 = !DILocation(line: 470, column: 31, scope: !347, inlinedAt: !350)
!354 = !DILocation(line: 471, column: 3, scope: !347, inlinedAt: !350)
!355 = !DILocation(line: 471, column: 2, scope: !347, inlinedAt: !350)
!356 = !DILocation(line: 472, column: 9, scope: !347, inlinedAt: !350)
!357 = !DILocation(line: 212, column: 13, scope: !351)
!358 = !DILocation(line: 212, column: 7, scope: !351)
!359 = !DILocation(line: 213, column: 13, scope: !351)
!360 = !DILocation(line: 213, column: 7, scope: !351)
!361 = !DILocation(line: 214, column: 13, scope: !351)
!362 = !DILocation(line: 214, column: 7, scope: !351)
!363 = !DILocation(line: 422, column: 10, scope: !364, inlinedAt: !365)
!364 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 420, scopeLine: 420, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!365 = !DILocation(line: 216, column: 14, scope: !351)
!366 = !DILocation(line: 422, column: 20, scope: !364, inlinedAt: !365)
!367 = !DILocation(line: 422, column: 30, scope: !364, inlinedAt: !365)
!368 = !DILocation(line: 422, column: 40, scope: !364, inlinedAt: !365)
!369 = !DILocation(line: 216, column: 26, scope: !351)
!370 = !DILocation(line: 217, column: 6, scope: !351)
!371 = !DILocation(line: 220, column: 14, scope: !338)
!372 = !DILocation(line: 220, column: 23, scope: !338)
!373 = !DILocation(line: 220, column: 31, scope: !338)
!374 = !DILocation(line: 220, column: 39, scope: !338)
!375 = !DILocation(line: 220, column: 48, scope: !338)
!376 = !DILocation(line: 221, column: 9, scope: !338)
!377 = !DILocation(line: 221, column: 25, scope: !338)
!378 = !DILocation(line: 222, column: 9, scope: !338)
!379 = !DILocation(line: 222, column: 26, scope: !338)
!380 = !DILocation(line: 223, column: 9, scope: !338)
!381 = !DILocation(line: 223, column: 25, scope: !338)
!382 = !DILocalVariable(name: "chunk", scope: !383, file: !2, line: 470, type: !384, align: 8)
!383 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 467, scopeLine: 467, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29, retainedNodes: !62)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpLuma*", baseType: !385, size: 64, align: 64, dwarfAddressSpace: 0)
!385 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!386 = !DILocation(line: 470, column: 9, scope: !383, inlinedAt: !387)
!387 = !DILocation(line: 225, column: 7, scope: !388)
!388 = distinct !DILexicalBlock(scope: !338, file: !2, line: 224, column: 5)
!389 = !DILocation(line: 470, column: 25, scope: !383, inlinedAt: !387)
!390 = !DILocation(line: 470, column: 31, scope: !383, inlinedAt: !387)
!391 = !DILocation(line: 471, column: 3, scope: !383, inlinedAt: !387)
!392 = !DILocation(line: 471, column: 2, scope: !383, inlinedAt: !387)
!393 = !DILocation(line: 472, column: 9, scope: !383, inlinedAt: !387)
!394 = !DILocation(line: 227, column: 13, scope: !388)
!395 = !DILocation(line: 227, column: 7, scope: !388)
!396 = !DILocation(line: 228, column: 13, scope: !388)
!397 = !DILocation(line: 228, column: 7, scope: !388)
!398 = !DILocation(line: 229, column: 13, scope: !388)
!399 = !DILocation(line: 229, column: 7, scope: !388)
!400 = !DILocation(line: 422, column: 10, scope: !401, inlinedAt: !402)
!401 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 420, scopeLine: 420, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!402 = !DILocation(line: 231, column: 14, scope: !388)
!403 = !DILocation(line: 422, column: 20, scope: !401, inlinedAt: !402)
!404 = !DILocation(line: 422, column: 30, scope: !401, inlinedAt: !402)
!405 = !DILocation(line: 422, column: 40, scope: !401, inlinedAt: !402)
!406 = !DILocation(line: 231, column: 26, scope: !388)
!407 = !DILocation(line: 232, column: 6, scope: !388)
!408 = !DILocation(line: 234, column: 5, scope: !338)
!409 = !DILocation(line: 238, column: 9, scope: !410)
!410 = distinct !DILexicalBlock(scope: !310, file: !2, line: 238, column: 5)
!411 = !DILocation(line: 238, column: 19, scope: !410)
!412 = !DILocalVariable(name: "chunk", scope: !413, file: !2, line: 470, type: !414, align: 8)
!413 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 467, scopeLine: 467, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29, retainedNodes: !62)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRGBA*", baseType: !415, size: 64, align: 64, dwarfAddressSpace: 0)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpRGBA", scope: !2, file: !2, line: 432, size: 40, align: 8, elements: !416, identifier: "std.compression.qoi.OpRGBA")
!416 = !{!417, !418, !419, !420, !421}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !415, file: !2, line: 434, baseType: !6, size: 8, align: 8)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !415, file: !2, line: 435, baseType: !6, size: 8, align: 8, offset: 8)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !415, file: !2, line: 436, baseType: !6, size: 8, align: 8, offset: 16)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !415, file: !2, line: 437, baseType: !6, size: 8, align: 8, offset: 24)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !415, file: !2, line: 438, baseType: !6, size: 8, align: 8, offset: 32)
!422 = !DILocation(line: 470, column: 9, scope: !413, inlinedAt: !423)
!423 = !DILocation(line: 240, column: 7, scope: !424)
!424 = distinct !DILexicalBlock(scope: !410, file: !2, line: 239, column: 5)
!425 = !DILocation(line: 470, column: 25, scope: !413, inlinedAt: !423)
!426 = !DILocation(line: 470, column: 31, scope: !413, inlinedAt: !423)
!427 = !DILocation(line: 471, column: 3, scope: !413, inlinedAt: !423)
!428 = !DILocation(line: 471, column: 2, scope: !413, inlinedAt: !423)
!429 = !DILocation(line: 472, column: 9, scope: !413, inlinedAt: !423)
!430 = !DILocation(line: 240, column: 42, scope: !424)
!431 = !DILocation(line: 240, column: 51, scope: !424)
!432 = !DILocation(line: 240, column: 56, scope: !424)
!433 = !DILocation(line: 240, column: 61, scope: !424)
!434 = !DILocation(line: 240, column: 66, scope: !424)
!435 = !DILocalVariable(name: "chunk", scope: !436, file: !2, line: 470, type: !437, align: 8)
!436 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 467, scopeLine: 467, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29, retainedNodes: !62)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRGB*", baseType: !438, size: 64, align: 64, dwarfAddressSpace: 0)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpRGB", scope: !2, file: !2, line: 425, size: 32, align: 8, elements: !439, identifier: "std.compression.qoi.OpRGB")
!439 = !{!440, !441, !442, !443}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !438, file: !2, line: 427, baseType: !6, size: 8, align: 8)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !438, file: !2, line: 428, baseType: !6, size: 8, align: 8, offset: 8)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !438, file: !2, line: 429, baseType: !6, size: 8, align: 8, offset: 16)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !438, file: !2, line: 430, baseType: !6, size: 8, align: 8, offset: 24)
!444 = !DILocation(line: 470, column: 9, scope: !436, inlinedAt: !445)
!445 = !DILocation(line: 244, column: 7, scope: !446)
!446 = distinct !DILexicalBlock(scope: !410, file: !2, line: 243, column: 5)
!447 = !DILocation(line: 470, column: 25, scope: !436, inlinedAt: !445)
!448 = !DILocation(line: 470, column: 31, scope: !436, inlinedAt: !445)
!449 = !DILocation(line: 471, column: 3, scope: !436, inlinedAt: !445)
!450 = !DILocation(line: 471, column: 2, scope: !436, inlinedAt: !445)
!451 = !DILocation(line: 472, column: 9, scope: !436, inlinedAt: !445)
!452 = !DILocation(line: 244, column: 41, scope: !446)
!453 = !DILocation(line: 244, column: 49, scope: !446)
!454 = !DILocation(line: 244, column: 54, scope: !446)
!455 = !DILocation(line: 244, column: 59, scope: !446)
!456 = !DILocation(line: 422, column: 10, scope: !457, inlinedAt: !458)
!457 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 420, scopeLine: 420, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!458 = !DILocation(line: 246, column: 13, scope: !410)
!459 = !DILocation(line: 422, column: 20, scope: !457, inlinedAt: !458)
!460 = !DILocation(line: 422, column: 30, scope: !457, inlinedAt: !458)
!461 = !DILocation(line: 422, column: 40, scope: !457, inlinedAt: !458)
!462 = !DILocation(line: 246, column: 25, scope: !410)
!463 = !DILocation(line: 166, column: 34, scope: !261)
!464 = !DILocation(line: 166, column: 41, scope: !261)
!465 = !DILocation(line: 251, column: 2, scope: !153)
!466 = !DILocation(line: 251, column: 9, scope: !153)
!467 = !DILocation(line: 252, column: 2, scope: !153)
!468 = !DILocation(line: 254, column: 9, scope: !153)
!469 = !DILocation(line: 254, column: 16, scope: !153)
!470 = !DILocation(line: 254, column: 17, scope: !153)
!471 = !DILocation(line: 145, column: 3, scope: !153)
!472 = distinct !DISubprogram(name: "decode", linkageName: "std.compression.qoi.decode", scope: !2, file: !2, line: 281, type: !473, scopeLine: 281, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !29, retainedNodes: !62)
!473 = !DISubroutineType(types: !474)
!474 = !{!50, !124, !77, !56, !61, !31}
!475 = !DILocalVariable(name: "allocator", arg: 1, scope: !472, file: !2, line: 281, type: !77)
!476 = !DILocation(line: 281, column: 29, scope: !472)
!477 = !DILocalVariable(name: "data", arg: 2, scope: !472, file: !2, line: 281, type: !56)
!478 = !DILocation(line: 281, column: 47, scope: !472)
!479 = !DILocalVariable(name: "desc", arg: 3, scope: !472, file: !2, line: 281, type: !61)
!480 = !DILocation(line: 281, column: 62, scope: !472)
!481 = !DILocalVariable(name: "channels", arg: 4, scope: !472, file: !2, line: 281, type: !31)
!482 = !DILocation(line: 281, column: 80, scope: !472)
!483 = !DILocation(line: 284, column: 6, scope: !472)
!484 = !DILocation(line: 284, column: 59, scope: !472)
!485 = !DILocalVariable(name: "header", scope: !472, file: !2, line: 287, type: !486, align: 8)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Header*", baseType: !487, size: 64, align: 64, dwarfAddressSpace: 0)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "Header", scope: !2, file: !2, line: 392, size: 112, align: 8, elements: !488, identifier: "std.compression.qoi.Header")
!488 = !{!489, !490, !491, !492, !493}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "be_magic", scope: !487, file: !2, line: 394, baseType: !3, size: 32, align: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "be_width", scope: !487, file: !2, line: 395, baseType: !3, size: 32, align: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "be_height", scope: !487, file: !2, line: 396, baseType: !3, size: 32, align: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !487, file: !2, line: 399, baseType: !6, size: 8, align: 8, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !487, file: !2, line: 400, baseType: !6, size: 8, align: 8, offset: 104)
!494 = !DILocation(line: 287, column: 10, scope: !472)
!495 = !DILocation(line: 287, column: 28, scope: !472)
!496 = !DILocation(line: 290, column: 12, scope: !472)
!497 = !DILocation(line: 11, column: 36, scope: !498, inlinedAt: !499)
!498 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !213, file: !213, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!499 = !DILocation(line: 290, column: 6, scope: !472)
!500 = !DILocation(line: 290, column: 47, scope: !472)
!501 = !DILocation(line: 293, column: 2, scope: !472)
!502 = !DILocation(line: 293, column: 21, scope: !472)
!503 = !DILocation(line: 11, column: 36, scope: !504, inlinedAt: !505)
!504 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !213, file: !213, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!505 = !DILocation(line: 293, column: 15, scope: !472)
!506 = !DILocation(line: 294, column: 2, scope: !472)
!507 = !DILocation(line: 294, column: 22, scope: !472)
!508 = !DILocation(line: 11, column: 36, scope: !509, inlinedAt: !510)
!509 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !213, file: !213, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!510 = !DILocation(line: 294, column: 16, scope: !472)
!511 = !DILocation(line: 295, column: 2, scope: !472)
!512 = !DILocation(line: 295, column: 41, scope: !472)
!513 = !DILocalVariable(name: ".temp", scope: !514, file: !2, line: 412, type: !516, align: 1)
!514 = distinct !DILexicalBlock(scope: !515, file: !2, line: 412, column: 2)
!515 = distinct !DISubprogram(name: "@enumcast", linkageName: "@enumcast", scope: !2, file: !2, line: 410, scopeLine: 410, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29, retainedNodes: !62)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 24, align: 8, elements: !255)
!517 = !DILocation(line: 412, column: 19, scope: !514, inlinedAt: !518)
!518 = !DILocation(line: 295, column: 18, scope: !472)
!519 = !DILocalVariable(name: ".temp", scope: !514, file: !2, line: 412, type: !53, align: 8)
!520 = !DILocalVariable(name: "value", scope: !521, file: !2, line: 412, type: !31, align: 1)
!521 = distinct !DILexicalBlock(scope: !514, file: !2, line: 413, column: 2)
!522 = !DILocation(line: 412, column: 11, scope: !521, inlinedAt: !518)
!523 = !DILocation(line: 412, column: 19, scope: !521, inlinedAt: !518)
!524 = !DILocation(line: 414, column: 7, scope: !525, inlinedAt: !518)
!525 = distinct !DILexicalBlock(scope: !521, file: !2, line: 413, column: 2)
!526 = !DILocation(line: 414, column: 19, scope: !525, inlinedAt: !518)
!527 = !DILocation(line: 414, column: 31, scope: !525, inlinedAt: !518)
!528 = !DILocation(line: 416, column: 9, scope: !515, inlinedAt: !518)
!529 = !DILocation(line: 296, column: 2, scope: !472)
!530 = !DILocation(line: 296, column: 45, scope: !472)
!531 = !DILocalVariable(name: ".temp", scope: !532, file: !2, line: 412, type: !534, align: 1)
!532 = distinct !DILexicalBlock(scope: !533, file: !2, line: 412, column: 2)
!533 = distinct !DISubprogram(name: "@enumcast", linkageName: "@enumcast", scope: !2, file: !2, line: 410, scopeLine: 410, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29, retainedNodes: !62)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 16, align: 8, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 2, lowerBound: 0)
!537 = !DILocation(line: 412, column: 19, scope: !532, inlinedAt: !538)
!538 = !DILocation(line: 296, column: 20, scope: !472)
!539 = !DILocalVariable(name: ".temp", scope: !532, file: !2, line: 412, type: !53, align: 8)
!540 = !DILocalVariable(name: "value", scope: !541, file: !2, line: 412, type: !38, align: 1)
!541 = distinct !DILexicalBlock(scope: !532, file: !2, line: 413, column: 2)
