; ModuleID = 'std::net::url'
source_filename = "std::net::url"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%List = type { i64, i64, %any, ptr }
%"char[][]" = type { ptr, i64 }
%HashMap = type { %"Entry*[]", %any, i32, i32, float }
%"Entry*[]" = type { ptr, i64 }
%Url = type { %"char[]", %"char[]", i32, %"char[]", %"char[]", %"char[]", %"char[]", %"char[]", %any }
%UrlQueryValues = type { %HashMap, %List }
%Splitter = type { %"char[]", %"char[]", i64, i32, i32 }

$std.net.url.encode_len = comdat any

$std.net.url.encode = comdat any

$std.net.url.tencode = comdat any

$std.net.url.decode_len = comdat any

$std.net.url.decode = comdat any

$std.net.url.tdecode = comdat any

$std.net.url.Url.to_format = comdat any

$std.net.url.Url.to_string = comdat any

$std.net.url.UrlQueryValues.add = comdat any

$std.net.url.UrlQueryValues.to_format = comdat any

$std.net.url.UrlQueryValues.free = comdat any

$std.net.url.Url.free = comdat any

$std.net.url.tparse = comdat any

$std.net.url.parse = comdat any

$std.net.url.parse_query_to_temp = comdat any

$std.net.url.parse_query = comdat any

$"$ct.char" = comdat any

$"$ct.std.net.url.UrlEncodingMode" = comdat any


!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIE Level", i32 2}
!4 = !{i32 4, !"PIC Level", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = !{i32 2, !"frame-pointer", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !8, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, splitDebugInlining: false)
!8 = !DIFile(filename: "url_encoding.c3", directory: "/usr/lib/c3c/lib/std/net")
!9 = !{!10, !19}
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "UrlEncodingMode", scope: !8, file: !8, line: 8, baseType: !11, size: 8, align: 8, elements: !12)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!12 = !{!13, !14, !15, !16, !17, !18}
!13 = !DIEnumerator(name: "UNRESERVED", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "PATH", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "HOST", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "USERPASS", value: 3, isUnsigned: true)
!17 = !DIEnumerator(name: "QUERY", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "FRAGMENT", value: 5, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SplitterType", scope: !21, file: !20, line: 1006, baseType: !36, size: 32, align: 32, elements: !37)
!20 = !DIFile(filename: "url.c3", directory: "/usr/lib/c3c/lib/std/net")
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "Splitter", scope: !20, file: !20, line: 1016, size: 384, align: 64, elements: !22, identifier: "std.core.string.Splitter")
!22 = !{!23, !32, !33, !34, !35}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !21, file: !20, line: 1018, baseType: !24, size: 128, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !26, identifier: "char[]")
!26 = !{!27, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !25, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !25, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !31)
!31 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !21, file: !20, line: 1019, baseType: !24, size: 128, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !21, file: !20, line: 1020, baseType: !30, size: 64, align: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !21, file: !20, line: 1021, baseType: !19, size: 32, align: 32, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "last_index", scope: !21, file: !20, line: 1022, baseType: !36, size: 32, align: 32, offset: 352)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !{!38, !39, !40}
!38 = !DIEnumerator(name: "TOKENIZE", value: 0)
!39 = !DIEnumerator(name: "TOKENIZE_ALL", value: 1)
!40 = !DIEnumerator(name: "TOKENIZE_ALL_SKIP_LAST", value: 2)
!41 = distinct !DISubprogram(name: "should_encode", linkageName: "std.net.url.should_encode", scope: !8, file: !8, line: 26, type: !42, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !45)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !11, !10}
!44 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!45 = !{}
!46 = !DILocalVariable(name: "c", arg: 1, scope: !41, file: !8, line: 26, type: !11)
!47 = !DILocation(line: 26, column: 28, scope: !41)
!48 = !DILocalVariable(name: "mode", arg: 2, scope: !41, file: !8, line: 26, type: !10)
!49 = !DILocation(line: 26, column: 47, scope: !41)
!50 = !DILocation(line: 17, column: 42, scope: !51, inlinedAt: !53)
!51 = distinct !DISubprogram(name: "@is_alnum", linkageName: "@is_alnum", scope: !52, file: !52, line: 17, scopeLine: 17, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!52 = !DIFile(filename: "ascii.c3", directory: "/usr/lib/c3c/lib/std/core")
!53 = !DILocation(line: 52, column: 38, scope: !54, inlinedAt: !55)
!54 = distinct !DISubprogram(name: "is_alnum", linkageName: "is_alnum", scope: !52, file: !52, line: 52, scopeLine: 52, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!55 = !DILocation(line: 29, column: 6, scope: !41)
!56 = !DILocation(line: 29, column: 27, scope: !41)
!57 = !DILocation(line: 32, column: 10, scope: !41)
!58 = !DILocation(line: 32, column: 70, scope: !41)
!59 = !DILocation(line: 35, column: 10, scope: !41)
!60 = !DILocation(line: 35, column: 48, scope: !41)
!61 = !DILocation(line: 38, column: 9, scope: !41)
!62 = distinct !DISubprogram(name: "encode_len", linkageName: "std.net.url.encode_len", scope: !8, file: !8, line: 44, type: !63, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !45)
!63 = !DISubroutineType(types: !64)
!64 = !{!30, !24, !10}
!65 = !DILocalVariable(name: "s", arg: 1, scope: !62, file: !8, line: 44, type: !24)
!66 = !DILocation(line: 44, column: 26, scope: !62)
!67 = !DILocalVariable(name: "mode", arg: 2, scope: !62, file: !8, line: 44, type: !10)
!68 = !DILocation(line: 44, column: 45, scope: !62)
!69 = !DILocalVariable(name: "n", scope: !62, file: !8, line: 46, type: !30, align: 8)
!70 = !DILocation(line: 46, column: 6, scope: !62)
!71 = !DILocation(line: 47, column: 14, scope: !72)
!72 = distinct !DILexicalBlock(scope: !62, file: !8, line: 47, column: 2)
!73 = !DILocalVariable(name: ".temp", scope: !72, file: !8, line: 47, type: !30, align: 8)
!74 = !DILocalVariable(name: "c", scope: !75, file: !8, line: 47, type: !11, align: 1)
!75 = distinct !DILexicalBlock(scope: !72, file: !8, line: 48, column: 2)
!76 = !DILocation(line: 47, column: 11, scope: !75)
!77 = !DILocation(line: 47, column: 14, scope: !75)
!78 = !DILocation(line: 49, column: 25, scope: !79)
!79 = distinct !DILexicalBlock(scope: !75, file: !8, line: 48, column: 2)
!80 = !DILocation(line: 49, column: 8, scope: !79)
!81 = !DILocation(line: 49, column: 32, scope: !79)
!82 = !DILocation(line: 50, column: 7, scope: !79)
!83 = !DILocation(line: 50, column: 19, scope: !79)
!84 = !DILocation(line: 52, column: 4, scope: !85)
!85 = distinct !DILexicalBlock(scope: !79, file: !8, line: 51, column: 3)
!86 = !DILocation(line: 55, column: 9, scope: !62)
!87 = !DILocation(line: 55, column: 21, scope: !62)
!88 = !DILocation(line: 55, column: 17, scope: !62)
!89 = distinct !DISubprogram(name: "encode", linkageName: "std.net.url.encode", scope: !8, file: !8, line: 67, type: !90, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !45)
!90 = !DISubroutineType(types: !91)
!91 = !{!24, !92, !24, !10}
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !93, identifier: "Allocator")
!93 = !{!94, !96}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !92, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, baseType: !97, size: 64, align: 64, offset: 64)
!97 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!98 = !DILocalVariable(name: "allocator", arg: 1, scope: !89, file: !8, line: 67, type: !92)
!99 = !DILocation(line: 67, column: 28, scope: !89)
!100 = !DILocalVariable(name: "s", arg: 2, scope: !89, file: !8, line: 67, type: !24)
!101 = !DILocation(line: 67, column: 46, scope: !89)
!102 = !DILocalVariable(name: "mode", arg: 3, scope: !89, file: !8, line: 67, type: !10)
!103 = !DILocation(line: 67, column: 65, scope: !89)
!104 = !DILocalVariable(name: "state", scope: !105, file: !8, line: 594, type: !107, align: 8)
!105 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !106, file: !106, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !45)
!106 = !DIFile(filename: "mem.c3", directory: "/usr/lib/c3c/lib/std/core")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !8, file: !8, line: 402, baseType: !108, align: 8)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !109, size: 64, align: 64, dwarfAddressSpace: 0)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !8, file: !8, line: 32, size: 512, align: 64, elements: !110, identifier: "std.core.mem.allocator.TempAllocator")
!110 = !{!111, !112, !124, !125, !126, !127, !128, !129}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !109, file: !8, line: 34, baseType: !92, size: 128, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !109, file: !8, line: 35, baseType: !113, size: 64, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !114, size: 64, align: 64, dwarfAddressSpace: 0)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !8, file: !8, line: 52, size: 256, align: 64, elements: !115, identifier: "std.core.mem.allocator.TempAllocatorPage")
!115 = !{!116, !117, !118, !119, !120}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !114, file: !8, line: 54, baseType: !113, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !114, file: !8, line: 55, baseType: !95, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !114, file: !8, line: 56, baseType: !30, size: 64, align: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !114, file: !8, line: 57, baseType: !30, size: 64, align: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !114, file: !8, line: 58, baseType: !121, align: 8, offset: 256)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, align: 8, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 0, lowerBound: 0)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !109, file: !8, line: 36, baseType: !108, size: 64, align: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !109, file: !8, line: 37, baseType: !44, size: 8, align: 8, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !109, file: !8, line: 38, baseType: !30, size: 64, align: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !109, file: !8, line: 39, baseType: !30, size: 64, align: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !109, file: !8, line: 40, baseType: !30, size: 64, align: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !8, line: 41, baseType: !121, align: 8, offset: 512)
!130 = !DILocation(line: 594, column: 12, scope: !105, inlinedAt: !131)
!131 = !DILocation(line: 67, column: 74, scope: !89)
!132 = !DILocation(line: 594, column: 20, scope: !105, inlinedAt: !131)
!133 = !DILocalVariable(name: "n", scope: !134, file: !8, line: 69, type: !30, align: 8)
!134 = distinct !DILexicalBlock(scope: !89, file: !8, line: 68, column: 1)
!135 = !DILocation(line: 69, column: 6, scope: !134)
!136 = !DILocation(line: 69, column: 24, scope: !134)
!137 = !DILocation(line: 69, column: 10, scope: !134)
!138 = !DILocalVariable(name: "builder", scope: !134, file: !8, line: 70, type: !139, align: 8)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !8, file: !8, line: 7, baseType: !140, align: 8)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !141, size: 64, align: 64, dwarfAddressSpace: 0)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !8, file: !8, line: 8, baseType: null, align: 1)
!142 = !DILocation(line: 70, column: 10, scope: !134)
!143 = !DILocation(line: 70, column: 48, scope: !134)
!144 = !DILocation(line: 70, column: 20, scope: !134)
!145 = !DILocation(line: 72, column: 16, scope: !146)
!146 = distinct !DILexicalBlock(scope: !134, file: !8, line: 72, column: 2)
!147 = !DILocalVariable(name: ".temp", scope: !146, file: !8, line: 72, type: !30, align: 8)
!148 = !DILocation(line: 72, column: 10, scope: !146)
!149 = !DILocalVariable(name: "i", scope: !150, file: !8, line: 72, type: !30, align: 8)
!150 = distinct !DILexicalBlock(scope: !146, file: !8, line: 73, column: 2)
!151 = !DILocation(line: 72, column: 10, scope: !150)
!152 = !DILocalVariable(name: "c", scope: !150, file: !8, line: 72, type: !11, align: 1)
!153 = !DILocation(line: 72, column: 13, scope: !150)
!154 = !DILocation(line: 72, column: 16, scope: !150)
!155 = !DILocation(line: 77, column: 9, scope: !156)
!156 = distinct !DILexicalBlock(scope: !157, file: !8, line: 74, column: 3)
!157 = distinct !DILexicalBlock(scope: !150, file: !8, line: 73, column: 2)
!158 = !DILocation(line: 77, column: 21, scope: !156)
!159 = !DILocation(line: 78, column: 5, scope: !160)
!160 = distinct !DILexicalBlock(scope: !156, file: !8, line: 78, column: 5)
!161 = !DILocation(line: 81, column: 26, scope: !156)
!162 = !DILocation(line: 81, column: 9, scope: !156)
!163 = !DILocation(line: 82, column: 5, scope: !164)
!164 = distinct !DILexicalBlock(scope: !156, file: !8, line: 82, column: 5)
!165 = !DILocalVariable(name: "hex", scope: !164, file: !8, line: 83, type: !24, align: 8)
!166 = !DILocation(line: 83, column: 12, scope: !164)
!167 = !DILocation(line: 83, column: 31, scope: !164)
!168 = !DILocation(line: 83, column: 33, scope: !164)
!169 = !DILocation(line: 83, column: 18, scope: !164)
!170 = !DILocation(line: 84, column: 20, scope: !164)
!171 = !DILocation(line: 395, column: 27, scope: !172, inlinedAt: !175)
!172 = distinct !DILexicalBlock(scope: !174, file: !173, line: 396, column: 1)
!173 = !DIFile(filename: "dstring.c3", directory: "/usr/lib/c3c/lib/std/core")
!174 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !173, file: !173, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!175 = !DILocation(line: 84, column: 5, scope: !164)
!176 = !DILocation(line: 405, column: 22, scope: !174, inlinedAt: !175)
!177 = !DILocation(line: 405, column: 4, scope: !174, inlinedAt: !175)
!178 = !DILocation(line: 88, column: 25, scope: !179)
!179 = distinct !DILexicalBlock(scope: !156, file: !8, line: 88, column: 5)
!180 = !DILocation(line: 88, column: 5, scope: !179)
!181 = !DILocation(line: 92, column: 26, scope: !134)
!182 = !DILocation(line: 92, column: 9, scope: !134)
!183 = !DILocation(line: 597, column: 23, scope: !184, inlinedAt: !131)
!184 = distinct !DILexicalBlock(scope: !105, file: !106, line: 596, column: 2)
!185 = !DILocation(line: 597, column: 3, scope: !184, inlinedAt: !131)
!186 = distinct !DISubprogram(name: "tencode", linkageName: "std.net.url.tencode", scope: !8, file: !8, line: 103, type: !187, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !45)
!187 = !DISubroutineType(types: !188)
!188 = !{!24, !24, !10}
!189 = !DILocalVariable(name: "s", arg: 1, scope: !186, file: !8, line: 103, type: !24)
!190 = !DILocation(line: 103, column: 26, scope: !186)
!191 = !DILocalVariable(name: "mode", arg: 2, scope: !186, file: !8, line: 103, type: !10)
!192 = !DILocation(line: 103, column: 45, scope: !186)
!193 = !DILocation(line: 103, column: 70, scope: !186)
!194 = !DILocation(line: 103, column: 54, scope: !186)
!195 = distinct !DISubprogram(name: "decode_len", linkageName: "std.net.url.decode_len", scope: !8, file: !8, line: 110, type: !196, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !45)
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !200, !24, !10}
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !199)
!199 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!201 = !DILocalVariable(name: "s", arg: 1, scope: !195, file: !8, line: 110, type: !24)
!202 = !DILocation(line: 110, column: 27, scope: !195)
!203 = !DILocalVariable(name: "mode", arg: 2, scope: !195, file: !8, line: 110, type: !10)
!204 = !DILocation(line: 110, column: 46, scope: !195)
!205 = !DILocalVariable(name: "n", scope: !195, file: !8, line: 112, type: !30, align: 8)
!206 = !DILocation(line: 112, column: 6, scope: !195)
!207 = !DILocation(line: 113, column: 17, scope: !208)
!208 = distinct !DILexicalBlock(scope: !195, file: !8, line: 113, column: 2)
!209 = !DILocalVariable(name: ".temp", scope: !208, file: !8, line: 113, type: !30, align: 8)
!210 = !DILocation(line: 113, column: 11, scope: !208)
!211 = !DILocalVariable(name: "i", scope: !212, file: !8, line: 113, type: !30, align: 8)
!212 = distinct !DILexicalBlock(scope: !208, file: !8, line: 114, column: 2)
!213 = !DILocation(line: 113, column: 11, scope: !212)
!214 = !DILocalVariable(name: "c", scope: !212, file: !8, line: 113, type: !11, align: 1)
!215 = !DILocation(line: 113, column: 14, scope: !212)
!216 = !DILocation(line: 113, column: 17, scope: !212)
!217 = !DILocation(line: 115, column: 7, scope: !218)
!218 = distinct !DILexicalBlock(scope: !212, file: !8, line: 114, column: 2)
!219 = !DILocation(line: 115, column: 17, scope: !218)
!220 = !DILocation(line: 116, column: 7, scope: !218)
!221 = !DILocation(line: 116, column: 16, scope: !218)
!222 = !DILocation(line: 116, column: 26, scope: !218)
!223 = !DILocation(line: 116, column: 28, scope: !218)
!224 = !DILocation(line: 12, column: 42, scope: !225, inlinedAt: !226)
!225 = distinct !DISubprogram(name: "@is_xdigit", linkageName: "@is_xdigit", scope: !52, file: !52, line: 12, scopeLine: 12, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!226 = !DILocation(line: 47, column: 38, scope: !227, inlinedAt: !222)
!227 = distinct !DISubprogram(name: "is_xdigit", linkageName: "is_xdigit", scope: !52, file: !52, line: 47, scopeLine: 47, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!228 = !DILocation(line: 116, column: 49, scope: !218)
!229 = !DILocation(line: 116, column: 51, scope: !218)
!230 = !DILocation(line: 12, column: 42, scope: !231, inlinedAt: !232)
!231 = distinct !DISubprogram(name: "@is_xdigit", linkageName: "@is_xdigit", scope: !52, file: !52, line: 12, scopeLine: 12, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!232 = !DILocation(line: 47, column: 38, scope: !233, inlinedAt: !228)
!233 = distinct !DISubprogram(name: "is_xdigit", linkageName: "is_xdigit", scope: !52, file: !52, line: 47, scopeLine: 47, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!234 = !DILocation(line: 118, column: 11, scope: !235)
!235 = distinct !DILexicalBlock(scope: !218, file: !8, line: 117, column: 3)
!236 = !DILocation(line: 120, column: 3, scope: !218)
!237 = !DILocation(line: 122, column: 9, scope: !195)
!238 = !DILocation(line: 122, column: 21, scope: !195)
!239 = !DILocation(line: 122, column: 17, scope: !195)
!240 = distinct !DISubprogram(name: "decode", linkageName: "std.net.url.decode", scope: !8, file: !8, line: 134, type: !241, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !45)
!241 = !DISubroutineType(types: !242)
!242 = !{!198, !243, !92, !24, !10}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!244 = !DILocalVariable(name: "allocator", arg: 1, scope: !240, file: !8, line: 134, type: !92)
!245 = !DILocation(line: 134, column: 29, scope: !240)
!246 = !DILocalVariable(name: "s", arg: 2, scope: !240, file: !8, line: 134, type: !24)
!247 = !DILocation(line: 134, column: 47, scope: !240)
!248 = !DILocalVariable(name: "mode", arg: 3, scope: !240, file: !8, line: 134, type: !10)
!249 = !DILocation(line: 134, column: 67, scope: !240)
!250 = !DILocalVariable(name: "state", scope: !251, file: !8, line: 594, type: !107, align: 8)
!251 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !106, file: !106, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !45)
!252 = !DILocation(line: 594, column: 12, scope: !251, inlinedAt: !253)
!253 = !DILocation(line: 134, column: 76, scope: !240)
!254 = !DILocation(line: 594, column: 20, scope: !251, inlinedAt: !253)
!255 = !DILocalVariable(name: "n", scope: !256, file: !8, line: 136, type: !30, align: 8)
!256 = distinct !DILexicalBlock(scope: !240, file: !8, line: 135, column: 1)
!257 = !DILocation(line: 136, column: 6, scope: !256)
!258 = !DILocation(line: 136, column: 10, scope: !256)
!259 = !DILocation(line: 597, column: 23, scope: !260, inlinedAt: !253)
!260 = distinct !DILexicalBlock(scope: !251, file: !106, line: 596, column: 2)
!261 = !DILocation(line: 597, column: 3, scope: !260, inlinedAt: !253)
!262 = !DILocalVariable(name: "builder", scope: !256, file: !8, line: 137, type: !139, align: 8)
!263 = !DILocation(line: 137, column: 10, scope: !256)
!264 = !DILocation(line: 137, column: 48, scope: !256)
!265 = !DILocation(line: 137, column: 20, scope: !256)
!266 = !DILocalVariable(name: "i", scope: !267, file: !8, line: 139, type: !30, align: 8)
!267 = distinct !DILexicalBlock(scope: !256, file: !8, line: 139, column: 2)
!268 = !DILocation(line: 139, column: 11, scope: !267)
!269 = !DILocation(line: 139, column: 15, scope: !267)
!270 = !DILocation(line: 139, column: 18, scope: !267)
!271 = !DILocation(line: 139, column: 22, scope: !267)
!272 = !DILocation(line: 141, column: 11, scope: !273)
!273 = distinct !DILexicalBlock(scope: !274, file: !8, line: 141, column: 3)
!274 = distinct !DILexicalBlock(scope: !267, file: !8, line: 140, column: 2)
!275 = !DILocation(line: 141, column: 13, scope: !273)
!276 = !DILocalVariable(name: "hex", scope: !277, file: !8, line: 145, type: !25, align: 8)
!277 = distinct !DILexicalBlock(scope: !273, file: !8, line: 145, column: 5)
!278 = !DILocation(line: 145, column: 12, scope: !277)
!279 = !DILocation(line: 145, column: 31, scope: !277)
!280 = !DILocation(line: 145, column: 33, scope: !277)
!281 = !DILocation(line: 145, column: 18, scope: !277)
!282 = !DILocation(line: 597, column: 23, scope: !283, inlinedAt: !253)
!283 = distinct !DILexicalBlock(scope: !251, file: !106, line: 596, column: 2)
!284 = !DILocation(line: 597, column: 3, scope: !283, inlinedAt: !253)
!285 = !DILocation(line: 395, column: 27, scope: !286, inlinedAt: !288)
!286 = distinct !DILexicalBlock(scope: !287, file: !173, line: 396, column: 1)
!287 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !173, file: !173, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!288 = !DILocation(line: 146, column: 5, scope: !277)
!289 = !DILocation(line: 413, column: 24, scope: !287, inlinedAt: !288)
!290 = !DILocation(line: 413, column: 6, scope: !287, inlinedAt: !288)
!291 = !DILocation(line: 147, column: 5, scope: !277)
!292 = !DILocation(line: 151, column: 26, scope: !293)
!293 = distinct !DILexicalBlock(scope: !273, file: !8, line: 151, column: 5)
!294 = !DILocation(line: 151, column: 49, scope: !293)
!295 = !DILocation(line: 151, column: 5, scope: !293)
!296 = !DILocation(line: 155, column: 25, scope: !297)
!297 = distinct !DILexicalBlock(scope: !273, file: !8, line: 155, column: 5)
!298 = !DILocation(line: 155, column: 27, scope: !297)
!299 = !DILocation(line: 155, column: 5, scope: !297)
!300 = !DILocation(line: 139, column: 29, scope: !267)
!301 = !DILocation(line: 159, column: 26, scope: !256)
!302 = !DILocation(line: 159, column: 9, scope: !256)
!303 = !DILocation(line: 597, column: 23, scope: !304, inlinedAt: !253)
!304 = distinct !DILexicalBlock(scope: !251, file: !106, line: 596, column: 2)
!305 = !DILocation(line: 597, column: 3, scope: !304, inlinedAt: !253)
!306 = distinct !DISubprogram(name: "tdecode", linkageName: "std.net.url.tdecode", scope: !8, file: !8, line: 170, type: !307, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !45)
!307 = !DISubroutineType(types: !308)
!308 = !{!198, !243, !24, !10}
!309 = !DILocalVariable(name: "s", arg: 1, scope: !306, file: !8, line: 170, type: !24)
!310 = !DILocation(line: 170, column: 27, scope: !306)
!311 = !DILocalVariable(name: "mode", arg: 2, scope: !306, file: !8, line: 170, type: !10)
!312 = !DILocation(line: 170, column: 47, scope: !306)
!313 = !DILocation(line: 170, column: 56, scope: !306)
!314 = distinct !DISubprogram(name: "to_format", linkageName: "std.net.url.Url.to_format", scope: !20, file: !20, line: 171, type: !315, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !45)
!315 = !DISubroutineType(types: !316)
!316 = !{!198, !200, !317, !330}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Url*", baseType: !318, size: 64, align: 64, dwarfAddressSpace: 0)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "Url", scope: !20, file: !20, line: 29, size: 1088, align: 64, elements: !319, identifier: "std.net.url.Url")
!319 = !{!320, !321, !322, !324, !325, !326, !327, !328, !329}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !318, file: !20, line: 31, baseType: !24, size: 128, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !318, file: !20, line: 32, baseType: !24, size: 128, align: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !318, file: !20, line: 33, baseType: !323, size: 32, align: 32, offset: 256)
!323 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !318, file: !20, line: 34, baseType: !24, size: 128, align: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !318, file: !20, line: 35, baseType: !24, size: 128, align: 64, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !318, file: !20, line: 36, baseType: !24, size: 128, align: 64, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !318, file: !20, line: 37, baseType: !24, size: 128, align: 64, offset: 704)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !318, file: !20, line: 38, baseType: !24, size: 128, align: 64, offset: 832)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !318, file: !20, line: 40, baseType: !92, size: 128, align: 64, offset: 960)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !331, size: 64, align: 64, dwarfAddressSpace: 0)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !20, file: !20, line: 63, size: 384, align: 64, elements: !332, identifier: "std.io.Formatter")
!332 = !{!333, !334, !339}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !331, file: !20, line: 65, baseType: !95, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !331, file: !20, line: 66, baseType: !335, size: 64, align: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !20, file: !20, line: 16, baseType: !336, align: 8)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !337, size: 64, align: 64, dwarfAddressSpace: 0)
!337 = !DISubroutineType(types: !338)
!338 = !{!198, !95, !95, !11}
!339 = !DIDerivedType(tag: DW_TAG_member, scope: !331, file: !20, line: 67, baseType: !340, size: 256, align: 64, offset: 128)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !331, file: !20, line: 67, size: 256, align: 64, elements: !341)
!341 = !{!342, !343, !344, !345, !346}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !340, file: !20, line: 69, baseType: !323, size: 32, align: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !340, file: !20, line: 70, baseType: !323, size: 32, align: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !340, file: !20, line: 71, baseType: !323, size: 32, align: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !340, file: !20, line: 72, baseType: !30, size: 64, align: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !340, file: !20, line: 73, baseType: !198, size: 64, align: 64, offset: 192)
!347 = !DILocation(line: 172, column: 1, scope: !314)
!348 = !DILocalVariable(name: "self", arg: 1, scope: !314, file: !20, line: 171, type: !317)
!349 = !DILocation(line: 171, column: 23, scope: !314)
!350 = !DILocalVariable(name: "f", arg: 2, scope: !314, file: !20, line: 171, type: !330)
!351 = !DILocation(line: 171, column: 41, scope: !314)
!352 = !DILocalVariable(name: "len", scope: !314, file: !20, line: 173, type: !30, align: 8)
!353 = !DILocation(line: 173, column: 6, scope: !314)
!354 = !DILocation(line: 175, column: 6, scope: !314)
!355 = !DILocation(line: 177, column: 3, scope: !356)
!356 = distinct !DILexicalBlock(scope: !314, file: !20, line: 176, column: 2)
!357 = !DILocation(line: 177, column: 18, scope: !356)
!358 = !DILocation(line: 177, column: 10, scope: !356)
!359 = !DILocation(line: 178, column: 3, scope: !356)
!360 = !DILocation(line: 178, column: 10, scope: !356)
!361 = !DILocation(line: 179, column: 7, scope: !356)
!362 = !DILocation(line: 179, column: 26, scope: !356)
!363 = !DILocation(line: 179, column: 33, scope: !356)
!364 = !DILocation(line: 183, column: 6, scope: !314)
!365 = !DILocalVariable(name: "buffer", scope: !366, file: !20, line: 544, type: !367, align: 16)
!366 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !106, file: !106, line: 542, scopeLine: 542, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !45)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 512, align: 8, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 64, lowerBound: 0)
!370 = !DILocation(line: 544, column: 14, scope: !366, inlinedAt: !371)
!371 = !DILocation(line: 185, column: 3, scope: !372)
!372 = distinct !DILexicalBlock(scope: !314, file: !20, line: 184, column: 2)
!373 = !DILocalVariable(name: "allocator", scope: !366, file: !20, line: 545, type: !374, align: 8)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !20, file: !20, line: 12, size: 384, align: 64, elements: !375, identifier: "std.core.mem.allocator.OnStackAllocator")
!375 = !{!376, !377, !378, !379}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !374, file: !20, line: 14, baseType: !92, size: 128, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !374, file: !20, line: 15, baseType: !25, size: 128, align: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !374, file: !20, line: 16, baseType: !30, size: 64, align: 64, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !374, file: !20, line: 17, baseType: !380, size: 64, align: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !381, size: 64, align: 64, dwarfAddressSpace: 0)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !20, file: !20, line: 20, size: 192, align: 64, elements: !382, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!382 = !{!383, !384, !385}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !381, file: !20, line: 22, baseType: !44, size: 8, align: 8)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !381, file: !20, line: 23, baseType: !380, size: 64, align: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !381, file: !20, line: 24, baseType: !95, size: 64, align: 64, offset: 128)
!386 = !DILocation(line: 545, column: 19, scope: !366, inlinedAt: !371)
!387 = !DILocation(line: 546, column: 18, scope: !366, inlinedAt: !371)
!388 = !DILocation(line: 546, column: 26, scope: !366, inlinedAt: !371)
!389 = !DILocation(line: 546, column: 2, scope: !366, inlinedAt: !371)
!390 = !DILocalVariable(name: "smem", scope: !372, file: !20, line: 185, type: !92, align: 8)
!391 = !DILocation(line: 185, column: 28, scope: !372)
!392 = !DILocation(line: 548, column: 8, scope: !393, inlinedAt: !371)
!393 = distinct !DILexicalBlock(scope: !366, file: !106, line: 548, column: 2)
!394 = !DILocation(line: 187, column: 4, scope: !395)
!395 = distinct !DILexicalBlock(scope: !372, file: !20, line: 186, column: 3)
!396 = !DILocation(line: 187, column: 32, scope: !395)
!397 = !DILocation(line: 187, column: 47, scope: !395)
!398 = !DILocation(line: 187, column: 19, scope: !395)
!399 = !DILocation(line: 187, column: 11, scope: !395)
!400 = !DILocation(line: 547, column: 8, scope: !401, inlinedAt: !371)
!401 = distinct !DILexicalBlock(scope: !366, file: !106, line: 547, column: 8)
!402 = !DILocation(line: 547, column: 8, scope: !403, inlinedAt: !371)
!403 = distinct !DILexicalBlock(scope: !366, file: !106, line: 547, column: 8)
!404 = !DILocation(line: 189, column: 7, scope: !372)
!405 = !DILocation(line: 191, column: 4, scope: !406)
!406 = distinct !DILexicalBlock(scope: !372, file: !20, line: 190, column: 3)
!407 = !DILocation(line: 191, column: 11, scope: !406)
!408 = !DILocalVariable(name: "buffer", scope: !409, file: !20, line: 544, type: !367, align: 16)
!409 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !106, file: !106, line: 542, scopeLine: 542, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !45)
!410 = !DILocation(line: 544, column: 14, scope: !409, inlinedAt: !411)
!411 = !DILocation(line: 192, column: 4, scope: !406)
!412 = !DILocalVariable(name: "allocator", scope: !409, file: !20, line: 545, type: !374, align: 8)
!413 = !DILocation(line: 545, column: 19, scope: !409, inlinedAt: !411)
!414 = !DILocation(line: 546, column: 18, scope: !409, inlinedAt: !411)
!415 = !DILocation(line: 546, column: 26, scope: !409, inlinedAt: !411)
!416 = !DILocation(line: 546, column: 2, scope: !409, inlinedAt: !411)
!417 = !DILocalVariable(name: "smem", scope: !406, file: !20, line: 192, type: !92, align: 8)
!418 = !DILocation(line: 192, column: 29, scope: !406)
!419 = !DILocation(line: 548, column: 8, scope: !420, inlinedAt: !411)
!420 = distinct !DILexicalBlock(scope: !409, file: !106, line: 548, column: 2)
!421 = !DILocation(line: 194, column: 5, scope: !422)
!422 = distinct !DILexicalBlock(scope: !406, file: !20, line: 193, column: 4)
!423 = !DILocation(line: 194, column: 33, scope: !422)
!424 = !DILocation(line: 194, column: 48, scope: !422)
!425 = !DILocation(line: 194, column: 20, scope: !422)
!426 = !DILocation(line: 194, column: 12, scope: !422)
!427 = !DILocation(line: 547, column: 8, scope: !428, inlinedAt: !411)
!428 = distinct !DILexicalBlock(scope: !409, file: !106, line: 547, column: 8)
!429 = !DILocation(line: 547, column: 8, scope: !430, inlinedAt: !411)
!430 = distinct !DILexicalBlock(scope: !409, file: !106, line: 547, column: 8)
!431 = !DILocation(line: 197, column: 3, scope: !372)
!432 = !DILocation(line: 197, column: 10, scope: !372)
!433 = !DILocalVariable(name: "buffer", scope: !434, file: !20, line: 544, type: !435, align: 16)
!434 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !106, file: !106, line: 542, scopeLine: 542, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !45)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1024, align: 8, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 128, lowerBound: 0)
!438 = !DILocation(line: 544, column: 14, scope: !434, inlinedAt: !439)
!439 = !DILocation(line: 201, column: 2, scope: !314)
!440 = !DILocalVariable(name: "allocator", scope: !434, file: !20, line: 545, type: !374, align: 8)
!441 = !DILocation(line: 545, column: 19, scope: !434, inlinedAt: !439)
!442 = !DILocation(line: 546, column: 18, scope: !434, inlinedAt: !439)
!443 = !DILocation(line: 546, column: 26, scope: !434, inlinedAt: !439)
!444 = !DILocation(line: 546, column: 2, scope: !434, inlinedAt: !439)
!445 = !DILocalVariable(name: "smem", scope: !314, file: !20, line: 201, type: !92, align: 8)
!446 = !DILocation(line: 201, column: 28, scope: !314)
!447 = !DILocation(line: 548, column: 8, scope: !448, inlinedAt: !439)
!448 = distinct !DILexicalBlock(scope: !434, file: !106, line: 548, column: 2)
!449 = !DILocation(line: 203, column: 3, scope: !450)
!450 = distinct !DILexicalBlock(scope: !314, file: !20, line: 202, column: 2)
!451 = !DILocation(line: 203, column: 31, scope: !450)
!452 = !DILocation(line: 203, column: 42, scope: !450)
!453 = !DILocation(line: 203, column: 18, scope: !450)
!454 = !DILocation(line: 203, column: 10, scope: !450)
!455 = !DILocation(line: 547, column: 8, scope: !456, inlinedAt: !439)
!456 = distinct !DILexicalBlock(scope: !434, file: !106, line: 547, column: 8)
!457 = !DILocation(line: 547, column: 8, scope: !458, inlinedAt: !439)
!458 = distinct !DILexicalBlock(scope: !434, file: !106, line: 547, column: 8)
!459 = !DILocation(line: 207, column: 6, scope: !314)
!460 = !DILocation(line: 207, column: 17, scope: !314)
!461 = !DILocation(line: 207, column: 40, scope: !314)
!462 = !DILocation(line: 207, column: 24, scope: !314)
!463 = !DILocalVariable(name: "buffer", scope: !464, file: !20, line: 544, type: !465, align: 16)
!464 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !106, file: !106, line: 542, scopeLine: 542, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !45)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2048, align: 8, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 256, lowerBound: 0)
!468 = !DILocation(line: 544, column: 14, scope: !464, inlinedAt: !469)
!469 = !DILocation(line: 210, column: 2, scope: !314)
!470 = !DILocalVariable(name: "allocator", scope: !464, file: !20, line: 545, type: !374, align: 8)
!471 = !DILocation(line: 545, column: 19, scope: !464, inlinedAt: !469)
!472 = !DILocation(line: 546, column: 18, scope: !464, inlinedAt: !469)
!473 = !DILocation(line: 546, column: 26, scope: !464, inlinedAt: !469)
!474 = !DILocation(line: 546, column: 2, scope: !464, inlinedAt: !469)
!475 = !DILocalVariable(name: "smem", scope: !314, file: !20, line: 210, type: !92, align: 8)
!476 = !DILocation(line: 210, column: 28, scope: !314)
!477 = !DILocation(line: 548, column: 8, scope: !478, inlinedAt: !469)
!478 = distinct !DILexicalBlock(scope: !464, file: !106, line: 548, column: 2)
!479 = !DILocation(line: 212, column: 3, scope: !480)
!480 = distinct !DILexicalBlock(scope: !314, file: !20, line: 211, column: 2)
!481 = !DILocation(line: 212, column: 31, scope: !480)
!482 = !DILocation(line: 212, column: 42, scope: !480)
!483 = !DILocation(line: 212, column: 18, scope: !480)
!484 = !DILocation(line: 212, column: 10, scope: !480)
!485 = !DILocation(line: 547, column: 8, scope: !486, inlinedAt: !469)
!486 = distinct !DILexicalBlock(scope: !464, file: !106, line: 547, column: 8)
!487 = !DILocation(line: 547, column: 8, scope: !488, inlinedAt: !469)
!488 = distinct !DILexicalBlock(scope: !464, file: !106, line: 547, column: 8)
!489 = !DILocation(line: 217, column: 6, scope: !314)
!490 = !DILocation(line: 219, column: 3, scope: !491)
!491 = distinct !DILexicalBlock(scope: !314, file: !20, line: 218, column: 2)
!492 = !DILocation(line: 219, column: 10, scope: !491)
!493 = !DILocation(line: 220, column: 3, scope: !491)
!494 = !DILocation(line: 220, column: 18, scope: !491)
!495 = !DILocation(line: 220, column: 10, scope: !491)
!496 = !DILocation(line: 224, column: 6, scope: !314)
!497 = !DILocalVariable(name: "buffer", scope: !498, file: !20, line: 544, type: !465, align: 16)
!498 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !106, file: !106, line: 542, scopeLine: 542, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !45)
!499 = !DILocation(line: 544, column: 14, scope: !498, inlinedAt: !500)
!500 = !DILocation(line: 226, column: 3, scope: !501)
!501 = distinct !DILexicalBlock(scope: !314, file: !20, line: 225, column: 2)
!502 = !DILocalVariable(name: "allocator", scope: !498, file: !20, line: 545, type: !374, align: 8)
!503 = !DILocation(line: 545, column: 19, scope: !498, inlinedAt: !500)
!504 = !DILocation(line: 546, column: 18, scope: !498, inlinedAt: !500)
!505 = !DILocation(line: 546, column: 26, scope: !498, inlinedAt: !500)
!506 = !DILocation(line: 546, column: 2, scope: !498, inlinedAt: !500)
!507 = !DILocalVariable(name: "smem", scope: !501, file: !20, line: 226, type: !92, align: 8)
!508 = !DILocation(line: 226, column: 29, scope: !501)
!509 = !DILocation(line: 548, column: 8, scope: !510, inlinedAt: !500)
!510 = distinct !DILexicalBlock(scope: !498, file: !106, line: 548, column: 2)
!511 = !DILocation(line: 228, column: 4, scope: !512)
!512 = distinct !DILexicalBlock(scope: !501, file: !20, line: 227, column: 3)
!513 = !DILocation(line: 228, column: 11, scope: !512)
!514 = !DILocation(line: 547, column: 8, scope: !515, inlinedAt: !500)
!515 = distinct !DILexicalBlock(scope: !498, file: !106, line: 547, column: 8)
!516 = !DILocation(line: 229, column: 4, scope: !512)
!517 = !DILocation(line: 229, column: 32, scope: !512)
!518 = !DILocation(line: 229, column: 47, scope: !512)
!519 = !DILocation(line: 229, column: 19, scope: !512)
!520 = !DILocation(line: 229, column: 11, scope: !512)
!521 = !DILocation(line: 547, column: 8, scope: !522, inlinedAt: !500)
!522 = distinct !DILexicalBlock(scope: !498, file: !106, line: 547, column: 8)
!523 = !DILocation(line: 547, column: 8, scope: !524, inlinedAt: !500)
!524 = distinct !DILexicalBlock(scope: !498, file: !106, line: 547, column: 8)
!525 = !DILocation(line: 232, column: 9, scope: !314)
!526 = distinct !DISubprogram(name: "to_string", linkageName: "std.net.url.Url.to_string", scope: !20, file: !20, line: 235, type: !527, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !45)
!527 = !DISubroutineType(types: !528)
!528 = !{!24, !317, !92}
!529 = !DILocation(line: 236, column: 1, scope: !526)
!530 = !DILocalVariable(name: "self", arg: 1, scope: !526, file: !20, line: 235, type: !317)
!531 = !DILocation(line: 235, column: 25, scope: !526)
!532 = !DILocalVariable(name: "allocator", arg: 2, scope: !526, file: !20, line: 235, type: !92)
!533 = !DILocation(line: 235, column: 42, scope: !526)
!534 = !DILocation(line: 237, column: 42, scope: !526)
!535 = !DILocation(line: 237, column: 9, scope: !526)
!536 = distinct !DISubprogram(name: "add", linkageName: "std.net.url.UrlQueryValues.add", scope: !20, file: !20, line: 292, type: !537, scopeLine: 292, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !45)
!537 = !DISubroutineType(types: !538)
!538 = !{!539, !539, !24, !24}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "UrlQueryValues*", baseType: !540, size: 64, align: 64, dwarfAddressSpace: 0)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "UrlQueryValues", scope: !20, file: !20, line: 243, size: 704, align: 64, elements: !541, identifier: "std.net.url.UrlQueryValues")
!541 = !{!542, !573}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !540, file: !20, line: 245, baseType: !543, size: 384, align: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !540, file: !20, line: 29, size: 384, align: 64, elements: !544, identifier: "std_collections_map$String$std_collections_list$String$.List$.HashMap")
!544 = !{!545, !568, !569, !570, !571}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !543, file: !20, line: 31, baseType: !546, size: 128, align: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !547, identifier: "Entry*[]")
!547 = !{!548, !567}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !546, baseType: !549, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !550, size: 64, align: 64, dwarfAddressSpace: 0)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !551, size: 64, align: 64, dwarfAddressSpace: 0)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !20, file: !20, line: 21, size: 576, align: 64, elements: !552, identifier: "std_collections_map$String$std_collections_list$String$.List$.Entry")
!552 = !{!553, !554, !556, !566}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !551, file: !20, line: 23, baseType: !323, size: 32, align: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !551, file: !20, line: 24, baseType: !555, size: 128, align: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !20, file: !20, line: 245, baseType: !24, align: 8)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !551, file: !20, line: 25, baseType: !557, size: 320, align: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !20, file: !20, line: 245, baseType: !558, align: 8)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !20, file: !20, line: 18, size: 320, align: 64, elements: !559, identifier: "std_collections_list$String$.List")
!559 = !{!560, !561, !562, !563}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !558, file: !20, line: 20, baseType: !30, size: 64, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !558, file: !20, line: 21, baseType: !30, size: 64, align: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !558, file: !20, line: 22, baseType: !92, size: 128, align: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !558, file: !20, line: 23, baseType: !564, size: 64, align: 64, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !565, size: 64, align: 64, dwarfAddressSpace: 0)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !20, file: !20, line: 241, baseType: !24, align: 8)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !551, file: !20, line: 26, baseType: !550, size: 64, align: 64, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !546, baseType: !30, size: 64, align: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !543, file: !20, line: 32, baseType: !92, size: 128, align: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !543, file: !20, line: 33, baseType: !323, size: 32, align: 32, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !543, file: !20, line: 34, baseType: !323, size: 32, align: 32, offset: 288)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !543, file: !20, line: 35, baseType: !572, size: 32, align: 32, offset: 320)
!572 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "key_order", scope: !540, file: !20, line: 246, baseType: !574, size: 320, align: 64, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "UrlQueryValueList", scope: !20, file: !20, line: 241, baseType: !558, align: 8)
!575 = !DILocation(line: 293, column: 1, scope: !536)
!576 = !DILocalVariable(name: "self", arg: 1, scope: !536, file: !20, line: 292, type: !539)
!577 = !DILocation(line: 292, column: 39, scope: !536)
!578 = !DILocalVariable(name: "key", arg: 2, scope: !536, file: !20, line: 292, type: !24)
!579 = !DILocation(line: 292, column: 53, scope: !536)
!580 = !DILocalVariable(name: "value", arg: 3, scope: !536, file: !20, line: 292, type: !24)
!581 = !DILocation(line: 292, column: 65, scope: !536)
!582 = !DILocalVariable(name: "value_copy", scope: !536, file: !20, line: 294, type: !24, align: 8)
!583 = !DILocation(line: 294, column: 9, scope: !536)
!584 = !DILocation(line: 294, column: 33, scope: !536)
!585 = !DILocation(line: 294, column: 22, scope: !536)
!586 = !DILocalVariable(name: "existing", scope: !536, file: !20, line: 295, type: !587, align: 8)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Value*", baseType: !557, size: 64, align: 64, dwarfAddressSpace: 0)
!588 = !DILocation(line: 295, column: 10, scope: !536)
!589 = !DILocation(line: 295, column: 21, scope: !536)
!590 = !DILocation(line: 297, column: 17, scope: !591)
!591 = distinct !DILexicalBlock(scope: !536, file: !20, line: 296, column: 2)
!592 = !DILocation(line: 297, column: 3, scope: !591)
!593 = !DILocalVariable(name: "new_list", scope: !594, file: !20, line: 301, type: !574, align: 8)
!594 = distinct !DILexicalBlock(scope: !536, file: !20, line: 300, column: 2)
!595 = !DILocation(line: 301, column: 21, scope: !594)
!596 = !DILocation(line: 302, column: 28, scope: !594)
!597 = !DILocation(line: 302, column: 46, scope: !594)
!598 = !DILocation(line: 55, column: 11, scope: !594)
!599 = !DILocation(line: 302, column: 3, scope: !594)
!600 = !DILocation(line: 303, column: 5, scope: !594)
!601 = !DILocation(line: 303, column: 18, scope: !594)
!602 = !DILocation(line: 303, column: 4, scope: !594)
!603 = !DILocation(line: 304, column: 3, scope: !594)
!604 = !DILocation(line: 304, column: 32, scope: !594)
!605 = !DILocation(line: 304, column: 23, scope: !594)
!606 = !DILocation(line: 306, column: 9, scope: !536)
!607 = distinct !DISubprogram(name: "to_format", linkageName: "std.net.url.UrlQueryValues.to_format", scope: !20, file: !20, line: 311, type: !608, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !45)
!608 = !DISubroutineType(types: !609)
!609 = !{!198, !200, !539, !330}
!610 = !DILocation(line: 312, column: 1, scope: !607)
!611 = !DILocalVariable(name: "self", arg: 1, scope: !607, file: !20, line: 311, type: !539)
!612 = !DILocation(line: 311, column: 34, scope: !607)
!613 = !DILocalVariable(name: "f", arg: 2, scope: !607, file: !20, line: 311, type: !330)
!614 = !DILocation(line: 311, column: 52, scope: !607)
!615 = !DILocalVariable(name: "len", scope: !607, file: !20, line: 313, type: !30, align: 8)
!616 = !DILocation(line: 313, column: 6, scope: !607)
!617 = !DILocalVariable(name: "i", scope: !607, file: !20, line: 314, type: !30, align: 8)
!618 = !DILocation(line: 314, column: 6, scope: !607)
!619 = !DILocation(line: 315, column: 16, scope: !620)
!620 = distinct !DILexicalBlock(scope: !607, file: !20, line: 315, column: 2)
!621 = !DILocalVariable(name: ".temp", scope: !620, file: !20, line: 315, type: !30, align: 8)
!622 = !DILocalVariable(name: "key", scope: !623, file: !20, line: 315, type: !565, align: 8)
!623 = distinct !DILexicalBlock(scope: !620, file: !20, line: 316, column: 2)
!624 = !DILocation(line: 315, column: 11, scope: !623)
!625 = !DILocation(line: 378, column: 26, scope: !626, inlinedAt: !624)
!626 = distinct !DILexicalBlock(scope: !628, file: !627, line: 379, column: 1)
!627 = !DIFile(filename: "list.c3", directory: "/usr/lib/c3c/lib/std/collections")
!628 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !627, file: !627, line: 378, scopeLine: 378, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!629 = !DILocation(line: 376, column: 11, scope: !626, inlinedAt: !624)
!630 = !DILocation(line: 376, column: 19, scope: !626, inlinedAt: !624)
!631 = !DILocation(line: 315, column: 11, scope: !626, inlinedAt: !624)
!632 = !DILocation(line: 380, column: 9, scope: !628, inlinedAt: !624)
!633 = !DILocation(line: 380, column: 22, scope: !628, inlinedAt: !624)
!634 = !DILocalVariable(name: "buffer", scope: !635, file: !20, line: 544, type: !435, align: 16)
!635 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !106, file: !106, line: 542, scopeLine: 542, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !45)
!636 = !DILocation(line: 544, column: 14, scope: !635, inlinedAt: !637)
!637 = !DILocation(line: 317, column: 3, scope: !638)
!638 = distinct !DILexicalBlock(scope: !623, file: !20, line: 316, column: 2)
!639 = !DILocalVariable(name: "allocator", scope: !635, file: !20, line: 545, type: !374, align: 8)
!640 = !DILocation(line: 545, column: 19, scope: !635, inlinedAt: !637)
!641 = !DILocation(line: 546, column: 18, scope: !635, inlinedAt: !637)
!642 = !DILocation(line: 546, column: 26, scope: !635, inlinedAt: !637)
!643 = !DILocation(line: 546, column: 2, scope: !635, inlinedAt: !637)
!644 = !DILocalVariable(name: "mem", scope: !638, file: !20, line: 317, type: !92, align: 8)
!645 = !DILocation(line: 317, column: 29, scope: !638)
!646 = !DILocation(line: 548, column: 8, scope: !647, inlinedAt: !637)
!647 = distinct !DILexicalBlock(scope: !635, file: !106, line: 548, column: 2)
!648 = !DILocalVariable(name: "encoded_key", scope: !649, file: !20, line: 319, type: !24, align: 8)
!649 = distinct !DILexicalBlock(scope: !638, file: !20, line: 318, column: 3)
!650 = !DILocation(line: 319, column: 11, scope: !649)
!651 = !DILocation(line: 319, column: 42, scope: !649)
!652 = !DILocation(line: 319, column: 25, scope: !649)
!653 = !DILocalVariable(name: "values", scope: !649, file: !20, line: 320, type: !558, align: 8)
!654 = !DILocation(line: 320, column: 23, scope: !649)
!655 = !DILocation(line: 320, column: 32, scope: !649)
!656 = !DILocation(line: 321, column: 14, scope: !649)
!657 = !DILocation(line: 547, column: 8, scope: !658, inlinedAt: !637)
!658 = distinct !DILexicalBlock(scope: !635, file: !106, line: 547, column: 8)
!659 = !DILocation(line: 322, column: 21, scope: !660)
!660 = distinct !DILexicalBlock(scope: !649, file: !20, line: 322, column: 4)
!661 = !DILocalVariable(name: ".temp", scope: !660, file: !20, line: 322, type: !30, align: 8)
!662 = !DILocalVariable(name: "value", scope: !663, file: !20, line: 322, type: !565, align: 8)
!663 = distinct !DILexicalBlock(scope: !660, file: !20, line: 323, column: 4)
!664 = !DILocation(line: 322, column: 13, scope: !663)
!665 = !DILocation(line: 378, column: 26, scope: !666, inlinedAt: !664)
!666 = distinct !DILexicalBlock(scope: !667, file: !627, line: 379, column: 1)
!667 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !627, file: !627, line: 378, scopeLine: 378, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!668 = !DILocation(line: 376, column: 11, scope: !666, inlinedAt: !664)
!669 = !DILocation(line: 376, column: 19, scope: !666, inlinedAt: !664)
!670 = !DILocation(line: 322, column: 13, scope: !666, inlinedAt: !664)
!671 = !DILocation(line: 380, column: 9, scope: !667, inlinedAt: !664)
!672 = !DILocation(line: 380, column: 22, scope: !667, inlinedAt: !664)
!673 = !DILocation(line: 324, column: 9, scope: !674)
!674 = distinct !DILexicalBlock(scope: !663, file: !20, line: 323, column: 4)
!675 = !DILocation(line: 324, column: 16, scope: !674)
!676 = !DILocation(line: 324, column: 23, scope: !674)
!677 = !DILocation(line: 547, column: 8, scope: !678, inlinedAt: !637)
!678 = distinct !DILexicalBlock(scope: !635, file: !106, line: 547, column: 8)
!679 = !DILocation(line: 325, column: 5, scope: !674)
!680 = !DILocation(line: 325, column: 12, scope: !674)
!681 = !DILocation(line: 547, column: 8, scope: !682, inlinedAt: !637)
!682 = distinct !DILexicalBlock(scope: !635, file: !106, line: 547, column: 8)
!683 = !DILocation(line: 326, column: 5, scope: !674)
!684 = !DILocation(line: 326, column: 12, scope: !674)
!685 = !DILocation(line: 547, column: 8, scope: !686, inlinedAt: !637)
!686 = distinct !DILexicalBlock(scope: !635, file: !106, line: 547, column: 8)
!687 = !DILocalVariable(name: "buffer", scope: !688, file: !20, line: 544, type: !465, align: 16)
!688 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !106, file: !106, line: 542, scopeLine: 542, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !45)
!689 = !DILocation(line: 544, column: 14, scope: !688, inlinedAt: !690)
!690 = !DILocation(line: 327, column: 5, scope: !674)
!691 = !DILocalVariable(name: "allocator", scope: !688, file: !20, line: 545, type: !374, align: 8)
!692 = !DILocation(line: 545, column: 19, scope: !688, inlinedAt: !690)
!693 = !DILocation(line: 546, column: 18, scope: !688, inlinedAt: !690)
!694 = !DILocation(line: 546, column: 26, scope: !688, inlinedAt: !690)
!695 = !DILocation(line: 546, column: 2, scope: !688, inlinedAt: !690)
!696 = !DILocalVariable(name: "smem", scope: !674, file: !20, line: 327, type: !92, align: 8)
!697 = !DILocation(line: 327, column: 31, scope: !674)
!698 = !DILocation(line: 548, column: 8, scope: !699, inlinedAt: !690)
!699 = distinct !DILexicalBlock(scope: !688, file: !106, line: 548, column: 2)
!700 = !DILocation(line: 329, column: 6, scope: !701)
!701 = distinct !DILexicalBlock(scope: !674, file: !20, line: 328, column: 5)
!702 = !DILocation(line: 329, column: 41, scope: !701)
!703 = !DILocation(line: 329, column: 21, scope: !701)
!704 = !DILocation(line: 329, column: 13, scope: !701)
!705 = !DILocation(line: 547, column: 8, scope: !706, inlinedAt: !690)
!706 = distinct !DILexicalBlock(scope: !688, file: !106, line: 547, column: 8)
!707 = !DILocation(line: 547, column: 8, scope: !708, inlinedAt: !637)
!708 = distinct !DILexicalBlock(scope: !635, file: !106, line: 547, column: 8)
!709 = !DILocation(line: 547, column: 8, scope: !710, inlinedAt: !690)
!710 = distinct !DILexicalBlock(scope: !688, file: !106, line: 547, column: 8)
!711 = !DILocation(line: 331, column: 5, scope: !674)
!712 = !DILocation(line: 547, column: 8, scope: !713, inlinedAt: !637)
!713 = distinct !DILexicalBlock(scope: !635, file: !106, line: 547, column: 8)
!714 = !DILocation(line: 335, column: 9, scope: !607)
!715 = distinct !DISubprogram(name: "free", linkageName: "std.net.url.UrlQueryValues.free", scope: !20, file: !20, line: 339, type: !716, scopeLine: 339, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !45)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !539}
!718 = !DILocation(line: 340, column: 1, scope: !715)
!719 = !DILocalVariable(name: "self", arg: 1, scope: !715, file: !20, line: 339, type: !539)
!720 = !DILocation(line: 339, column: 29, scope: !715)
!721 = !DILocation(line: 341, column: 2, scope: !715)
!722 = !DILocation(line: 324, column: 7, scope: !723, inlinedAt: !725)
!723 = distinct !DISubprogram(name: "@each_entry", linkageName: "@each_entry", scope: !724, file: !724, line: 322, scopeLine: 322, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !45)
!724 = !DIFile(filename: "hashmap.c3", directory: "/usr/lib/c3c/lib/std/collections")
!725 = !DILocation(line: 316, column: 2, scope: !726, inlinedAt: !721)
!726 = distinct !DISubprogram(name: "@each", linkageName: "@each", scope: !724, file: !724, line: 314, scopeLine: 314, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !45)
!727 = !DILocation(line: 324, column: 24, scope: !723, inlinedAt: !725)
!728 = !DILocation(line: 325, column: 26, scope: !729, inlinedAt: !725)
!729 = distinct !DILexicalBlock(scope: !723, file: !724, line: 325, column: 2)
!730 = !DILocalVariable(name: ".temp", scope: !729, file: !20, line: 325, type: !30, align: 8)
!731 = !DILocalVariable(name: "entry", scope: !732, file: !20, line: 325, type: !550, align: 8)
!732 = distinct !DILexicalBlock(scope: !729, file: !724, line: 326, column: 2)
!733 = !DILocation(line: 325, column: 18, scope: !732, inlinedAt: !725)
!734 = !DILocation(line: 325, column: 26, scope: !732, inlinedAt: !725)
!735 = !DILocation(line: 327, column: 3, scope: !736, inlinedAt: !725)
!736 = distinct !DILexicalBlock(scope: !732, file: !724, line: 326, column: 2)
!737 = !DILocation(line: 327, column: 10, scope: !738, inlinedAt: !725)
!738 = distinct !DILexicalBlock(scope: !736, file: !724, line: 327, column: 3)
!739 = !DILocalVariable(name: "entry", scope: !726, file: !20, line: 316, type: !550, align: 8)
!740 = !DILocation(line: 316, column: 27, scope: !726, inlinedAt: !721)
!741 = !DILocation(line: 329, column: 10, scope: !742, inlinedAt: !725)
!742 = distinct !DILexicalBlock(scope: !743, file: !724, line: 329, column: 4)
!743 = distinct !DILexicalBlock(scope: !738, file: !724, line: 328, column: 3)
!744 = !DILocalVariable(name: "key", scope: !715, file: !20, line: 341, type: !24, align: 8)
!745 = !DILocation(line: 341, column: 25, scope: !715)
!746 = !DILocalVariable(name: "values", scope: !715, file: !20, line: 341, type: !574, align: 8)
!747 = !DILocation(line: 341, column: 48, scope: !715)
!748 = !DILocation(line: 318, column: 9, scope: !749, inlinedAt: !721)
!749 = distinct !DILexicalBlock(scope: !750, file: !724, line: 318, column: 3)
!750 = distinct !DILexicalBlock(scope: !726, file: !724, line: 317, column: 2)
!751 = !DILocation(line: 318, column: 20, scope: !749, inlinedAt: !721)
!752 = !DILocation(line: 343, column: 19, scope: !753)
!753 = distinct !DILexicalBlock(scope: !754, file: !20, line: 343, column: 3)
!754 = distinct !DILexicalBlock(scope: !715, file: !20, line: 342, column: 2)
!755 = !DILocalVariable(name: ".temp", scope: !753, file: !20, line: 343, type: !30, align: 8)
!756 = !DILocalVariable(name: "value", scope: !757, file: !20, line: 343, type: !565, align: 8)
!757 = distinct !DILexicalBlock(scope: !753, file: !20, line: 343, column: 27)
!758 = !DILocation(line: 343, column: 12, scope: !757)
!759 = !DILocation(line: 378, column: 26, scope: !760, inlinedAt: !758)
!760 = distinct !DILexicalBlock(scope: !761, file: !627, line: 379, column: 1)
!761 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !627, file: !627, line: 378, scopeLine: 378, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!762 = !DILocation(line: 376, column: 11, scope: !760, inlinedAt: !758)
!763 = !DILocation(line: 376, column: 19, scope: !760, inlinedAt: !758)
!764 = !DILocation(line: 343, column: 12, scope: !760, inlinedAt: !758)
!765 = !DILocation(line: 380, column: 9, scope: !761, inlinedAt: !758)
!766 = !DILocation(line: 380, column: 22, scope: !761, inlinedAt: !758)
!767 = !DILocation(line: 343, column: 38, scope: !757)
!768 = !DILocation(line: 343, column: 27, scope: !757)
!769 = !DILocation(line: 344, column: 3, scope: !754)
!770 = !DILocation(line: 330, column: 12, scope: !743, inlinedAt: !725)
!771 = !DILocation(line: 346, column: 2, scope: !715)
!772 = !DILocation(line: 348, column: 17, scope: !773)
!773 = distinct !DILexicalBlock(scope: !715, file: !20, line: 348, column: 2)
!774 = !DILocalVariable(name: ".temp", scope: !773, file: !20, line: 348, type: !30, align: 8)
!775 = !DILocalVariable(name: "key", scope: !776, file: !20, line: 348, type: !564, align: 8)
!776 = distinct !DILexicalBlock(scope: !773, file: !20, line: 348, column: 33)
!777 = !DILocation(line: 348, column: 12, scope: !776)
!778 = !DILocation(line: 348, column: 17, scope: !776)
!779 = !DILocation(line: 384, column: 19, scope: !776)
!780 = !DILocation(line: 348, column: 42, scope: !776)
!781 = !DILocation(line: 348, column: 33, scope: !776)
!782 = !DILocation(line: 349, column: 2, scope: !715)
!783 = distinct !DISubprogram(name: "free", linkageName: "std.net.url.Url.free", scope: !20, file: !20, line: 357, type: !784, scopeLine: 357, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !45)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !317}
!786 = !DILocation(line: 358, column: 1, scope: !783)
!787 = !DILocalVariable(name: "self", arg: 1, scope: !783, file: !20, line: 357, type: !317)
!788 = !DILocation(line: 357, column: 18, scope: !783)
!789 = !DILocation(line: 359, column: 7, scope: !783)
!790 = !DILocation(line: 359, column: 29, scope: !783)
!791 = !DILocation(line: 360, column: 2, scope: !783)
!792 = !DILocation(line: 360, column: 19, scope: !783)
!793 = !DILocation(line: 361, column: 2, scope: !783)
!794 = !DILocation(line: 361, column: 17, scope: !783)
!795 = !DILocation(line: 362, column: 2, scope: !783)
!796 = !DILocation(line: 362, column: 21, scope: !783)
!797 = !DILocation(line: 363, column: 2, scope: !783)
!798 = !DILocation(line: 363, column: 21, scope: !783)
!799 = !DILocation(line: 364, column: 2, scope: !783)
!800 = !DILocation(line: 364, column: 17, scope: !783)
!801 = !DILocation(line: 365, column: 2, scope: !783)
!802 = !DILocation(line: 365, column: 18, scope: !783)
!803 = !DILocation(line: 366, column: 2, scope: !783)
!804 = !DILocation(line: 366, column: 21, scope: !783)
!805 = distinct !DISubprogram(name: "tparse", linkageName: "std.net.url.tparse", scope: !20, file: !20, line: 50, type: !806, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !45)
!806 = !DISubroutineType(types: !807)
!807 = !{!198, !317, !24}
!808 = !DILocalVariable(name: "url_string", arg: 1, scope: !805, file: !20, line: 50, type: !24)
!809 = !DILocation(line: 50, column: 23, scope: !805)
!810 = !DILocation(line: 47, column: 11, scope: !811)
!811 = distinct !DILexicalBlock(scope: !805, file: !20, line: 50, column: 38)
!812 = !DILocation(line: 50, column: 44, scope: !805)
!813 = !DILocation(line: 50, column: 50, scope: !805)
!814 = !DILocation(line: 56, column: 11, scope: !805)
!815 = !DILocation(line: 50, column: 38, scope: !805)
!816 = distinct !DISubprogram(name: "parse", linkageName: "std.net.url.parse", scope: !20, file: !20, line: 59, type: !817, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !45)
!817 = !DISubroutineType(types: !818)
!818 = !{!198, !317, !92, !24}
!819 = !DILocalVariable(name: "allocator", arg: 1, scope: !816, file: !20, line: 59, type: !92)
!820 = !DILocation(line: 59, column: 25, scope: !816)
!821 = !DILocalVariable(name: "url_string", arg: 2, scope: !816, file: !20, line: 59, type: !24)
!822 = !DILocation(line: 59, column: 43, scope: !816)
!823 = !DILocation(line: 56, column: 11, scope: !824)
!824 = distinct !DILexicalBlock(scope: !816, file: !20, line: 60, column: 1)
!825 = !DILocation(line: 198, column: 46, scope: !826, inlinedAt: !828)
!826 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !827, file: !827, line: 198, scopeLine: 198, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!827 = !DIFile(filename: "string.c3", directory: "/usr/lib/c3c/lib/std/core")
!828 = !DILocation(line: 61, column: 15, scope: !816)
!829 = !DILocation(line: 62, column: 7, scope: !816)
!830 = !DILocation(line: 62, column: 26, scope: !816)
!831 = !DILocalVariable(name: "url", scope: !816, file: !20, line: 63, type: !318, align: 8)
!832 = !DILocation(line: 63, column: 6, scope: !816)
!833 = !DILocation(line: 63, column: 27, scope: !816)
!834 = !DILocalVariable(name: "pos", scope: !816, file: !20, line: 66, type: !30, align: 8)
!835 = !DILocation(line: 66, column: 10, scope: !816)
!836 = !DILocation(line: 66, column: 16, scope: !816)
!837 = !DILocation(line: 68, column: 7, scope: !838)
!838 = distinct !DILexicalBlock(scope: !816, file: !20, line: 67, column: 2)
!839 = !DILocation(line: 68, column: 20, scope: !838)
!840 = !DILocation(line: 69, column: 16, scope: !838)
!841 = !DILocation(line: 69, column: 27, scope: !838)
!842 = !DILocation(line: 69, column: 28, scope: !838)
!843 = !DILocation(line: 69, column: 38, scope: !838)
!844 = !DILocation(line: 70, column: 16, scope: !838)
!845 = !DILocation(line: 70, column: 27, scope: !838)
!846 = !DILocalVariable(name: "pos", scope: !816, file: !20, line: 72, type: !30, align: 8)
!847 = !DILocation(line: 72, column: 15, scope: !816)
!848 = !DILocation(line: 72, column: 21, scope: !816)
!849 = !DILocation(line: 75, column: 7, scope: !850)
!850 = distinct !DILexicalBlock(scope: !816, file: !20, line: 73, column: 2)
!851 = !DILocation(line: 75, column: 20, scope: !850)
!852 = !DILocation(line: 76, column: 16, scope: !850)
!853 = !DILocation(line: 76, column: 27, scope: !850)
!854 = !DILocation(line: 76, column: 28, scope: !850)
!855 = !DILocation(line: 76, column: 38, scope: !850)
!856 = !DILocation(line: 77, column: 3, scope: !850)
!857 = !DILocation(line: 77, column: 32, scope: !850)
!858 = !DILocation(line: 77, column: 43, scope: !850)
!859 = !DILocation(line: 77, column: 14, scope: !850)
!860 = !DILocation(line: 77, column: 65, scope: !850)
!861 = !DILocation(line: 78, column: 10, scope: !850)
!862 = !DILocation(line: 82, column: 6, scope: !816)
!863 = !DILocalVariable(name: "authority_end", scope: !864, file: !20, line: 84, type: !30, align: 8)
!864 = distinct !DILexicalBlock(scope: !816, file: !20, line: 83, column: 2)
!865 = !DILocation(line: 84, column: 7, scope: !864)
!866 = !DILocation(line: 84, column: 23, scope: !864)
!867 = !DILocation(line: 84, column: 59, scope: !864)
!868 = !DILocalVariable(name: "authority", scope: !864, file: !20, line: 85, type: !24, align: 8)
!869 = !DILocation(line: 85, column: 10, scope: !864)
!870 = !DILocation(line: 85, column: 22, scope: !864)
!871 = !DILocation(line: 85, column: 33, scope: !864)
!872 = !DILocation(line: 85, column: 34, scope: !864)
!873 = !DILocalVariable(name: "user_info_end", scope: !864, file: !20, line: 87, type: !30, align: 8)
!874 = !DILocation(line: 87, column: 11, scope: !864)
!875 = !DILocation(line: 87, column: 27, scope: !864)
!876 = !DILocalVariable(name: "userinfo", scope: !877, file: !20, line: 89, type: !24, align: 8)
!877 = distinct !DILexicalBlock(scope: !864, file: !20, line: 88, column: 3)
!878 = !DILocation(line: 89, column: 11, scope: !877)
!879 = !DILocation(line: 89, column: 22, scope: !877)
!880 = !DILocation(line: 89, column: 32, scope: !877)
!881 = !DILocation(line: 89, column: 33, scope: !877)
!882 = !DILocalVariable(name: "username", scope: !877, file: !20, line: 90, type: !24, align: 8)
!883 = !DILocation(line: 90, column: 11, scope: !877)
!884 = !DILocalVariable(name: "password", scope: !877, file: !20, line: 91, type: !24, align: 8)
!885 = !DILocation(line: 91, column: 11, scope: !877)
!886 = !DILocalVariable(name: "state", scope: !887, file: !20, line: 594, type: !107, align: 8)
!887 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !106, file: !106, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !45)
!888 = !DILocation(line: 594, column: 12, scope: !887, inlinedAt: !889)
!889 = !DILocation(line: 92, column: 4, scope: !877)
!890 = !DILocation(line: 594, column: 20, scope: !887, inlinedAt: !889)
!891 = !DILocalVariable(name: "userpass", scope: !892, file: !20, line: 94, type: !893, align: 8)
!892 = distinct !DILexicalBlock(scope: !877, file: !20, line: 93, column: 4)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !894, identifier: "String[]")
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !893, baseType: !243, size: 64, align: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !893, baseType: !30, size: 64, align: 64, offset: 64)
!897 = !DILocation(line: 94, column: 14, scope: !892)
!898 = !DILocation(line: 351, column: 79, scope: !899, inlinedAt: !900)
!899 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !827, file: !827, line: 351, scopeLine: 351, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!900 = !DILocation(line: 94, column: 25, scope: !892)
!901 = !DILocation(line: 95, column: 16, scope: !892)
!902 = !DILocation(line: 95, column: 25, scope: !892)
!903 = !DILocation(line: 96, column: 9, scope: !892)
!904 = !DILocation(line: 597, column: 23, scope: !905, inlinedAt: !889)
!905 = distinct !DILexicalBlock(scope: !887, file: !106, line: 596, column: 2)
!906 = !DILocation(line: 597, column: 3, scope: !905, inlinedAt: !889)
!907 = !DILocation(line: 97, column: 8, scope: !892)
!908 = !DILocation(line: 99, column: 5, scope: !892)
!909 = !DILocation(line: 99, column: 20, scope: !892)
!910 = !DILocation(line: 99, column: 57, scope: !892)
!911 = !DILocation(line: 597, column: 23, scope: !912, inlinedAt: !889)
!912 = distinct !DILexicalBlock(scope: !887, file: !106, line: 596, column: 2)
!913 = !DILocation(line: 597, column: 3, scope: !912, inlinedAt: !889)
!914 = !DILocation(line: 100, column: 9, scope: !892)
!915 = !DILocation(line: 100, column: 23, scope: !892)
!916 = !DILocation(line: 100, column: 56, scope: !892)
!917 = !DILocation(line: 100, column: 65, scope: !892)
!918 = !DILocation(line: 100, column: 38, scope: !892)
!919 = !DILocation(line: 100, column: 82, scope: !892)
!920 = !DILocation(line: 597, column: 23, scope: !921, inlinedAt: !889)
!921 = distinct !DILexicalBlock(scope: !887, file: !106, line: 596, column: 2)
!922 = !DILocation(line: 597, column: 3, scope: !921, inlinedAt: !889)
!923 = !DILocation(line: 597, column: 23, scope: !924, inlinedAt: !889)
!924 = distinct !DILexicalBlock(scope: !887, file: !106, line: 596, column: 2)
!925 = !DILocation(line: 597, column: 3, scope: !924, inlinedAt: !889)
!926 = !DILocation(line: 102, column: 16, scope: !877)
!927 = !DILocation(line: 102, column: 26, scope: !877)
!928 = !DILocalVariable(name: "host", scope: !864, file: !20, line: 106, type: !24, align: 8)
!929 = !DILocation(line: 106, column: 10, scope: !864)
!930 = !DILocation(line: 107, column: 29, scope: !864)
!931 = !DILocation(line: 107, column: 7, scope: !864)
!932 = !DILocation(line: 107, column: 56, scope: !864)
!933 = !DILocation(line: 107, column: 37, scope: !864)
!934 = !DILocalVariable(name: "ipv6_end", scope: !935, file: !20, line: 109, type: !30, align: 8)
!935 = distinct !DILexicalBlock(scope: !864, file: !20, line: 108, column: 3)
!936 = !DILocation(line: 109, column: 8, scope: !935)
!937 = !DILocation(line: 109, column: 19, scope: !935)
!938 = !DILocation(line: 110, column: 11, scope: !935)
!939 = !DILocation(line: 110, column: 21, scope: !935)
!940 = !DILocation(line: 110, column: 26, scope: !935)
!941 = !DILocation(line: 111, column: 9, scope: !935)
!942 = !DILocation(line: 111, column: 25, scope: !935)
!943 = !DILocation(line: 111, column: 42, scope: !935)
!944 = !DILocation(line: 111, column: 52, scope: !935)
!945 = !DILocation(line: 111, column: 55, scope: !935)
!946 = !DILocation(line: 113, column: 5, scope: !947)
!947 = distinct !DILexicalBlock(scope: !935, file: !20, line: 112, column: 4)
!948 = !DILocation(line: 113, column: 16, scope: !947)
!949 = !DILocation(line: 113, column: 26, scope: !947)
!950 = !DILocation(line: 113, column: 29, scope: !947)
!951 = !DILocalVariable(name: "state", scope: !952, file: !20, line: 594, type: !107, align: 8)
!952 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !106, file: !106, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !45)
!953 = !DILocation(line: 594, column: 12, scope: !952, inlinedAt: !954)
!954 = !DILocation(line: 118, column: 4, scope: !955)
