; ModuleID = 'std::io::os'
source_filename = "std::io::os"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%PathImp = type { %"char[]", i32, %any }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, [3 x i64] }
%File = type { ptr }
%List = type { i64, i64, %any, ptr }

$std.io.os.native_rmtree = comdat any

$std.io.os.native_fopen = comdat any

$std.io.os.native_remove = comdat any

$std.io.os.native_freopen = comdat any

$std.io.os.native_fseek = comdat any

$std.io.os.native_ftell = comdat any

$std.io.os.native_fwrite = comdat any

$std.io.os.native_fputc = comdat any

$std.io.os.native_fread = comdat any

$std.io.os.native_temp_directory = comdat any

$std.io.os.native_file_or_dir_exists = comdat any

$std.io.os.native_is_file = comdat any

$std.io.os.native_is_dir = comdat any

$std.io.os.native_stat = comdat any

$std.io.os.native_file_size = comdat any

$std.io.os.native_ls = comdat any

$std.io.CANNOT_READ_DIR = comdat any

$std.io.FILE_NOT_DIR = comdat any

$std.io.GENERAL_ERROR = comdat any

$std.io.BUSY = comdat any

$std.io.NO_PERMISSION = comdat any

$std.io.NAME_TOO_LONG = comdat any

$std.io.DIR_NOT_EMPTY = comdat any

$std.io.SYMLINK_FAILED = comdat any


!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIE Level", i32 2}
!4 = !{i32 4, !"PIC Level", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = !{i32 2, !"frame-pointer", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !8, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, splitDebugInlining: false)
!8 = !DIFile(filename: "rmdir.c3", directory: "/usr/lib/c3c/lib/std/io/os")
!9 = !{!10, !36}
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !12, file: !11, line: 23, baseType: !32, size: 32, align: 32, elements: !33)
!11 = !DIFile(filename: "rmtree.c3", directory: "/usr/lib/c3c/lib/std/io/os")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !11, file: !11, line: 16, size: 320, align: 64, elements: !13, identifier: "std.io.path.PathImp")
!13 = !{!14, !24, !25}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !12, file: !11, line: 18, baseType: !15, size: 128, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !17, identifier: "char[]")
!17 = !{!18, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !16, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !20, size: 64, align: 64, dwarfAddressSpace: 0)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !16, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !23)
!23 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !12, file: !11, line: 19, baseType: !10, size: 32, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !12, file: !11, line: 20, baseType: !26, size: 128, align: 64, offset: 192)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !27, identifier: "Allocator")
!27 = !{!28, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !26, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{!34, !35}
!34 = !DIEnumerator(name: "WIN32", value: 0)
!35 = !DIEnumerator(name: "POSIX", value: 1)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Seek", scope: !37, file: !37, line: 7, baseType: !32, size: 32, align: 32, elements: !38)
!37 = !DIFile(filename: "file_libc.c3", directory: "/usr/lib/c3c/lib/std/io/os")
!38 = !{!39, !40, !41}
!39 = !DIEnumerator(name: "SET", value: 0)
!40 = !DIEnumerator(name: "CURSOR", value: 1)
!41 = !DIEnumerator(name: "END", value: 2)
!42 = distinct !DISubprogram(name: "native_rmtree", linkageName: "std.io.os.native_rmtree", scope: !11, file: !11, line: 7, type: !43, scopeLine: 7, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !47)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !29, !12}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !46)
!46 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!47 = !{}
!48 = !DILocalVariable(name: "dir", arg: 1, scope: !42, file: !11, line: 7, type: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "Path", scope: !50, file: !50, line: 14, baseType: !12, align: 8)
!50 = !DIFile(filename: "temp_directory.c3", directory: "/usr/lib/c3c/lib/std/io/os")
!51 = !DILocation(line: 7, column: 29, scope: !42)
!52 = !DILocation(line: 5, column: 11, scope: !53)
!53 = distinct !DILexicalBlock(scope: !42, file: !11, line: 8, column: 1)
!54 = !DILocalVariable(name: "directory", scope: !42, file: !11, line: 9, type: !55, align: 8)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIRPtr", scope: !11, file: !11, line: 5, baseType: !29, align: 8)
!56 = !DILocation(line: 9, column: 9, scope: !42)
!57 = !DILocation(line: 9, column: 36, scope: !42)
!58 = !DILocation(line: 9, column: 21, scope: !42)
!59 = !DILocation(line: 11, column: 6, scope: !42)
!60 = !DILocation(line: 11, column: 25, scope: !42)
!61 = !DILocation(line: 11, column: 45, scope: !42)
!62 = !DILocation(line: 11, column: 68, scope: !42)
!63 = !DILocation(line: 10, column: 12, scope: !64)
!64 = distinct !DILexicalBlock(scope: !42, file: !11, line: 10, column: 8)
!65 = !DILocation(line: 10, column: 39, scope: !64)
!66 = !DILocation(line: 10, column: 23, scope: !64)
!67 = !DILocation(line: 10, column: 12, scope: !68)
!68 = distinct !DILexicalBlock(scope: !42, file: !11, line: 10, column: 8)
!69 = !DILocation(line: 10, column: 39, scope: !68)
!70 = !DILocation(line: 10, column: 23, scope: !68)
!71 = !DILocalVariable(name: "entry", scope: !42, file: !11, line: 12, type: !72, align: 8)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Posix_dirent*", baseType: !73, size: 64, align: 64, dwarfAddressSpace: 0)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Posix_dirent", scope: !11, file: !11, line: 7, size: 192, align: 64, elements: !74, identifier: "std.os.posix.Posix_dirent")
!74 = !{!75, !78, !80, !82, !83}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "d_fileno", scope: !73, file: !11, line: 9, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ino_t", scope: !77, file: !77, line: 8, baseType: !23, align: 8)
!77 = !DIFile(filename: "fileinfo.c3", directory: "/usr/lib/c3c/lib/std/io/os")
!78 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !73, file: !11, line: 10, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "Off_t", scope: !77, file: !77, line: 80, baseType: !23, align: 8)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !73, file: !11, line: 11, baseType: !81, size: 16, align: 16, offset: 128)
!81 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !73, file: !11, line: 13, baseType: !20, size: 8, align: 8, offset: 144)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !73, file: !11, line: 25, baseType: !84, align: 8, offset: 152)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, align: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 0, lowerBound: 0)
!87 = !DILocation(line: 12, column: 16, scope: !42)
!88 = !DILocation(line: 13, column: 2, scope: !42)
!89 = !DILocation(line: 13, column: 33, scope: !90)
!90 = distinct !DILexicalBlock(scope: !42, file: !11, line: 13, column: 2)
!91 = !DILocation(line: 13, column: 18, scope: !90)
!92 = !DILocalVariable(name: "state", scope: !93, file: !11, line: 594, type: !95, align: 8)
!93 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !94, file: !94, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !47)
!94 = !DIFile(filename: "mem.c3", directory: "/usr/lib/c3c/lib/std/core")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !11, file: !11, line: 402, baseType: !96, align: 8)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !97, size: 64, align: 64, dwarfAddressSpace: 0)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !11, file: !11, line: 32, size: 512, align: 64, elements: !98, identifier: "std.core.mem.allocator.TempAllocator")
!98 = !{!99, !100, !109, !110, !112, !113, !114, !115}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !97, file: !11, line: 34, baseType: !26, size: 128, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !97, file: !11, line: 35, baseType: !101, size: 64, align: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !102, size: 64, align: 64, dwarfAddressSpace: 0)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !11, file: !11, line: 52, size: 256, align: 64, elements: !103, identifier: "std.core.mem.allocator.TempAllocatorPage")
!103 = !{!104, !105, !106, !107, !108}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !102, file: !11, line: 54, baseType: !101, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !102, file: !11, line: 55, baseType: !29, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !102, file: !11, line: 56, baseType: !22, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !102, file: !11, line: 57, baseType: !22, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !102, file: !11, line: 58, baseType: !84, align: 8, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !97, file: !11, line: 36, baseType: !96, size: 64, align: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !97, file: !11, line: 37, baseType: !111, size: 8, align: 8, offset: 256)
!111 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !97, file: !11, line: 38, baseType: !22, size: 64, align: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !97, file: !11, line: 39, baseType: !22, size: 64, align: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !97, file: !11, line: 40, baseType: !22, size: 64, align: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !97, file: !11, line: 41, baseType: !84, align: 8, offset: 512)
!116 = !DILocation(line: 594, column: 12, scope: !93, inlinedAt: !117)
!117 = !DILocation(line: 15, column: 3, scope: !118)
!118 = distinct !DILexicalBlock(scope: !90, file: !11, line: 14, column: 2)
!119 = !DILocation(line: 594, column: 20, scope: !93, inlinedAt: !117)
!120 = !DILocalVariable(name: "name", scope: !121, file: !11, line: 17, type: !15, align: 8)
!121 = distinct !DILexicalBlock(scope: !118, file: !11, line: 16, column: 3)
!122 = !DILocation(line: 17, column: 11, scope: !121)
!123 = !DILocation(line: 17, column: 29, scope: !121)
!124 = !DILocation(line: 17, column: 19, scope: !121)
!125 = !DILocation(line: 18, column: 9, scope: !121)
!126 = !DILocation(line: 18, column: 17, scope: !121)
!127 = !DILocation(line: 18, column: 32, scope: !121)
!128 = !DILocation(line: 597, column: 23, scope: !129, inlinedAt: !117)
!129 = distinct !DILexicalBlock(scope: !93, file: !94, line: 596, column: 2)
!130 = !DILocation(line: 597, column: 3, scope: !129, inlinedAt: !117)
!131 = !DILocalVariable(name: "new_path", scope: !121, file: !11, line: 19, type: !49, align: 8)
!132 = !DILocation(line: 19, column: 9, scope: !121)
!133 = !DILocation(line: 19, column: 20, scope: !121)
!134 = !DILocation(line: 597, column: 23, scope: !135, inlinedAt: !117)
!135 = distinct !DILexicalBlock(scope: !93, file: !94, line: 596, column: 2)
!136 = !DILocation(line: 597, column: 3, scope: !135, inlinedAt: !117)
!137 = !DILocation(line: 10, column: 12, scope: !138)
!138 = distinct !DILexicalBlock(scope: !42, file: !11, line: 10, column: 8)
!139 = !DILocation(line: 10, column: 39, scope: !138)
!140 = !DILocation(line: 10, column: 23, scope: !138)
!141 = !DILocation(line: 20, column: 8, scope: !121)
!142 = !DILocalVariable(name: "dir", scope: !143, file: !11, line: 22, type: !49, align: 8)
!143 = distinct !DILexicalBlock(scope: !121, file: !11, line: 21, column: 4)
!144 = !DILocation(line: 22, column: 5, scope: !143)
!145 = !DILocation(line: 22, column: 19, scope: !143)
!146 = !DILocation(line: 5, column: 11, scope: !143)
!147 = !DILocation(line: 597, column: 23, scope: !148, inlinedAt: !117)
!148 = distinct !DILexicalBlock(scope: !93, file: !94, line: 596, column: 2)
!149 = !DILocation(line: 597, column: 3, scope: !148, inlinedAt: !117)
!150 = !DILocation(line: 10, column: 12, scope: !151)
!151 = distinct !DILexicalBlock(scope: !42, file: !11, line: 10, column: 8)
!152 = !DILocation(line: 10, column: 39, scope: !151)
!153 = !DILocation(line: 10, column: 23, scope: !151)
!154 = !DILocation(line: 597, column: 23, scope: !155, inlinedAt: !117)
!155 = distinct !DILexicalBlock(scope: !93, file: !94, line: 596, column: 2)
!156 = !DILocation(line: 597, column: 3, scope: !155, inlinedAt: !117)
!157 = !DILocation(line: 25, column: 21, scope: !121)
!158 = !DILocation(line: 25, column: 8, scope: !121)
!159 = !DILocation(line: 597, column: 23, scope: !160, inlinedAt: !117)
!160 = distinct !DILexicalBlock(scope: !93, file: !94, line: 596, column: 2)
!161 = !DILocation(line: 597, column: 3, scope: !160, inlinedAt: !117)
!162 = !DILocation(line: 10, column: 12, scope: !163)
!163 = distinct !DILexicalBlock(scope: !42, file: !11, line: 10, column: 8)
!164 = !DILocation(line: 10, column: 39, scope: !163)
!165 = !DILocation(line: 10, column: 23, scope: !163)
!166 = !DILocation(line: 597, column: 23, scope: !167, inlinedAt: !117)
!167 = distinct !DILexicalBlock(scope: !93, file: !94, line: 596, column: 2)
!168 = !DILocation(line: 597, column: 3, scope: !167, inlinedAt: !117)
!169 = !DILocation(line: 11, column: 22, scope: !170, inlinedAt: !171)
!170 = distinct !DISubprogram(name: "native_rmdir", linkageName: "native_rmdir", scope: !8, file: !8, line: 7, scopeLine: 7, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!171 = !DILocation(line: 32, column: 2, scope: !42)
!172 = !DILocation(line: 11, column: 8, scope: !170, inlinedAt: !171)
!173 = !DILocation(line: 11, column: 46, scope: !170, inlinedAt: !171)
!174 = !DILocation(line: 12, column: 12, scope: !175, inlinedAt: !171)
!175 = distinct !DILexicalBlock(scope: !170, file: !8, line: 12, column: 4)
!176 = !DILocation(line: 14, column: 31, scope: !177, inlinedAt: !171)
!177 = distinct !DILexicalBlock(scope: !175, file: !8, line: 14, column: 24)
!178 = !DILocation(line: 18, column: 32, scope: !179, inlinedAt: !171)
!179 = distinct !DILexicalBlock(scope: !175, file: !8, line: 18, column: 25)
!180 = !DILocation(line: 19, column: 38, scope: !181, inlinedAt: !171)
!181 = distinct !DILexicalBlock(scope: !175, file: !8, line: 19, column: 31)
!182 = !DILocation(line: 21, column: 32, scope: !183, inlinedAt: !171)
!183 = distinct !DILexicalBlock(scope: !175, file: !8, line: 21, column: 25)
!184 = !DILocation(line: 22, column: 35, scope: !185, inlinedAt: !171)
!185 = distinct !DILexicalBlock(scope: !175, file: !8, line: 22, column: 28)
!186 = !DILocation(line: 23, column: 31, scope: !187, inlinedAt: !171)
!187 = distinct !DILexicalBlock(scope: !175, file: !8, line: 23, column: 24)
!188 = !DILocation(line: 24, column: 21, scope: !189, inlinedAt: !171)
!189 = distinct !DILexicalBlock(scope: !175, file: !8, line: 24, column: 14)
!190 = !DILocation(line: 10, column: 12, scope: !191)
!191 = distinct !DILexicalBlock(scope: !42, file: !11, line: 10, column: 8)
!192 = !DILocation(line: 10, column: 39, scope: !191)
!193 = !DILocation(line: 10, column: 23, scope: !191)
!194 = !DILocation(line: 10, column: 12, scope: !195)
!195 = distinct !DILexicalBlock(scope: !42, file: !11, line: 10, column: 8)
!196 = !DILocation(line: 10, column: 39, scope: !195)
!197 = !DILocation(line: 10, column: 23, scope: !195)
!198 = distinct !DISubprogram(name: "native_fopen", linkageName: "std.io.os.native_fopen", scope: !37, file: !37, line: 8, type: !199, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !47)
!199 = !DISubroutineType(types: !200)
!200 = !{!45, !201, !15, !15}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!202 = !DILocalVariable(name: "filename", arg: 1, scope: !198, file: !37, line: 8, type: !15)
!203 = !DILocation(line: 8, column: 31, scope: !198)
!204 = !DILocalVariable(name: "mode", arg: 2, scope: !198, file: !37, line: 8, type: !15)
!205 = !DILocation(line: 8, column: 48, scope: !198)
!206 = !DILocation(line: 5, column: 11, scope: !207)
!207 = distinct !DILexicalBlock(scope: !198, file: !37, line: 8, column: 65)
!208 = !DILocation(line: 6, column: 11, scope: !207)
!209 = !DILocalVariable(name: "state", scope: !210, file: !37, line: 594, type: !95, align: 8)
!210 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !94, file: !94, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !47)
!211 = !DILocation(line: 594, column: 12, scope: !210, inlinedAt: !212)
!212 = !DILocation(line: 8, column: 65, scope: !198)
!213 = !DILocation(line: 594, column: 20, scope: !210, inlinedAt: !212)
!214 = !DILocalVariable(name: "file", scope: !215, file: !37, line: 13, type: !29, align: 8)
!215 = distinct !DILexicalBlock(scope: !198, file: !37, line: 9, column: 1)
!216 = !DILocation(line: 13, column: 9, scope: !215)
!217 = !DILocation(line: 13, column: 28, scope: !215)
!218 = !DILocation(line: 13, column: 51, scope: !215)
!219 = !DILocation(line: 13, column: 16, scope: !215)
!220 = !DILocation(line: 15, column: 10, scope: !215)
!221 = !DILocation(line: 81, column: 10, scope: !222, inlinedAt: !224)
!222 = distinct !DILexicalBlock(scope: !223, file: !37, line: 81, column: 2)
!223 = distinct !DISubprogram(name: "file_open_errno", linkageName: "file_open_errno", scope: !37, file: !37, line: 79, scopeLine: 79, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!224 = !DILocation(line: 15, column: 18, scope: !215)
!225 = !DILocation(line: 83, column: 30, scope: !226, inlinedAt: !224)
!226 = distinct !DILexicalBlock(scope: !222, file: !37, line: 83, column: 23)
!227 = !DILocation(line: 84, column: 30, scope: !228, inlinedAt: !224)
!228 = distinct !DILexicalBlock(scope: !222, file: !37, line: 84, column: 23)
!229 = !DILocation(line: 85, column: 29, scope: !230, inlinedAt: !224)
!230 = distinct !DILexicalBlock(scope: !222, file: !37, line: 85, column: 22)
!231 = !DILocation(line: 86, column: 30, scope: !232, inlinedAt: !224)
!232 = distinct !DILexicalBlock(scope: !222, file: !37, line: 86, column: 23)
!233 = !DILocation(line: 87, column: 29, scope: !234, inlinedAt: !224)
!234 = distinct !DILexicalBlock(scope: !222, file: !37, line: 87, column: 22)
!235 = !DILocation(line: 88, column: 30, scope: !236, inlinedAt: !224)
!236 = distinct !DILexicalBlock(scope: !222, file: !37, line: 88, column: 23)
!237 = !DILocation(line: 89, column: 30, scope: !238, inlinedAt: !224)
!238 = distinct !DILexicalBlock(scope: !222, file: !37, line: 89, column: 23)
!239 = !DILocation(line: 90, column: 29, scope: !240, inlinedAt: !224)
!240 = distinct !DILexicalBlock(scope: !222, file: !37, line: 90, column: 22)
!241 = !DILocation(line: 91, column: 30, scope: !242, inlinedAt: !224)
!242 = distinct !DILexicalBlock(scope: !222, file: !37, line: 91, column: 23)
!243 = !DILocation(line: 92, column: 36, scope: !244, inlinedAt: !224)
!244 = distinct !DILexicalBlock(scope: !222, file: !37, line: 92, column: 29)
!245 = !DILocation(line: 93, column: 30, scope: !246, inlinedAt: !224)
!246 = distinct !DILexicalBlock(scope: !222, file: !37, line: 93, column: 23)
!247 = !DILocation(line: 94, column: 31, scope: !248, inlinedAt: !224)
!248 = distinct !DILexicalBlock(scope: !222, file: !37, line: 94, column: 24)
!249 = !DILocation(line: 95, column: 30, scope: !250, inlinedAt: !224)
!250 = distinct !DILexicalBlock(scope: !222, file: !37, line: 95, column: 23)
!251 = !DILocation(line: 96, column: 30, scope: !252, inlinedAt: !224)
!252 = distinct !DILexicalBlock(scope: !222, file: !37, line: 96, column: 23)
!253 = !DILocation(line: 97, column: 29, scope: !254, inlinedAt: !224)
!254 = distinct !DILexicalBlock(scope: !222, file: !37, line: 97, column: 22)
!255 = !DILocation(line: 98, column: 33, scope: !256, inlinedAt: !224)
!256 = distinct !DILexicalBlock(scope: !222, file: !37, line: 98, column: 26)
!257 = !DILocation(line: 99, column: 29, scope: !258, inlinedAt: !224)
!258 = distinct !DILexicalBlock(scope: !222, file: !37, line: 99, column: 22)
!259 = !DILocation(line: 100, column: 34, scope: !260, inlinedAt: !224)
!260 = distinct !DILexicalBlock(scope: !222, file: !37, line: 100, column: 27)
!261 = !DILocation(line: 101, column: 27, scope: !262, inlinedAt: !224)
!262 = distinct !DILexicalBlock(scope: !222, file: !37, line: 101, column: 20)
!263 = !DILocation(line: 102, column: 35, scope: !264, inlinedAt: !224)
!264 = distinct !DILexicalBlock(scope: !222, file: !37, line: 102, column: 28)
!265 = !DILocation(line: 103, column: 19, scope: !266, inlinedAt: !224)
!266 = distinct !DILexicalBlock(scope: !222, file: !37, line: 103, column: 12)
!267 = !DILocation(line: 597, column: 23, scope: !268, inlinedAt: !212)
!268 = distinct !DILexicalBlock(scope: !210, file: !94, line: 596, column: 2)
!269 = !DILocation(line: 597, column: 3, scope: !268, inlinedAt: !212)
!270 = !DILocation(line: 597, column: 23, scope: !271, inlinedAt: !212)
!271 = distinct !DILexicalBlock(scope: !210, file: !94, line: 596, column: 2)
!272 = !DILocation(line: 597, column: 3, scope: !271, inlinedAt: !212)
!273 = distinct !DISubprogram(name: "native_remove", linkageName: "std.io.os.native_remove", scope: !37, file: !37, line: 18, type: !274, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !47)
!274 = !DISubroutineType(types: !275)
!275 = !{!45, !29, !15}
!276 = !DILocalVariable(name: "filename", arg: 1, scope: !273, file: !37, line: 18, type: !15)
!277 = !DILocation(line: 18, column: 31, scope: !273)
!278 = !DILocalVariable(name: "state", scope: !279, file: !37, line: 594, type: !95, align: 8)
!279 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !94, file: !94, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !47)
!280 = !DILocation(line: 594, column: 12, scope: !279, inlinedAt: !281)
!281 = !DILocation(line: 18, column: 44, scope: !273)
!282 = !DILocation(line: 594, column: 20, scope: !279, inlinedAt: !281)
!283 = !DILocalVariable(name: "result", scope: !284, file: !37, line: 23, type: !285, align: 4)
!284 = distinct !DILexicalBlock(scope: !273, file: !37, line: 19, column: 1)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !77, file: !77, line: 21, baseType: !32, align: 4)
!286 = !DILocation(line: 23, column: 8, scope: !284)
!287 = !DILocation(line: 23, column: 30, scope: !284)
!288 = !DILocation(line: 23, column: 17, scope: !284)
!289 = !DILocation(line: 25, column: 6, scope: !284)
!290 = !DILocation(line: 27, column: 11, scope: !291)
!291 = distinct !DILexicalBlock(scope: !292, file: !37, line: 27, column: 3)
!292 = distinct !DILexicalBlock(scope: !284, file: !37, line: 26, column: 2)
!293 = !DILocation(line: 597, column: 23, scope: !294, inlinedAt: !281)
!294 = distinct !DILexicalBlock(scope: !279, file: !94, line: 596, column: 2)
!295 = !DILocation(line: 597, column: 3, scope: !294, inlinedAt: !281)
!296 = !DILocation(line: 597, column: 23, scope: !297, inlinedAt: !281)
!297 = distinct !DILexicalBlock(scope: !279, file: !94, line: 596, column: 2)
!298 = !DILocation(line: 597, column: 3, scope: !297, inlinedAt: !281)
!299 = !DILocation(line: 597, column: 23, scope: !300, inlinedAt: !281)
!300 = distinct !DILexicalBlock(scope: !279, file: !94, line: 596, column: 2)
!301 = !DILocation(line: 597, column: 3, scope: !300, inlinedAt: !281)
!302 = distinct !DISubprogram(name: "native_freopen", linkageName: "std.io.os.native_freopen", scope: !37, file: !37, line: 42, type: !303, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !47)
!303 = !DISubroutineType(types: !304)
!304 = !{!45, !201, !29, !15, !15}
!305 = !DILocalVariable(name: "file", arg: 1, scope: !302, file: !37, line: 42, type: !29)
!306 = !DILocation(line: 42, column: 32, scope: !302)
!307 = !DILocalVariable(name: "filename", arg: 2, scope: !302, file: !37, line: 42, type: !15)
!308 = !DILocation(line: 42, column: 45, scope: !302)
!309 = !DILocalVariable(name: "mode", arg: 3, scope: !302, file: !37, line: 42, type: !15)
!310 = !DILocation(line: 42, column: 62, scope: !302)
!311 = !DILocation(line: 39, column: 11, scope: !312)
!312 = distinct !DILexicalBlock(scope: !302, file: !37, line: 42, column: 79)
!313 = !DILocation(line: 40, column: 11, scope: !312)
!314 = !DILocalVariable(name: "state", scope: !315, file: !37, line: 594, type: !95, align: 8)
!315 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !94, file: !94, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !47)
!316 = !DILocation(line: 594, column: 12, scope: !315, inlinedAt: !317)
!317 = !DILocation(line: 42, column: 79, scope: !302)
!318 = !DILocation(line: 594, column: 20, scope: !315, inlinedAt: !317)
!319 = !DILocation(line: 47, column: 24, scope: !320)
!320 = distinct !DILexicalBlock(scope: !302, file: !37, line: 43, column: 1)
!321 = !DILocation(line: 47, column: 47, scope: !320)
!322 = !DILocation(line: 47, column: 66, scope: !320)
!323 = !DILocation(line: 47, column: 10, scope: !320)
!324 = !DILocation(line: 49, column: 10, scope: !320)
!325 = !DILocation(line: 81, column: 10, scope: !326, inlinedAt: !328)
!326 = distinct !DILexicalBlock(scope: !327, file: !37, line: 81, column: 2)
!327 = distinct !DISubprogram(name: "file_open_errno", linkageName: "file_open_errno", scope: !37, file: !37, line: 79, scopeLine: 79, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!328 = !DILocation(line: 49, column: 18, scope: !320)
!329 = !DILocation(line: 83, column: 30, scope: !330, inlinedAt: !328)
!330 = distinct !DILexicalBlock(scope: !326, file: !37, line: 83, column: 23)
!331 = !DILocation(line: 84, column: 30, scope: !332, inlinedAt: !328)
!332 = distinct !DILexicalBlock(scope: !326, file: !37, line: 84, column: 23)
!333 = !DILocation(line: 85, column: 29, scope: !334, inlinedAt: !328)
!334 = distinct !DILexicalBlock(scope: !326, file: !37, line: 85, column: 22)
!335 = !DILocation(line: 86, column: 30, scope: !336, inlinedAt: !328)
!336 = distinct !DILexicalBlock(scope: !326, file: !37, line: 86, column: 23)
!337 = !DILocation(line: 87, column: 29, scope: !338, inlinedAt: !328)
!338 = distinct !DILexicalBlock(scope: !326, file: !37, line: 87, column: 22)
!339 = !DILocation(line: 88, column: 30, scope: !340, inlinedAt: !328)
!340 = distinct !DILexicalBlock(scope: !326, file: !37, line: 88, column: 23)
!341 = !DILocation(line: 89, column: 30, scope: !342, inlinedAt: !328)
!342 = distinct !DILexicalBlock(scope: !326, file: !37, line: 89, column: 23)
!343 = !DILocation(line: 90, column: 29, scope: !344, inlinedAt: !328)
!344 = distinct !DILexicalBlock(scope: !326, file: !37, line: 90, column: 22)
!345 = !DILocation(line: 91, column: 30, scope: !346, inlinedAt: !328)
!346 = distinct !DILexicalBlock(scope: !326, file: !37, line: 91, column: 23)
!347 = !DILocation(line: 92, column: 36, scope: !348, inlinedAt: !328)
!348 = distinct !DILexicalBlock(scope: !326, file: !37, line: 92, column: 29)
!349 = !DILocation(line: 93, column: 30, scope: !350, inlinedAt: !328)
!350 = distinct !DILexicalBlock(scope: !326, file: !37, line: 93, column: 23)
!351 = !DILocation(line: 94, column: 31, scope: !352, inlinedAt: !328)
!352 = distinct !DILexicalBlock(scope: !326, file: !37, line: 94, column: 24)
!353 = !DILocation(line: 95, column: 30, scope: !354, inlinedAt: !328)
!354 = distinct !DILexicalBlock(scope: !326, file: !37, line: 95, column: 23)
!355 = !DILocation(line: 96, column: 30, scope: !356, inlinedAt: !328)
!356 = distinct !DILexicalBlock(scope: !326, file: !37, line: 96, column: 23)
!357 = !DILocation(line: 97, column: 29, scope: !358, inlinedAt: !328)
!358 = distinct !DILexicalBlock(scope: !326, file: !37, line: 97, column: 22)
!359 = !DILocation(line: 98, column: 33, scope: !360, inlinedAt: !328)
!360 = distinct !DILexicalBlock(scope: !326, file: !37, line: 98, column: 26)
!361 = !DILocation(line: 99, column: 29, scope: !362, inlinedAt: !328)
!362 = distinct !DILexicalBlock(scope: !326, file: !37, line: 99, column: 22)
!363 = !DILocation(line: 100, column: 34, scope: !364, inlinedAt: !328)
!364 = distinct !DILexicalBlock(scope: !326, file: !37, line: 100, column: 27)
!365 = !DILocation(line: 101, column: 27, scope: !366, inlinedAt: !328)
!366 = distinct !DILexicalBlock(scope: !326, file: !37, line: 101, column: 20)
!367 = !DILocation(line: 102, column: 35, scope: !368, inlinedAt: !328)
!368 = distinct !DILexicalBlock(scope: !326, file: !37, line: 102, column: 28)
!369 = !DILocation(line: 103, column: 19, scope: !370, inlinedAt: !328)
!370 = distinct !DILexicalBlock(scope: !326, file: !37, line: 103, column: 12)
!371 = !DILocation(line: 597, column: 23, scope: !372, inlinedAt: !317)
!372 = distinct !DILexicalBlock(scope: !315, file: !94, line: 596, column: 2)
!373 = !DILocation(line: 597, column: 3, scope: !372, inlinedAt: !317)
!374 = !DILocation(line: 597, column: 23, scope: !375, inlinedAt: !317)
!375 = distinct !DILexicalBlock(scope: !315, file: !94, line: 596, column: 2)
!376 = !DILocation(line: 597, column: 3, scope: !375, inlinedAt: !317)
!377 = distinct !DISubprogram(name: "native_fseek", linkageName: "std.io.os.native_fseek", scope: !37, file: !37, line: 52, type: !378, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !47)
!378 = !DISubroutineType(types: !379)
!379 = !{!45, !29, !29, !46, !36}
!380 = !DILocalVariable(name: "file", arg: 1, scope: !377, file: !37, line: 52, type: !29)
!381 = !DILocation(line: 52, column: 29, scope: !377)
!382 = !DILocalVariable(name: "offset", arg: 2, scope: !377, file: !37, line: 52, type: !383)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !46)
!384 = !DILocation(line: 52, column: 39, scope: !377)
!385 = !DILocalVariable(name: "seek_mode", arg: 3, scope: !377, file: !37, line: 52, type: !36)
!386 = !DILocation(line: 52, column: 52, scope: !377)
!387 = !DILocation(line: 54, column: 43, scope: !377)
!388 = !DILocation(line: 54, column: 6, scope: !377)
!389 = !DILocation(line: 109, column: 10, scope: !390, inlinedAt: !392)
!390 = distinct !DILexicalBlock(scope: !391, file: !37, line: 109, column: 2)
!391 = distinct !DISubprogram(name: "file_seek_errno", linkageName: "file_seek_errno", scope: !37, file: !37, line: 107, scopeLine: 107, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!392 = !DILocation(line: 54, column: 70, scope: !377)
!393 = !DILocation(line: 111, column: 30, scope: !394, inlinedAt: !392)
!394 = distinct !DILexicalBlock(scope: !390, file: !37, line: 111, column: 23)
!395 = !DILocation(line: 112, column: 29, scope: !396, inlinedAt: !392)
!396 = distinct !DILexicalBlock(scope: !390, file: !37, line: 112, column: 22)
!397 = !DILocation(line: 113, column: 33, scope: !398, inlinedAt: !392)
!398 = distinct !DILexicalBlock(scope: !390, file: !37, line: 113, column: 26)
!399 = !DILocation(line: 114, column: 29, scope: !400, inlinedAt: !392)
!400 = distinct !DILexicalBlock(scope: !390, file: !37, line: 114, column: 22)
!401 = !DILocation(line: 115, column: 30, scope: !402, inlinedAt: !392)
!402 = distinct !DILexicalBlock(scope: !390, file: !37, line: 115, column: 23)
!403 = !DILocation(line: 116, column: 27, scope: !404, inlinedAt: !392)
!404 = distinct !DILexicalBlock(scope: !390, file: !37, line: 116, column: 20)
!405 = !DILocation(line: 117, column: 30, scope: !406, inlinedAt: !392)
!406 = distinct !DILexicalBlock(scope: !390, file: !37, line: 117, column: 23)
!407 = !DILocation(line: 118, column: 29, scope: !408, inlinedAt: !392)
!408 = distinct !DILexicalBlock(scope: !390, file: !37, line: 118, column: 22)
!409 = !DILocation(line: 119, column: 29, scope: !410, inlinedAt: !392)
!410 = distinct !DILexicalBlock(scope: !390, file: !37, line: 119, column: 22)
!411 = !DILocation(line: 120, column: 29, scope: !412, inlinedAt: !392)
!412 = distinct !DILexicalBlock(scope: !390, file: !37, line: 120, column: 22)
!413 = !DILocation(line: 121, column: 30, scope: !414, inlinedAt: !392)
!414 = distinct !DILexicalBlock(scope: !390, file: !37, line: 121, column: 23)
!415 = !DILocation(line: 122, column: 19, scope: !416, inlinedAt: !392)
!416 = distinct !DILexicalBlock(scope: !390, file: !37, line: 122, column: 12)
!417 = distinct !DISubprogram(name: "native_ftell", linkageName: "std.io.os.native_ftell", scope: !37, file: !37, line: 58, type: !418, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !47)
!418 = !DISubroutineType(types: !419)
!419 = !{!45, !420, !29}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!421 = !DILocalVariable(name: "file", arg: 1, scope: !417, file: !37, line: 58, type: !422)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !37, file: !37, line: 374, baseType: !29, align: 8)
!423 = !DILocation(line: 58, column: 28, scope: !417)
!424 = !DILocalVariable(name: "index", scope: !417, file: !37, line: 60, type: !46, align: 8)
!425 = !DILocation(line: 60, column: 7, scope: !417)
!426 = !DILocation(line: 60, column: 27, scope: !417)
!427 = !DILocation(line: 60, column: 15, scope: !417)
!428 = !DILocation(line: 61, column: 9, scope: !417)
!429 = !DILocation(line: 61, column: 22, scope: !417)
!430 = !DILocation(line: 109, column: 10, scope: !431, inlinedAt: !433)
!431 = distinct !DILexicalBlock(scope: !432, file: !37, line: 109, column: 2)
!432 = distinct !DISubprogram(name: "file_seek_errno", linkageName: "file_seek_errno", scope: !37, file: !37, line: 107, scopeLine: 107, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!433 = !DILocation(line: 61, column: 35, scope: !417)
!434 = !DILocation(line: 111, column: 30, scope: !435, inlinedAt: !433)
!435 = distinct !DILexicalBlock(scope: !431, file: !37, line: 111, column: 23)
!436 = !DILocation(line: 112, column: 29, scope: !437, inlinedAt: !433)
!437 = distinct !DILexicalBlock(scope: !431, file: !37, line: 112, column: 22)
!438 = !DILocation(line: 113, column: 33, scope: !439, inlinedAt: !433)
!439 = distinct !DILexicalBlock(scope: !431, file: !37, line: 113, column: 26)
!440 = !DILocation(line: 114, column: 29, scope: !441, inlinedAt: !433)
!441 = distinct !DILexicalBlock(scope: !431, file: !37, line: 114, column: 22)
!442 = !DILocation(line: 115, column: 30, scope: !443, inlinedAt: !433)
!443 = distinct !DILexicalBlock(scope: !431, file: !37, line: 115, column: 23)
!444 = !DILocation(line: 116, column: 27, scope: !445, inlinedAt: !433)
!445 = distinct !DILexicalBlock(scope: !431, file: !37, line: 116, column: 20)
!446 = !DILocation(line: 117, column: 30, scope: !447, inlinedAt: !433)
!447 = distinct !DILexicalBlock(scope: !431, file: !37, line: 117, column: 23)
!448 = !DILocation(line: 118, column: 29, scope: !449, inlinedAt: !433)
!449 = distinct !DILexicalBlock(scope: !431, file: !37, line: 118, column: 22)
!450 = !DILocation(line: 119, column: 29, scope: !451, inlinedAt: !433)
!451 = distinct !DILexicalBlock(scope: !431, file: !37, line: 119, column: 22)
!452 = !DILocation(line: 120, column: 29, scope: !453, inlinedAt: !433)
!453 = distinct !DILexicalBlock(scope: !431, file: !37, line: 120, column: 22)
!454 = !DILocation(line: 121, column: 30, scope: !455, inlinedAt: !433)
!455 = distinct !DILexicalBlock(scope: !431, file: !37, line: 121, column: 23)
!456 = !DILocation(line: 122, column: 19, scope: !457, inlinedAt: !433)
!457 = distinct !DILexicalBlock(scope: !431, file: !37, line: 122, column: 12)
!458 = distinct !DISubprogram(name: "native_fwrite", linkageName: "std.io.os.native_fwrite", scope: !37, file: !37, line: 64, type: !459, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !47)
!459 = !DISubroutineType(types: !460)
!460 = !{!45, !420, !29, !16}
!461 = !DILocalVariable(name: "file", arg: 1, scope: !458, file: !37, line: 64, type: !422)
!462 = !DILocation(line: 64, column: 29, scope: !458)
!463 = !DILocalVariable(name: "buffer", arg: 2, scope: !458, file: !37, line: 64, type: !16)
!464 = !DILocation(line: 64, column: 42, scope: !458)
!465 = !DILocation(line: 66, column: 22, scope: !458)
!466 = !DILocation(line: 66, column: 37, scope: !458)
!467 = !DILocation(line: 66, column: 49, scope: !458)
!468 = !DILocation(line: 66, column: 9, scope: !458)
!469 = distinct !DISubprogram(name: "native_fputc", linkageName: "std.io.os.native_fputc", scope: !37, file: !37, line: 69, type: !470, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !47)
!470 = !DISubroutineType(types: !471)
!471 = !{!45, !29, !32, !29}
!472 = !DILocalVariable(name: "c", arg: 1, scope: !469, file: !37, line: 69, type: !285)
!473 = !DILocation(line: 69, column: 28, scope: !469)
!474 = !DILocalVariable(name: "stream", arg: 2, scope: !469, file: !37, line: 69, type: !422)
!475 = !DILocation(line: 69, column: 37, scope: !469)
!476 = !DILocation(line: 71, column: 21, scope: !469)
!477 = !DILocation(line: 71, column: 6, scope: !469)
!478 = !DILocation(line: 71, column: 50, scope: !469)
!479 = distinct !DISubprogram(name: "native_fread", linkageName: "std.io.os.native_fread", scope: !37, file: !37, line: 74, type: !459, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !47)
!480 = !DILocalVariable(name: "file", arg: 1, scope: !479, file: !37, line: 74, type: !422)
!481 = !DILocation(line: 74, column: 28, scope: !479)
!482 = !DILocalVariable(name: "buffer", arg: 2, scope: !479, file: !37, line: 74, type: !16)
!483 = !DILocation(line: 74, column: 41, scope: !479)
!484 = !DILocation(line: 76, column: 21, scope: !479)
!485 = !DILocation(line: 76, column: 36, scope: !479)
!486 = !DILocation(line: 76, column: 48, scope: !479)
!487 = !DILocation(line: 76, column: 9, scope: !479)
!488 = distinct !DISubprogram(name: "native_temp_directory", linkageName: "std.io.os.native_temp_directory", scope: !50, file: !50, line: 4, type: !489, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !47)
!489 = !DISubroutineType(types: !490)
!490 = !{!45, !491, !26}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Path*", baseType: !49, size: 64, align: 64, dwarfAddressSpace: 0)
!492 = !DILocalVariable(name: "allocator", arg: 1, scope: !488, file: !50, line: 4, type: !26)
!493 = !DILocation(line: 4, column: 42, scope: !488)
!494 = !DILocalVariable(name: ".temp", scope: !495, file: !50, line: 6, type: !496, align: 16)
!495 = distinct !DILexicalBlock(scope: !488, file: !50, line: 6, column: 2)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 512, align: 64, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 4, lowerBound: 0)
!499 = !DILocation(line: 6, column: 24, scope: !495)
!500 = !DILocalVariable(name: ".temp", scope: !495, file: !50, line: 6, type: !22, align: 8)
!501 = !DILocalVariable(name: "env", scope: !502, file: !50, line: 6, type: !15, align: 8)
!502 = distinct !DILexicalBlock(scope: !495, file: !50, line: 7, column: 2)
!503 = !DILocation(line: 6, column: 18, scope: !502)
!504 = !DILocation(line: 6, column: 24, scope: !502)
!505 = !DILocalVariable(name: "tmpdir", scope: !506, file: !50, line: 8, type: !15, align: 8)
!506 = distinct !DILexicalBlock(scope: !502, file: !50, line: 7, column: 2)
!507 = !DILocation(line: 8, column: 10, scope: !506)
!508 = !DILocation(line: 8, column: 19, scope: !506)
!509 = !DILocation(line: 8, column: 41, scope: !506)
!510 = !DILocation(line: 9, column: 7, scope: !506)
!511 = !DILocation(line: 9, column: 22, scope: !506)
!512 = !DILocation(line: 11, column: 9, scope: !488)
!513 = distinct !DISubprogram(name: "native_file_or_dir_exists", linkageName: "std.io.os.native_file_or_dir_exists", scope: !77, file: !77, line: 64, type: !514, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !47)
!514 = !DISubroutineType(types: !515)
!515 = !{!111, !15}
!516 = !DILocalVariable(name: "path", arg: 1, scope: !513, file: !77, line: 64, type: !15)
!517 = !DILocation(line: 64, column: 42, scope: !513)
!518 = !DILocalVariable(name: "stat", scope: !513, file: !77, line: 73, type: !519, align: 8)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stat", scope: !77, file: !77, line: 14, size: 1152, align: 64, elements: !520, identifier: "libc.Stat")
!520 = !{!521, !523, !524, !526, !529, !531, !533, !534, !535, !536, !538, !540, !542, !543, !544, !545, !546, !547}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !519, file: !77, line: 16, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dev_t", scope: !77, file: !77, line: 9, baseType: !23, align: 8)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !519, file: !77, line: 17, baseType: !76, size: 64, align: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !519, file: !77, line: 18, baseType: !525, size: 64, align: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nlink_t", scope: !77, file: !77, line: 6, baseType: !23, align: 8)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !519, file: !77, line: 19, baseType: !527, size: 32, align: 32, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mode_t", scope: !77, file: !77, line: 10, baseType: !528, align: 4)
!528 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !519, file: !77, line: 20, baseType: !530, size: 32, align: 32, offset: 224)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uid_t", scope: !77, file: !77, line: 22, baseType: !528, align: 4)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !519, file: !77, line: 21, baseType: !532, size: 32, align: 32, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gid_t", scope: !77, file: !77, line: 23, baseType: !528, align: 4)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !519, file: !77, line: 22, baseType: !285, size: 32, align: 32, offset: 288)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !519, file: !77, line: 23, baseType: !522, size: 64, align: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !519, file: !77, line: 24, baseType: !79, size: 64, align: 64, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !519, file: !77, line: 25, baseType: !537, size: 64, align: 64, offset: 448)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "Blksize_t", scope: !77, file: !77, line: 5, baseType: !46, align: 8)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !519, file: !77, line: 26, baseType: !539, size: 64, align: 64, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "Blkcnt_t", scope: !77, file: !77, line: 7, baseType: !46, align: 8)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "st_atime", scope: !519, file: !77, line: 27, baseType: !541, size: 64, align: 64, offset: 576)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time_t", scope: !77, file: !77, line: 79, baseType: !46, align: 8)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "st_atime_nsec", scope: !519, file: !77, line: 28, baseType: !46, size: 64, align: 64, offset: 640)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtime", scope: !519, file: !77, line: 29, baseType: !541, size: 64, align: 64, offset: 704)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtime_nsec", scope: !519, file: !77, line: 30, baseType: !46, size: 64, align: 64, offset: 768)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctime", scope: !519, file: !77, line: 31, baseType: !541, size: 64, align: 64, offset: 832)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctime_nsec", scope: !519, file: !77, line: 32, baseType: !46, size: 64, align: 64, offset: 896)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !519, file: !77, line: 33, baseType: !548, size: 192, align: 64, offset: 960)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 192, align: 64, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 3, lowerBound: 0)
!551 = !DILocation(line: 73, column: 9, scope: !513)
!552 = !DILocation(line: 74, column: 34, scope: !553, inlinedAt: !555)
!553 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !554, file: !554, line: 404, scopeLine: 404, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!554 = !DIFile(filename: "builtin.c3", directory: "/usr/lib/c3c/lib/std/core")
!555 = !DILocation(line: 74, column: 11, scope: !513)
!556 = !DILocation(line: 406, column: 12, scope: !553, inlinedAt: !555)
!557 = !DILocation(line: 406, column: 26, scope: !553, inlinedAt: !555)
!558 = !DILocation(line: 407, column: 9, scope: !553, inlinedAt: !555)
!559 = distinct !DISubprogram(name: "native_is_file", linkageName: "std.io.os.native_is_file", scope: !77, file: !77, line: 90, type: !514, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !47)
!560 = !DILocalVariable(name: "path", arg: 1, scope: !559, file: !77, line: 90, type: !15)
!561 = !DILocation(line: 90, column: 31, scope: !559)
!562 = !DILocalVariable(name: "stat", scope: !559, file: !77, line: 99, type: !519, align: 8)
!563 = !DILocation(line: 99, column: 9, scope: !559)
!564 = !DILocation(line: 100, column: 34, scope: !565, inlinedAt: !566)
!565 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !554, file: !554, line: 404, scopeLine: 404, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!566 = !DILocation(line: 100, column: 11, scope: !559)
!567 = !DILocation(line: 406, column: 12, scope: !565, inlinedAt: !566)
!568 = !DILocation(line: 406, column: 26, scope: !565, inlinedAt: !566)
!569 = !DILocation(line: 407, column: 9, scope: !565, inlinedAt: !566)
!570 = !DILocation(line: 100, column: 58, scope: !559)
!571 = !DILocation(line: 392, column: 52, scope: !572, inlinedAt: !574)
!572 = distinct !DISubprogram(name: "libc_S_ISTYPE", linkageName: "libc_S_ISTYPE", scope: !573, file: !573, line: 392, scopeLine: 392, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!573 = !DIFile(filename: "libc.c3", directory: "/usr/lib/c3c/lib/std/libc")
!574 = !DILocation(line: 100, column: 44, scope: !559)
!575 = !DILocation(line: 392, column: 71, scope: !572, inlinedAt: !574)
!576 = distinct !DISubprogram(name: "native_is_dir", linkageName: "std.io.os.native_is_dir", scope: !77, file: !77, line: 108, type: !514, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !47)
!577 = !DILocalVariable(name: "path", arg: 1, scope: !576, file: !77, line: 108, type: !15)
!578 = !DILocation(line: 108, column: 30, scope: !576)
!579 = !DILocalVariable(name: "stat", scope: !576, file: !77, line: 111, type: !519, align: 8)
!580 = !DILocation(line: 111, column: 8, scope: !576)
!581 = !DILocation(line: 112, column: 33, scope: !582, inlinedAt: !583)
!582 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !554, file: !554, line: 404, scopeLine: 404, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!583 = !DILocation(line: 112, column: 10, scope: !576)
!584 = !DILocation(line: 406, column: 12, scope: !582, inlinedAt: !583)
!585 = !DILocation(line: 406, column: 26, scope: !582, inlinedAt: !583)
!586 = !DILocation(line: 407, column: 9, scope: !582, inlinedAt: !583)
!587 = !DILocation(line: 112, column: 57, scope: !576)
!588 = !DILocation(line: 392, column: 52, scope: !589, inlinedAt: !590)
!589 = distinct !DISubprogram(name: "libc_S_ISTYPE", linkageName: "libc_S_ISTYPE", scope: !573, file: !573, line: 392, scopeLine: 392, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!590 = !DILocation(line: 112, column: 43, scope: !576)
!591 = !DILocation(line: 392, column: 71, scope: !589, inlinedAt: !590)
!592 = distinct !DISubprogram(name: "native_stat", linkageName: "std.io.os.native_stat", scope: !77, file: !77, line: 4, type: !593, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !47)
!593 = !DISubroutineType(types: !594)
!594 = !{!45, !29, !595, !15}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Stat*", baseType: !519, size: 64, align: 64, dwarfAddressSpace: 0)
!596 = !DILocalVariable(name: "stat", arg: 1, scope: !592, file: !77, line: 4, type: !595)
!597 = !DILocation(line: 4, column: 28, scope: !592)
!598 = !DILocalVariable(name: "path", arg: 2, scope: !592, file: !77, line: 4, type: !15)
!599 = !DILocation(line: 4, column: 41, scope: !592)
!600 = !DILocalVariable(name: "state", scope: !601, file: !77, line: 594, type: !95, align: 8)
!601 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !94, file: !94, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !47)
!602 = !DILocation(line: 594, column: 12, scope: !601, inlinedAt: !603)
!603 = !DILocation(line: 4, column: 116, scope: !592)
!604 = !DILocation(line: 594, column: 20, scope: !601, inlinedAt: !603)
!605 = !DILocalVariable(name: "res", scope: !606, file: !77, line: 7, type: !32, align: 4)
!606 = distinct !DILexicalBlock(scope: !592, file: !77, line: 5, column: 1)
!607 = !DILocation(line: 7, column: 7, scope: !606)
!608 = !DILocation(line: 7, column: 24, scope: !606)
!609 = !DILocation(line: 7, column: 43, scope: !606)
!610 = !DILocation(line: 7, column: 13, scope: !606)
!611 = !DILocation(line: 12, column: 6, scope: !606)
!612 = !DILocation(line: 14, column: 11, scope: !613)
!613 = distinct !DILexicalBlock(scope: !614, file: !77, line: 14, column: 3)
!614 = distinct !DILexicalBlock(scope: !606, file: !77, line: 13, column: 2)
!615 = !DILocation(line: 597, column: 23, scope: !616, inlinedAt: !603)
!616 = distinct !DILexicalBlock(scope: !601, file: !94, line: 596, column: 2)
!617 = !DILocation(line: 597, column: 3, scope: !616, inlinedAt: !603)
!618 = !DILocation(line: 206, column: 33, scope: !619, inlinedAt: !620)
!619 = distinct !DISubprogram(name: "unreachable", linkageName: "unreachable", scope: !554, file: !554, line: 203, scopeLine: 203, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!620 = !DILocation(line: 19, column: 5, scope: !621)
!621 = distinct !DILexicalBlock(scope: !613, file: !77, line: 19, column: 5)
!622 = !DILocation(line: 206, column: 2, scope: !619, inlinedAt: !620)
!623 = !DILocation(line: 208, column: 2, scope: !619, inlinedAt: !620)
!624 = !DILocation(line: 597, column: 23, scope: !625, inlinedAt: !603)
!625 = distinct !DILexicalBlock(scope: !601, file: !94, line: 596, column: 2)
!626 = !DILocation(line: 597, column: 3, scope: !625, inlinedAt: !603)
!627 = !DILocation(line: 597, column: 23, scope: !628, inlinedAt: !603)
!628 = distinct !DILexicalBlock(scope: !601, file: !94, line: 596, column: 2)
!629 = !DILocation(line: 597, column: 3, scope: !628, inlinedAt: !603)
!630 = !DILocation(line: 597, column: 23, scope: !631, inlinedAt: !603)
!631 = distinct !DILexicalBlock(scope: !601, file: !94, line: 596, column: 2)
!632 = !DILocation(line: 597, column: 3, scope: !631, inlinedAt: !603)
!633 = !DILocation(line: 597, column: 23, scope: !634, inlinedAt: !603)
!634 = distinct !DILexicalBlock(scope: !601, file: !94, line: 596, column: 2)
!635 = !DILocation(line: 597, column: 3, scope: !634, inlinedAt: !603)
!636 = !DILocation(line: 597, column: 23, scope: !637, inlinedAt: !603)
!637 = distinct !DILexicalBlock(scope: !601, file: !94, line: 596, column: 2)
!638 = !DILocation(line: 597, column: 3, scope: !637, inlinedAt: !603)
!639 = !DILocation(line: 597, column: 23, scope: !640, inlinedAt: !603)
!640 = distinct !DILexicalBlock(scope: !601, file: !94, line: 596, column: 2)
!641 = !DILocation(line: 597, column: 3, scope: !640, inlinedAt: !603)
!642 = !DILocation(line: 597, column: 23, scope: !643, inlinedAt: !603)
!643 = distinct !DILexicalBlock(scope: !601, file: !94, line: 596, column: 2)
!644 = !DILocation(line: 597, column: 3, scope: !643, inlinedAt: !603)
!645 = !DILocation(line: 597, column: 23, scope: !646, inlinedAt: !603)
!646 = distinct !DILexicalBlock(scope: !601, file: !94, line: 596, column: 2)
!647 = !DILocation(line: 597, column: 3, scope: !646, inlinedAt: !603)
!648 = !DILocation(line: 597, column: 23, scope: !649, inlinedAt: !603)
!649 = distinct !DILexicalBlock(scope: !601, file: !94, line: 596, column: 2)
!650 = !DILocation(line: 597, column: 3, scope: !649, inlinedAt: !603)
!651 = distinct !DISubprogram(name: "native_file_size", linkageName: "std.io.os.native_file_size", scope: !77, file: !77, line: 50, type: !652, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !47)
!652 = !DISubroutineType(types: !653)
!653 = !{!45, !654, !15}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ulong*", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!655 = !DILocalVariable(name: "path", arg: 1, scope: !651, file: !77, line: 50, type: !15)
!656 = !DILocation(line: 50, column: 33, scope: !651)
!657 = !DILocalVariable(name: "f", scope: !651, file: !77, line: 52, type: !658, align: 8)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !77, file: !77, line: 4, size: 64, align: 64, elements: !659, identifier: "std.io.File")
!659 = !{!660}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !658, file: !77, line: 6, baseType: !422, size: 64, align: 64)
!661 = !DILocation(line: 52, column: 7, scope: !651)
!662 = !DILocation(line: 52, column: 11, scope: !651)
!663 = !DILocation(line: 62, column: 11, scope: !651)
!664 = !DILocation(line: 54, column: 9, scope: !651)
!665 = !DILocation(line: 53, column: 8, scope: !666)
!666 = distinct !DILexicalBlock(scope: !651, file: !77, line: 53, column: 8)
!667 = !DILocation(line: 53, column: 8, scope: !668)
!668 = distinct !DILexicalBlock(scope: !651, file: !77, line: 53, column: 8)
!669 = distinct !DISubprogram(name: "native_ls", linkageName: "std.io.os.native_ls", scope: !670, file: !670, line: 4, type: !671, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !47)
!670 = !DIFile(filename: "ls.c3", directory: "/usr/lib/c3c/lib/std/io/os")
!671 = !DISubroutineType(types: !672)
!672 = !{!45, !673, !12, !111, !111, !15, !26}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PathList*", baseType: !674, size: 64, align: 64, dwarfAddressSpace: 0)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathList", scope: !670, file: !670, line: 10, baseType: !675, align: 8)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !670, file: !670, line: 18, size: 320, align: 64, elements: !676, identifier: "std_collections_list$std.io.path.PathImp$.List")
!676 = !{!677, !678, !679, !680}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !675, file: !670, line: 20, baseType: !22, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !675, file: !670, line: 21, baseType: !22, size: 64, align: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !675, file: !670, line: 22, baseType: !26, size: 128, align: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !675, file: !670, line: 23, baseType: !681, size: 64, align: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !682, size: 64, align: 64, dwarfAddressSpace: 0)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !670, file: !670, line: 10, baseType: !12, align: 8)
!683 = !DILocalVariable(name: "dir", arg: 1, scope: !669, file: !670, line: 4, type: !49)
!684 = !DILocation(line: 4, column: 29, scope: !669)
!685 = !DILocalVariable(name: "no_dirs", arg: 2, scope: !669, file: !670, line: 4, type: !111)
!686 = !DILocation(line: 4, column: 39, scope: !669)
!687 = !DILocalVariable(name: "no_symlinks", arg: 3, scope: !669, file: !670, line: 4, type: !111)
!688 = !DILocation(line: 4, column: 53, scope: !669)
!689 = !DILocalVariable(name: "mask", arg: 4, scope: !669, file: !670, line: 4, type: !15)
!690 = !DILocation(line: 4, column: 73, scope: !669)
!691 = !DILocalVariable(name: "allocator", arg: 5, scope: !669, file: !670, line: 4, type: !26)
!692 = !DILocation(line: 4, column: 89, scope: !669)
!693 = !DILocalVariable(name: "list", scope: !669, file: !670, line: 6, type: !674, align: 8)
!694 = !DILocation(line: 6, column: 11, scope: !669)
!695 = !DILocation(line: 30, column: 71, scope: !696, inlinedAt: !698)
!696 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !697, file: !697, line: 30, scopeLine: 30, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!697 = !DIFile(filename: "list.c3", directory: "/usr/lib/c3c/lib/std/collections")
!698 = !DILocation(line: 7, column: 2, scope: !669)
!699 = !DILocalVariable(name: "directory", scope: !669, file: !670, line: 8, type: !55, align: 8)
!700 = !DILocation(line: 8, column: 9, scope: !669)
!701 = !DILocation(line: 8, column: 36, scope: !669)
!702 = !DILocation(line: 8, column: 53, scope: !669)
!703 = !DILocation(line: 8, column: 69, scope: !669)
!704 = !DILocation(line: 8, column: 21, scope: !669)
!705 = !DILocation(line: 10, column: 6, scope: !669)
!706 = !DILocation(line: 10, column: 26, scope: !669)
!707 = !DILocation(line: 10, column: 68, scope: !669)
!708 = !DILocation(line: 9, column: 12, scope: !709)
!709 = distinct !DILexicalBlock(scope: !669, file: !670, line: 9, column: 8)
!710 = !DILocation(line: 9, column: 39, scope: !709)
!711 = !DILocation(line: 9, column: 23, scope: !709)
!712 = !DILocalVariable(name: "entry", scope: !669, file: !670, line: 11, type: !72, align: 8)
!713 = !DILocation(line: 11, column: 16, scope: !669)
!714 = !DILocation(line: 12, column: 2, scope: !669)
!715 = !DILocation(line: 12, column: 33, scope: !716)
!716 = distinct !DILexicalBlock(scope: !669, file: !670, line: 12, column: 2)
!717 = !DILocation(line: 12, column: 18, scope: !716)
!718 = !DILocalVariable(name: "name", scope: !719, file: !670, line: 14, type: !15, align: 8)
!719 = distinct !DILexicalBlock(scope: !716, file: !670, line: 13, column: 2)
!720 = !DILocation(line: 14, column: 10, scope: !719)
!721 = !DILocation(line: 14, column: 28, scope: !719)
!722 = !DILocation(line: 14, column: 18, scope: !719)
!723 = !DILocation(line: 15, column: 8, scope: !719)
!724 = !DILocation(line: 15, column: 16, scope: !719)
!725 = !DILocation(line: 15, column: 31, scope: !719)
!726 = !DILocation(line: 15, column: 45, scope: !719)
!727 = !DILocation(line: 16, column: 7, scope: !719)
!728 = !DILocation(line: 16, column: 40, scope: !719)
!729 = !DILocation(line: 16, column: 53, scope: !719)
!730 = !DILocation(line: 17, column: 7, scope: !719)
!731 = !DILocation(line: 17, column: 40, scope: !719)
!732 = !DILocation(line: 17, column: 49, scope: !719)
!733 = !DILocalVariable(name: "path", scope: !719, file: !670, line: 18, type: !49, align: 8)
!734 = !DILocation(line: 18, column: 8, scope: !719)
!735 = !DILocation(line: 18, column: 15, scope: !719)
!736 = !DILocation(line: 19, column: 3, scope: !719)
!737 = !DILocation(line: 9, column: 12, scope: !738)
