; ModuleID = 'std::time::datetime'
source_filename = "std::time::datetime"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%TzDateTime = type { %DateTime, i32 }
%DateTime = type { i32, i8, i8, i8, i8, i8, i8, i32, i16, i64 }
%Tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, ptr }
%"any[]" = type { ptr, i64 }

$std.time.TzDateTime.format = comdat any

$std.time.DateTime.format = comdat any

$std.time.datetime.format = comdat any

$std.time.datetime.tformat = comdat any

$std.time.DateTime.to_local = comdat any

$std.time.DateTime.with_gmt_offset = comdat any

$std.time.TzDateTime.with_gmt_offset = comdat any

$std.time.DateTime.to_gmt_offset = comdat any

$std.time.TzDateTime.to_gmt_offset = comdat any

$std.time.DateTime.set_date = comdat any

$std.time.DateTime.set_time = comdat any

$std.time.DateTime.add_us = comdat any

$std.time.DateTime.sub_us = comdat any

$std.time.DateTime.add_seconds = comdat any

$std.time.DateTime.add_minutes = comdat any

$std.time.DateTime.add_hours = comdat any

$std.time.DateTime.add_days = comdat any

$std.time.DateTime.add_weeks = comdat any

$std.time.DateTime.add_years = comdat any

$std.time.DateTime.add_months = comdat any

$std.time.TzDateTime.add_us = comdat any

$std.time.TzDateTime.sub_us = comdat any


!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIE Level", i32 2}
!4 = !{i32 4, !"PIC Level", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = !{i32 2, !"frame-pointer", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !8, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, splitDebugInlining: false)
!8 = !DIFile(filename: "format.c3", directory: "/usr/lib/c3c/lib/std/time")
!9 = !{!10, !26, !54}
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Month", scope: !11, file: !8, line: 60, baseType: !20, size: 8, align: 8, elements: !41)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "DateTime", scope: !12, file: !8, line: 29, size: 256, align: 64, elements: !17, identifier: "std.time.DateTime")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "TzDateTime", scope: !8, file: !8, line: 43, size: 320, align: 64, elements: !13, identifier: "std.time.TzDateTime")
!13 = !{!14, !15}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "date_time", scope: !12, file: !8, line: 45, baseType: !11, size: 256, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "gmt_offset", scope: !12, file: !8, line: 46, baseType: !16, size: 32, align: 32, offset: 256)
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !{!18, !19, !21, !22, !23, !24, !25, !35, !36, !38}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "usec", scope: !11, file: !8, line: 31, baseType: !16, size: 32, align: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !11, file: !8, line: 32, baseType: !20, size: 8, align: 8, offset: 32)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !11, file: !8, line: 33, baseType: !20, size: 8, align: 8, offset: 40)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !11, file: !8, line: 34, baseType: !20, size: 8, align: 8, offset: 48)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !11, file: !8, line: 35, baseType: !20, size: 8, align: 8, offset: 56)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !11, file: !8, line: 36, baseType: !10, size: 8, align: 8, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "weekday", scope: !11, file: !8, line: 37, baseType: !26, size: 8, align: 8, offset: 72)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Weekday", scope: !11, file: !8, line: 49, baseType: !20, size: 8, align: 8, elements: !27)
!27 = !{!28, !29, !30, !31, !32, !33, !34}
!28 = !DIEnumerator(name: "MONDAY", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "TUESDAY", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "WEDNESDAY", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "THURSDAY", value: 3, isUnsigned: true)
!32 = !DIEnumerator(name: "FRIDAY", value: 4, isUnsigned: true)
!33 = !DIEnumerator(name: "SATURDAY", value: 5, isUnsigned: true)
!34 = !DIEnumerator(name: "SUNDAY", value: 6, isUnsigned: true)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !11, file: !8, line: 38, baseType: !16, size: 32, align: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "year_day", scope: !11, file: !8, line: 39, baseType: !37, size: 16, align: 16, offset: 128)
!37 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !11, file: !8, line: 40, baseType: !39, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time", scope: !8, file: !8, line: 4, baseType: !40, align: 8)
!40 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!42 = !DIEnumerator(name: "JANUARY", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "FEBRUARY", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "MARCH", value: 2, isUnsigned: true)
!45 = !DIEnumerator(name: "APRIL", value: 3, isUnsigned: true)
!46 = !DIEnumerator(name: "MAY", value: 4, isUnsigned: true)
!47 = !DIEnumerator(name: "JUNE", value: 5, isUnsigned: true)
!48 = !DIEnumerator(name: "JULY", value: 6, isUnsigned: true)
!49 = !DIEnumerator(name: "AUGUST", value: 7, isUnsigned: true)
!50 = !DIEnumerator(name: "SEPTEMBER", value: 8, isUnsigned: true)
!51 = !DIEnumerator(name: "OCTOBER", value: 9, isUnsigned: true)
!52 = !DIEnumerator(name: "NOVEMBER", value: 10, isUnsigned: true)
!53 = !DIEnumerator(name: "DECEMBER", value: 11, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DateTimeFormat", scope: !8, file: !8, line: 4, baseType: !16, size: 32, align: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70}
!56 = !DIEnumerator(name: "ANSIC", value: 0)
!57 = !DIEnumerator(name: "UNIXDATE", value: 1)
!58 = !DIEnumerator(name: "RUBYDATE", value: 2)
!59 = !DIEnumerator(name: "RFC822", value: 3)
!60 = !DIEnumerator(name: "RFC822Z", value: 4)
!61 = !DIEnumerator(name: "RFC850", value: 5)
!62 = !DIEnumerator(name: "RFC1123", value: 6)
!63 = !DIEnumerator(name: "RFC1123Z", value: 7)
!64 = !DIEnumerator(name: "RFC3339", value: 8)
!65 = !DIEnumerator(name: "RFC3339Z", value: 9)
!66 = !DIEnumerator(name: "RFC3339MS", value: 10)
!67 = !DIEnumerator(name: "RFC3339ZMS", value: 11)
!68 = !DIEnumerator(name: "DATETIME", value: 12)
!69 = !DIEnumerator(name: "DATEONLY", value: 13)
!70 = !DIEnumerator(name: "TIMEONLY", value: 14)
!71 = distinct !DISubprogram(name: "format", linkageName: "std.time.TzDateTime.format", scope: !8, file: !8, line: 67, type: !72, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !88)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !12, !82, !54}
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !76, identifier: "char[]")
!76 = !{!77, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !75, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !20, size: 64, align: 64, dwarfAddressSpace: 0)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !75, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !81)
!81 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !83, identifier: "Allocator")
!83 = !{!84, !86}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !82, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, baseType: !87, size: 64, align: 64, offset: 64)
!87 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!88 = !{}
!89 = !DILocalVariable(name: "self", arg: 1, scope: !71, file: !8, line: 67, type: !12)
!90 = !DILocation(line: 67, column: 29, scope: !71)
!91 = !DILocalVariable(name: "allocator", arg: 2, scope: !71, file: !8, line: 67, type: !82)
!92 = !DILocation(line: 67, column: 45, scope: !71)
!93 = !DILocalVariable(name: "dt_format", arg: 3, scope: !71, file: !8, line: 67, type: !54)
!94 = !DILocation(line: 67, column: 71, scope: !71)
!95 = !DILocation(line: 67, column: 114, scope: !71)
!96 = !DILocation(line: 67, column: 85, scope: !71)
!97 = distinct !DISubprogram(name: "format", linkageName: "std.time.DateTime.format", scope: !8, file: !8, line: 70, type: !98, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !88)
!98 = !DISubroutineType(types: !99)
!99 = !{!74, !11, !82, !54}
!100 = !DILocalVariable(name: "self", arg: 1, scope: !97, file: !8, line: 70, type: !11)
!101 = !DILocation(line: 70, column: 27, scope: !97)
!102 = !DILocalVariable(name: "allocator", arg: 2, scope: !97, file: !8, line: 70, type: !82)
!103 = !DILocation(line: 70, column: 43, scope: !97)
!104 = !DILocalVariable(name: "dt_format", arg: 3, scope: !97, file: !8, line: 70, type: !54)
!105 = !DILocation(line: 70, column: 69, scope: !97)
!106 = !DILocalVariable(name: "self", scope: !97, file: !8, line: 70, type: !11, align: 8)
!107 = !DILocation(line: 70, column: 112, scope: !97)
!108 = !DILocation(line: 70, column: 83, scope: !97)
!109 = distinct !DISubprogram(name: "format", linkageName: "std.time.datetime.format", scope: !8, file: !8, line: 23, type: !110, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !88)
!110 = !DISubroutineType(types: !111)
!111 = !{!74, !82, !54, !12}
!112 = !DILocalVariable(name: "allocator", arg: 1, scope: !109, file: !8, line: 23, type: !82)
!113 = !DILocation(line: 23, column: 28, scope: !109)
!114 = !DILocalVariable(name: "type", arg: 2, scope: !109, file: !8, line: 23, type: !54)
!115 = !DILocation(line: 23, column: 54, scope: !109)
!116 = !DILocalVariable(name: "dt", arg: 3, scope: !109, file: !8, line: 23, type: !12)
!117 = !DILocation(line: 23, column: 71, scope: !109)
!118 = !DILocation(line: 28, column: 70, scope: !119)
!119 = distinct !DILexicalBlock(scope: !120, file: !8, line: 28, column: 4)
!120 = distinct !DILexicalBlock(scope: !109, file: !8, line: 25, column: 2)
!121 = !DILocation(line: 28, column: 89, scope: !119)
!122 = !DILocation(line: 28, column: 106, scope: !119)
!123 = !DILocation(line: 28, column: 114, scope: !119)
!124 = !DILocation(line: 28, column: 123, scope: !119)
!125 = !DILocation(line: 28, column: 131, scope: !119)
!126 = !DILocation(line: 28, column: 139, scope: !119)
!127 = !DILocation(line: 28, column: 11, scope: !119)
!128 = !DILocation(line: 30, column: 74, scope: !129)
!129 = distinct !DILexicalBlock(scope: !120, file: !8, line: 30, column: 4)
!130 = !DILocation(line: 30, column: 93, scope: !129)
!131 = !DILocation(line: 30, column: 110, scope: !129)
!132 = !DILocation(line: 30, column: 118, scope: !129)
!133 = !DILocation(line: 30, column: 127, scope: !129)
!134 = !DILocation(line: 30, column: 135, scope: !129)
!135 = !DILocation(line: 30, column: 143, scope: !129)
!136 = !DILocation(line: 30, column: 11, scope: !129)
!137 = !DILocation(line: 32, column: 73, scope: !138)
!138 = distinct !DILexicalBlock(scope: !120, file: !8, line: 32, column: 4)
!139 = !DILocation(line: 32, column: 92, scope: !138)
!140 = !DILocation(line: 32, column: 109, scope: !138)
!141 = !DILocation(line: 32, column: 117, scope: !138)
!142 = !DILocation(line: 32, column: 126, scope: !138)
!143 = !DILocation(line: 32, column: 134, scope: !138)
!144 = !DILocation(line: 32, column: 164, scope: !138)
!145 = !DILocation(line: 74, column: 11, scope: !138)
!146 = !DILocation(line: 74, column: 39, scope: !138)
!147 = !DILocation(line: 32, column: 142, scope: !138)
!148 = !DILocation(line: 32, column: 180, scope: !138)
!149 = !DILocation(line: 32, column: 11, scope: !138)
!150 = !DILocalVariable(name: "self", scope: !151, file: !8, line: 34, type: !12, align: 8)
!151 = distinct !DILexicalBlock(scope: !120, file: !8, line: 34, column: 4)
!152 = !DILocation(line: 34, column: 9, scope: !151)
!153 = !DILocation(line: 35, column: 67, scope: !151)
!154 = !DILocation(line: 35, column: 75, scope: !151)
!155 = !DILocation(line: 35, column: 92, scope: !151)
!156 = !DILocation(line: 35, column: 107, scope: !151)
!157 = !DILocation(line: 35, column: 116, scope: !151)
!158 = !DILocation(line: 35, column: 11, scope: !151)
!159 = !DILocation(line: 37, column: 66, scope: !160)
!160 = distinct !DILexicalBlock(scope: !120, file: !8, line: 37, column: 4)
!161 = !DILocation(line: 37, column: 74, scope: !160)
!162 = !DILocation(line: 37, column: 91, scope: !160)
!163 = !DILocation(line: 37, column: 106, scope: !160)
!164 = !DILocation(line: 37, column: 115, scope: !160)
!165 = !DILocation(line: 37, column: 145, scope: !160)
!166 = !DILocation(line: 74, column: 11, scope: !160)
!167 = !DILocation(line: 74, column: 39, scope: !160)
!168 = !DILocation(line: 37, column: 123, scope: !160)
!169 = !DILocation(line: 37, column: 11, scope: !160)
!170 = !DILocalVariable(name: "self", scope: !171, file: !8, line: 39, type: !12, align: 8)
!171 = distinct !DILexicalBlock(scope: !120, file: !8, line: 39, column: 4)
!172 = !DILocation(line: 39, column: 9, scope: !171)
!173 = !DILocation(line: 40, column: 76, scope: !171)
!174 = !DILocation(line: 40, column: 93, scope: !171)
!175 = !DILocation(line: 40, column: 101, scope: !171)
!176 = !DILocation(line: 40, column: 118, scope: !171)
!177 = !DILocation(line: 40, column: 133, scope: !171)
!178 = !DILocation(line: 40, column: 142, scope: !171)
!179 = !DILocation(line: 40, column: 150, scope: !171)
!180 = !DILocation(line: 40, column: 11, scope: !171)
!181 = !DILocalVariable(name: "self", scope: !182, file: !8, line: 42, type: !12, align: 8)
!182 = distinct !DILexicalBlock(scope: !120, file: !8, line: 42, column: 4)
!183 = !DILocation(line: 42, column: 9, scope: !182)
!184 = !DILocation(line: 43, column: 74, scope: !182)
!185 = !DILocation(line: 43, column: 93, scope: !182)
!186 = !DILocation(line: 43, column: 101, scope: !182)
!187 = !DILocation(line: 43, column: 118, scope: !182)
!188 = !DILocation(line: 43, column: 127, scope: !182)
!189 = !DILocation(line: 43, column: 136, scope: !182)
!190 = !DILocation(line: 43, column: 144, scope: !182)
!191 = !DILocation(line: 43, column: 11, scope: !182)
!192 = !DILocation(line: 45, column: 73, scope: !193)
!193 = distinct !DILexicalBlock(scope: !120, file: !8, line: 45, column: 4)
!194 = !DILocation(line: 45, column: 92, scope: !193)
!195 = !DILocation(line: 45, column: 100, scope: !193)
!196 = !DILocation(line: 45, column: 117, scope: !193)
!197 = !DILocation(line: 45, column: 126, scope: !193)
!198 = !DILocation(line: 45, column: 135, scope: !193)
!199 = !DILocation(line: 45, column: 143, scope: !193)
!200 = !DILocation(line: 45, column: 173, scope: !193)
!201 = !DILocation(line: 74, column: 11, scope: !193)
!202 = !DILocation(line: 74, column: 39, scope: !193)
!203 = !DILocation(line: 45, column: 151, scope: !193)
!204 = !DILocation(line: 45, column: 11, scope: !193)
!205 = !DILocalVariable(name: "self", scope: !206, file: !8, line: 47, type: !12, align: 8)
!206 = distinct !DILexicalBlock(scope: !120, file: !8, line: 47, column: 4)
!207 = !DILocation(line: 47, column: 9, scope: !206)
!208 = !DILocation(line: 48, column: 71, scope: !206)
!209 = !DILocation(line: 48, column: 80, scope: !206)
!210 = !DILocation(line: 48, column: 102, scope: !206)
!211 = !DILocation(line: 48, column: 110, scope: !206)
!212 = !DILocation(line: 48, column: 119, scope: !206)
!213 = !DILocation(line: 48, column: 127, scope: !206)
!214 = !DILocation(line: 48, column: 11, scope: !206)
!215 = !DILocation(line: 50, column: 72, scope: !216)
!216 = distinct !DILexicalBlock(scope: !120, file: !8, line: 50, column: 4)
!217 = !DILocation(line: 50, column: 81, scope: !216)
!218 = !DILocation(line: 50, column: 103, scope: !216)
!219 = !DILocation(line: 50, column: 111, scope: !216)
!220 = !DILocation(line: 50, column: 120, scope: !216)
!221 = !DILocation(line: 50, column: 128, scope: !216)
!222 = !DILocation(line: 50, column: 164, scope: !216)
!223 = !DILocation(line: 84, column: 11, scope: !216)
!224 = !DILocation(line: 84, column: 39, scope: !216)
!225 = !DILocation(line: 50, column: 136, scope: !216)
!226 = !DILocation(line: 50, column: 11, scope: !216)
!227 = !DILocalVariable(name: "self", scope: !228, file: !8, line: 52, type: !12, align: 8)
!228 = distinct !DILexicalBlock(scope: !120, file: !8, line: 52, column: 4)
!229 = !DILocation(line: 52, column: 9, scope: !228)
!230 = !DILocation(line: 53, column: 74, scope: !228)
!231 = !DILocation(line: 53, column: 83, scope: !228)
!232 = !DILocation(line: 53, column: 105, scope: !228)
!233 = !DILocation(line: 53, column: 113, scope: !228)
!234 = !DILocation(line: 53, column: 122, scope: !228)
!235 = !DILocation(line: 53, column: 130, scope: !228)
!236 = !DILocation(line: 53, column: 138, scope: !228)
!237 = !DILocation(line: 53, column: 11, scope: !228)
!238 = !DILocation(line: 55, column: 75, scope: !239)
!239 = distinct !DILexicalBlock(scope: !120, file: !8, line: 55, column: 4)
!240 = !DILocation(line: 55, column: 84, scope: !239)
!241 = !DILocation(line: 55, column: 106, scope: !239)
!242 = !DILocation(line: 55, column: 114, scope: !239)
!243 = !DILocation(line: 55, column: 123, scope: !239)
!244 = !DILocation(line: 55, column: 131, scope: !239)
!245 = !DILocation(line: 55, column: 139, scope: !239)
!246 = !DILocation(line: 55, column: 176, scope: !239)
!247 = !DILocation(line: 84, column: 11, scope: !239)
!248 = !DILocation(line: 84, column: 39, scope: !239)
!249 = !DILocation(line: 55, column: 148, scope: !239)
!250 = !DILocation(line: 55, column: 11, scope: !239)
!251 = !DILocation(line: 57, column: 70, scope: !252)
!252 = distinct !DILexicalBlock(scope: !120, file: !8, line: 57, column: 4)
!253 = !DILocation(line: 57, column: 79, scope: !252)
!254 = !DILocation(line: 57, column: 101, scope: !252)
!255 = !DILocation(line: 57, column: 109, scope: !252)
!256 = !DILocation(line: 57, column: 118, scope: !252)
!257 = !DILocation(line: 57, column: 126, scope: !252)
!258 = !DILocation(line: 57, column: 11, scope: !252)
!259 = !DILocation(line: 59, column: 55, scope: !260)
!260 = distinct !DILexicalBlock(scope: !120, file: !8, line: 59, column: 4)
!261 = !DILocation(line: 59, column: 64, scope: !260)
!262 = !DILocation(line: 59, column: 86, scope: !260)
!263 = !DILocation(line: 59, column: 11, scope: !260)
!264 = !DILocation(line: 61, column: 55, scope: !265)
!265 = distinct !DILexicalBlock(scope: !120, file: !8, line: 61, column: 4)
!266 = !DILocation(line: 61, column: 64, scope: !265)
!267 = !DILocation(line: 61, column: 72, scope: !265)
!268 = !DILocation(line: 61, column: 11, scope: !265)
!269 = distinct !DISubprogram(name: "tformat", linkageName: "std.time.datetime.tformat", scope: !8, file: !8, line: 65, type: !270, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !88)
!270 = !DISubroutineType(types: !271)
!271 = !{!74, !54, !12}
!272 = !DILocalVariable(name: "dt_format", arg: 1, scope: !269, file: !8, line: 65, type: !54)
!273 = !DILocation(line: 65, column: 34, scope: !269)
!274 = !DILocalVariable(name: "dt", arg: 2, scope: !269, file: !8, line: 65, type: !12)
!275 = !DILocation(line: 65, column: 56, scope: !269)
!276 = !DILocation(line: 65, column: 87, scope: !269)
!277 = !DILocation(line: 65, column: 63, scope: !269)
!278 = distinct !DISubprogram(name: "temp_numeric_tzsuffix", linkageName: "std.time.datetime.temp_numeric_tzsuffix", scope: !8, file: !8, line: 76, type: !279, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !88)
!279 = !DISubroutineType(types: !280)
!280 = !{!74, !16}
!281 = !DILocalVariable(name: "gmt_offset", arg: 1, scope: !278, file: !8, line: 76, type: !16)
!282 = !DILocation(line: 76, column: 37, scope: !278)
!283 = !DILocation(line: 74, column: 11, scope: !284)
!284 = distinct !DILexicalBlock(scope: !278, file: !8, line: 77, column: 1)
!285 = !DILocation(line: 74, column: 39, scope: !284)
!286 = !DILocation(line: 78, column: 6, scope: !278)
!287 = !DILocation(line: 79, column: 38, scope: !278)
!288 = !DILocation(line: 79, column: 58, scope: !278)
!289 = !DILocation(line: 79, column: 9, scope: !278)
!290 = distinct !DISubprogram(name: "temp_numeric_tzsuffix_colon", linkageName: "std.time.datetime.temp_numeric_tzsuffix_colon", scope: !8, file: !8, line: 86, type: !279, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !88)
!291 = !DILocalVariable(name: "gmt_offset", arg: 1, scope: !290, file: !8, line: 86, type: !16)
!292 = !DILocation(line: 86, column: 43, scope: !290)
!293 = !DILocation(line: 84, column: 11, scope: !294)
!294 = distinct !DILexicalBlock(scope: !290, file: !8, line: 87, column: 1)
!295 = !DILocation(line: 84, column: 39, scope: !294)
!296 = !DILocation(line: 88, column: 6, scope: !290)
!297 = !DILocation(line: 89, column: 39, scope: !290)
!298 = !DILocation(line: 89, column: 59, scope: !290)
!299 = !DILocation(line: 89, column: 9, scope: !290)
!300 = distinct !DISubprogram(name: "to_local", linkageName: "std.time.DateTime.to_local", scope: !301, file: !301, line: 36, type: !302, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !88)
!301 = !DIFile(filename: "datetime.c3", directory: "/usr/lib/c3c/lib/std/time")
!302 = !DISubroutineType(types: !303)
!303 = !{!12, !304}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DateTime*", baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!305 = !DILocation(line: 37, column: 1, scope: !300)
!306 = !DILocalVariable(name: "self", arg: 1, scope: !300, file: !301, line: 36, type: !304)
!307 = !DILocation(line: 36, column: 33, scope: !300)
!308 = !DILocalVariable(name: "tm", scope: !300, file: !301, line: 38, type: !309, align: 8)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tm", scope: !301, file: !301, line: 414, size: 448, align: 64, elements: !310, identifier: "libc.Tm")
!310 = !{!311, !313, !314, !315, !316, !317, !318, !319, !320, !321, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !309, file: !301, line: 416, baseType: !312, size: 32, align: 32)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !301, file: !301, line: 21, baseType: !16, align: 4)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !309, file: !301, line: 417, baseType: !312, size: 32, align: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !309, file: !301, line: 418, baseType: !312, size: 32, align: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !309, file: !301, line: 419, baseType: !312, size: 32, align: 32, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !309, file: !301, line: 420, baseType: !312, size: 32, align: 32, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !309, file: !301, line: 421, baseType: !312, size: 32, align: 32, offset: 160)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !309, file: !301, line: 422, baseType: !312, size: 32, align: 32, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !309, file: !301, line: 423, baseType: !312, size: 32, align: 32, offset: 224)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !309, file: !301, line: 424, baseType: !312, size: 32, align: 32, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !309, file: !301, line: 425, baseType: !322, size: 64, align: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimeOffset", scope: !301, file: !301, line: 442, baseType: !40, align: 8)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !309, file: !301, line: 426, baseType: !78, size: 64, align: 64, offset: 384)
!324 = !DILocation(line: 38, column: 5, scope: !300)
!325 = !DILocalVariable(name: "time_t", scope: !300, file: !301, line: 39, type: !326, align: 8)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time_t", scope: !301, file: !301, line: 79, baseType: !40, align: 8)
!327 = !DILocation(line: 39, column: 9, scope: !300)
!328 = !DILocation(line: 39, column: 26, scope: !300)
!329 = !DILocation(line: 39, column: 18, scope: !300)
!330 = !DILocation(line: 40, column: 2, scope: !300)
!331 = !DILocalVariable(name: "dt", scope: !300, file: !301, line: 41, type: !12, align: 8)
!332 = !DILocation(line: 41, column: 13, scope: !300)
!333 = !DILocation(line: 42, column: 24, scope: !300)
!334 = !DILocation(line: 42, column: 12, scope: !300)
!335 = !DILocation(line: 43, column: 2, scope: !300)
!336 = !DILocation(line: 43, column: 17, scope: !300)
!337 = !DILocation(line: 44, column: 2, scope: !300)
!338 = !DILocation(line: 44, column: 17, scope: !300)
!339 = !DILocation(line: 45, column: 2, scope: !300)
!340 = !DILocation(line: 45, column: 18, scope: !300)
!341 = !DILocation(line: 46, column: 2, scope: !300)
!342 = !DILocation(line: 46, column: 17, scope: !300)
!343 = !DILocation(line: 47, column: 2, scope: !300)
!344 = !DILocation(line: 47, column: 32, scope: !300)
!345 = !DILocation(line: 47, column: 13, scope: !300)
!346 = !DILocation(line: 48, column: 2, scope: !300)
!347 = !DILocation(line: 48, column: 12, scope: !300)
!348 = !DILocation(line: 49, column: 2, scope: !300)
!349 = !DILocation(line: 49, column: 16, scope: !300)
!350 = !DILocation(line: 49, column: 29, scope: !300)
!351 = !DILocation(line: 49, column: 67, scope: !300)
!352 = !DILocation(line: 49, column: 46, scope: !300)
!353 = !DILocation(line: 50, column: 2, scope: !300)
!354 = !DILocation(line: 50, column: 24, scope: !300)
!355 = !DILocation(line: 51, column: 2, scope: !300)
!356 = !DILocation(line: 51, column: 12, scope: !300)
!357 = !DILocation(line: 53, column: 3, scope: !300)
!358 = !DILocation(line: 53, column: 24, scope: !300)
!359 = !DILocation(line: 60, column: 9, scope: !300)
!360 = distinct !DISubprogram(name: "with_gmt_offset", linkageName: "std.time.DateTime.with_gmt_offset", scope: !301, file: !301, line: 69, type: !361, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !88)
!361 = !DISubroutineType(types: !362)
!362 = !{!12, !11, !16}
!363 = !DILocalVariable(name: "self", arg: 1, scope: !360, file: !301, line: 69, type: !11)
!364 = !DILocation(line: 69, column: 40, scope: !360)
!365 = !DILocalVariable(name: "gmt_offset", arg: 2, scope: !360, file: !301, line: 69, type: !16)
!366 = !DILocation(line: 69, column: 50, scope: !360)
!367 = !DILocation(line: 67, column: 11, scope: !368)
!368 = distinct !DILexicalBlock(scope: !360, file: !301, line: 70, column: 1)
!369 = !DILocation(line: 67, column: 39, scope: !368)
!370 = !DILocalVariable(name: "dt", scope: !360, file: !301, line: 71, type: !12, align: 8)
!371 = !DILocation(line: 71, column: 13, scope: !360)
!372 = !DILocation(line: 71, column: 20, scope: !360)
!373 = !DILocation(line: 71, column: 26, scope: !360)
!374 = !DILocalVariable(name: "self", scope: !360, file: !301, line: 72, type: !12, align: 8)
!375 = !DILocation(line: 72, column: 9, scope: !360)
!376 = !DILocation(line: 72, column: 28, scope: !360)
!377 = !DILocation(line: 79, column: 11, scope: !360)
!378 = !DILocation(line: 79, column: 39, scope: !360)
!379 = distinct !DISubprogram(name: "with_gmt_offset", linkageName: "std.time.TzDateTime.with_gmt_offset", scope: !301, file: !301, line: 81, type: !380, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !88)
!380 = !DISubroutineType(types: !381)
!381 = !{!12, !12, !16}
!382 = !DILocalVariable(name: "self", arg: 1, scope: !379, file: !301, line: 81, type: !12)
