; ModuleID = 'std::math::vector'
source_filename = "std::math::vector"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%Matrix4x4 = type { %.anon }
%.anon = type { %.anon.0 }
%.anon.0 = type { float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float }
%Matrix4x4.1 = type { %.anon.2 }
%.anon.2 = type { %.anon.3 }
%.anon.3 = type { double, double, double, double, double, double, double, double, double, double, double, double, double, double, double, double }
%Quaternion.4 = type { <4 x float> }
%Quaternion = type { <4 x double> }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$"std.math.vector.float[<3>].cross" = comdat any

$"std.math.vector.double[<3>].cross" = comdat any

$"std.math.vector.float[<3>].perpendicular" = comdat any

$"std.math.vector.double[<3>].perpendicular" = comdat any

$"std.math.vector.float[<3>].barycenter" = comdat any

$"std.math.vector.double[<3>].barycenter" = comdat any

$"std.math.vector.float[<3>].transform" = comdat any

$"std.math.vector.double[<3>].transform" = comdat any

$"std.math.vector.float[<3>].angle" = comdat any

$"std.math.vector.double[<3>].angle" = comdat any

$"std.math.vector.float[<3>].refract" = comdat any

$"std.math.vector.double[<3>].refract" = comdat any

$"std.math.vector.float[<3>].rotate_quat" = comdat any


!294 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !67, file: !67, line: 645, scopeLine: 645, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!295 = !DILocation(line: 645, column: 82, scope: !294, inlinedAt: !289)
!296 = !DILocalVariable(name: "d11", scope: !265, file: !8, line: 207, type: !37, align: 8)
!297 = !DILocation(line: 207, column: 6, scope: !265, inlinedAt: !267)
!298 = !DILocation(line: 660, column: 64, scope: !299, inlinedAt: !300)
!299 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !67, file: !67, line: 660, scopeLine: 660, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!300 = !DILocation(line: 207, column: 12, scope: !265, inlinedAt: !267)
!301 = !DILocation(line: 660, column: 68, scope: !299, inlinedAt: !300)
!302 = !DILocation(line: 645, column: 85, scope: !303, inlinedAt: !298)
!303 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !67, file: !67, line: 645, scopeLine: 645, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!304 = !DILocation(line: 645, column: 82, scope: !303, inlinedAt: !298)
!305 = !DILocalVariable(name: "d20", scope: !265, file: !8, line: 208, type: !37, align: 8)
!306 = !DILocation(line: 208, column: 6, scope: !265, inlinedAt: !267)
!307 = !DILocation(line: 660, column: 64, scope: !308, inlinedAt: !309)
!308 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !67, file: !67, line: 660, scopeLine: 660, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!309 = !DILocation(line: 208, column: 12, scope: !265, inlinedAt: !267)
!310 = !DILocation(line: 660, column: 68, scope: !308, inlinedAt: !309)
!311 = !DILocation(line: 645, column: 85, scope: !312, inlinedAt: !307)
!312 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !67, file: !67, line: 645, scopeLine: 645, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!313 = !DILocation(line: 645, column: 82, scope: !312, inlinedAt: !307)
!314 = !DILocalVariable(name: "d21", scope: !265, file: !8, line: 209, type: !37, align: 8)
!315 = !DILocation(line: 209, column: 6, scope: !265, inlinedAt: !267)
!316 = !DILocation(line: 660, column: 64, scope: !317, inlinedAt: !318)
!317 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !67, file: !67, line: 660, scopeLine: 660, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!318 = !DILocation(line: 209, column: 12, scope: !265, inlinedAt: !267)
!319 = !DILocation(line: 660, column: 68, scope: !317, inlinedAt: !318)
!320 = !DILocation(line: 645, column: 85, scope: !321, inlinedAt: !316)
!321 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !67, file: !67, line: 645, scopeLine: 645, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!322 = !DILocation(line: 645, column: 82, scope: !321, inlinedAt: !316)
!323 = !DILocalVariable(name: "denom", scope: !265, file: !8, line: 210, type: !37, align: 8)
!324 = !DILocation(line: 210, column: 6, scope: !265, inlinedAt: !267)
!325 = !DILocation(line: 210, column: 14, scope: !265, inlinedAt: !267)
!326 = !DILocation(line: 210, column: 20, scope: !265, inlinedAt: !267)
!327 = !DILocation(line: 210, column: 26, scope: !265, inlinedAt: !267)
!328 = !DILocation(line: 210, column: 32, scope: !265, inlinedAt: !267)
!329 = !DILocalVariable(name: "y", scope: !265, file: !8, line: 211, type: !37, align: 8)
!330 = !DILocation(line: 211, column: 6, scope: !265, inlinedAt: !267)
!331 = !DILocation(line: 211, column: 11, scope: !265, inlinedAt: !267)
!332 = !DILocation(line: 211, column: 17, scope: !265, inlinedAt: !267)
!333 = !DILocation(line: 211, column: 23, scope: !265, inlinedAt: !267)
!334 = !DILocation(line: 211, column: 29, scope: !265, inlinedAt: !267)
!335 = !DILocation(line: 211, column: 36, scope: !265, inlinedAt: !267)
!336 = !DILocalVariable(name: "z", scope: !265, file: !8, line: 212, type: !37, align: 8)
!337 = !DILocation(line: 212, column: 6, scope: !265, inlinedAt: !267)
!338 = !DILocation(line: 212, column: 11, scope: !265, inlinedAt: !267)
!339 = !DILocation(line: 212, column: 17, scope: !265, inlinedAt: !267)
!340 = !DILocation(line: 212, column: 23, scope: !265, inlinedAt: !267)
!341 = !DILocation(line: 212, column: 29, scope: !265, inlinedAt: !267)
!342 = !DILocation(line: 212, column: 36, scope: !265, inlinedAt: !267)
!343 = !DILocation(line: 213, column: 27, scope: !265, inlinedAt: !267)
!344 = !DILocation(line: 213, column: 23, scope: !265, inlinedAt: !267)
!345 = !DILocation(line: 213, column: 31, scope: !265, inlinedAt: !267)
!346 = !DILocation(line: 213, column: 9, scope: !265, inlinedAt: !267)
!347 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.float[<3>].transform", scope: !8, file: !8, line: 35, type: !348, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !16)
!348 = !DISubroutineType(types: !349)
!349 = !{!12, !12, !350}
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4", scope: !8, file: !8, line: 59, size: 512, align: 32, elements: !351, identifier: "std_math_matrix$float$.Matrix4x4")
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, scope: !350, file: !8, line: 61, baseType: !353, size: 512, align: 32)
!353 = !DICompositeType(tag: DW_TAG_union_type, scope: !350, file: !8, line: 61, size: 512, align: 32, elements: !354)
!354 = !{!355, !375}
!355 = !DIDerivedType(tag: DW_TAG_member, scope: !353, file: !8, line: 63, baseType: !356, size: 512, align: 32)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !353, file: !8, line: 63, size: 512, align: 32, elements: !357)
!357 = !{!358, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !356, file: !8, line: 65, baseType: !359, size: 32, align: 32)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !8, file: !8, line: 4, baseType: !13, align: 4)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !356, file: !8, line: 65, baseType: !359, size: 32, align: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !356, file: !8, line: 65, baseType: !359, size: 32, align: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !356, file: !8, line: 65, baseType: !359, size: 32, align: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !356, file: !8, line: 66, baseType: !359, size: 32, align: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !356, file: !8, line: 66, baseType: !359, size: 32, align: 32, offset: 160)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !356, file: !8, line: 66, baseType: !359, size: 32, align: 32, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !356, file: !8, line: 66, baseType: !359, size: 32, align: 32, offset: 224)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !356, file: !8, line: 67, baseType: !359, size: 32, align: 32, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !356, file: !8, line: 67, baseType: !359, size: 32, align: 32, offset: 288)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !356, file: !8, line: 67, baseType: !359, size: 32, align: 32, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !356, file: !8, line: 67, baseType: !359, size: 32, align: 32, offset: 352)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !356, file: !8, line: 68, baseType: !359, size: 32, align: 32, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !356, file: !8, line: 68, baseType: !359, size: 32, align: 32, offset: 416)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !356, file: !8, line: 68, baseType: !359, size: 32, align: 32, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !356, file: !8, line: 68, baseType: !359, size: 32, align: 32, offset: 480)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !353, file: !8, line: 70, baseType: !376, size: 512, align: 32)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 512, align: 32, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 16, lowerBound: 0)
!379 = !DILocalVariable(name: "self", arg: 1, scope: !347, file: !8, line: 35, type: !12)
!380 = !DILocation(line: 35, column: 36, scope: !347)
!381 = !DILocalVariable(name: "mat", arg: 2, scope: !347, file: !8, line: 35, type: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4f", scope: !8, file: !8, line: 8, baseType: !350, align: 4)
!383 = !DILocation(line: 35, column: 51, scope: !347)
!384 = !DILocation(line: 126, column: 3, scope: !385, inlinedAt: !386)
!385 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !8, file: !8, line: 123, scopeLine: 123, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!386 = !DILocation(line: 35, column: 59, scope: !347)
!387 = !DILocation(line: 126, column: 13, scope: !385, inlinedAt: !386)
!388 = !DILocation(line: 126, column: 15, scope: !385, inlinedAt: !386)
!389 = !DILocation(line: 126, column: 20, scope: !385, inlinedAt: !386)
!390 = !DILocation(line: 126, column: 30, scope: !385, inlinedAt: !386)
!391 = !DILocation(line: 126, column: 32, scope: !385, inlinedAt: !386)
!392 = !DILocation(line: 126, column: 37, scope: !385, inlinedAt: !386)
!393 = !DILocation(line: 126, column: 47, scope: !385, inlinedAt: !386)
!394 = !DILocation(line: 126, column: 49, scope: !385, inlinedAt: !386)
!395 = !DILocation(line: 126, column: 54, scope: !385, inlinedAt: !386)
!396 = !DILocation(line: 125, column: 9, scope: !385, inlinedAt: !386)
!397 = !DILocation(line: 127, column: 3, scope: !385, inlinedAt: !386)
!398 = !DILocation(line: 127, column: 13, scope: !385, inlinedAt: !386)
!399 = !DILocation(line: 127, column: 15, scope: !385, inlinedAt: !386)
!400 = !DILocation(line: 127, column: 20, scope: !385, inlinedAt: !386)
!401 = !DILocation(line: 127, column: 30, scope: !385, inlinedAt: !386)
!402 = !DILocation(line: 127, column: 32, scope: !385, inlinedAt: !386)
!403 = !DILocation(line: 127, column: 37, scope: !385, inlinedAt: !386)
!404 = !DILocation(line: 127, column: 47, scope: !385, inlinedAt: !386)
!405 = !DILocation(line: 127, column: 49, scope: !385, inlinedAt: !386)
!406 = !DILocation(line: 127, column: 54, scope: !385, inlinedAt: !386)
!407 = !DILocation(line: 128, column: 3, scope: !385, inlinedAt: !386)
!408 = !DILocation(line: 128, column: 13, scope: !385, inlinedAt: !386)
!409 = !DILocation(line: 128, column: 15, scope: !385, inlinedAt: !386)
!410 = !DILocation(line: 128, column: 20, scope: !385, inlinedAt: !386)
!411 = !DILocation(line: 128, column: 30, scope: !385, inlinedAt: !386)
!412 = !DILocation(line: 128, column: 32, scope: !385, inlinedAt: !386)
!413 = !DILocation(line: 128, column: 37, scope: !385, inlinedAt: !386)
!414 = !DILocation(line: 128, column: 47, scope: !385, inlinedAt: !386)
!415 = !DILocation(line: 128, column: 49, scope: !385, inlinedAt: !386)
!416 = !DILocation(line: 128, column: 54, scope: !385, inlinedAt: !386)
!417 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.double[<3>].transform", scope: !8, file: !8, line: 36, type: !418, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !16)
!418 = !DISubroutineType(types: !419)
!419 = !{!36, !36, !420}
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4", scope: !8, file: !8, line: 59, size: 1024, align: 64, elements: !421, identifier: "std_math_matrix$double$.Matrix4x4")
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, scope: !420, file: !8, line: 61, baseType: !423, size: 1024, align: 64)
!423 = !DICompositeType(tag: DW_TAG_union_type, scope: !420, file: !8, line: 61, size: 1024, align: 64, elements: !424)
!424 = !{!425, !445}
!425 = !DIDerivedType(tag: DW_TAG_member, scope: !423, file: !8, line: 63, baseType: !426, size: 1024, align: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !423, file: !8, line: 63, size: 1024, align: 64, elements: !427)
!427 = !{!428, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !426, file: !8, line: 65, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !8, file: !8, line: 5, baseType: !37, align: 8)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !426, file: !8, line: 65, baseType: !429, size: 64, align: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !426, file: !8, line: 65, baseType: !429, size: 64, align: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !426, file: !8, line: 65, baseType: !429, size: 64, align: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !426, file: !8, line: 66, baseType: !429, size: 64, align: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !426, file: !8, line: 66, baseType: !429, size: 64, align: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !426, file: !8, line: 66, baseType: !429, size: 64, align: 64, offset: 384)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !426, file: !8, line: 66, baseType: !429, size: 64, align: 64, offset: 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !426, file: !8, line: 67, baseType: !429, size: 64, align: 64, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !426, file: !8, line: 67, baseType: !429, size: 64, align: 64, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !426, file: !8, line: 67, baseType: !429, size: 64, align: 64, offset: 640)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !426, file: !8, line: 67, baseType: !429, size: 64, align: 64, offset: 704)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !426, file: !8, line: 68, baseType: !429, size: 64, align: 64, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !426, file: !8, line: 68, baseType: !429, size: 64, align: 64, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !426, file: !8, line: 68, baseType: !429, size: 64, align: 64, offset: 896)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !426, file: !8, line: 68, baseType: !429, size: 64, align: 64, offset: 960)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !423, file: !8, line: 70, baseType: !446, size: 1024, align: 64)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1024, align: 64, elements: !377)
!447 = !DILocalVariable(name: "self", arg: 1, scope: !417, file: !8, line: 36, type: !36)
!448 = !DILocation(line: 36, column: 38, scope: !417)
!449 = !DILocalVariable(name: "mat", arg: 2, scope: !417, file: !8, line: 36, type: !450)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4", scope: !8, file: !8, line: 9, baseType: !420, align: 8)
!451 = !DILocation(line: 36, column: 52, scope: !417)
!452 = !DILocation(line: 126, column: 3, scope: !453, inlinedAt: !454)
!453 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !8, file: !8, line: 123, scopeLine: 123, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!454 = !DILocation(line: 36, column: 60, scope: !417)
!455 = !DILocation(line: 126, column: 13, scope: !453, inlinedAt: !454)
!456 = !DILocation(line: 126, column: 15, scope: !453, inlinedAt: !454)
!457 = !DILocation(line: 126, column: 20, scope: !453, inlinedAt: !454)
!458 = !DILocation(line: 126, column: 30, scope: !453, inlinedAt: !454)
!459 = !DILocation(line: 126, column: 32, scope: !453, inlinedAt: !454)
!460 = !DILocation(line: 126, column: 37, scope: !453, inlinedAt: !454)
!461 = !DILocation(line: 126, column: 47, scope: !453, inlinedAt: !454)
!462 = !DILocation(line: 126, column: 49, scope: !453, inlinedAt: !454)
!463 = !DILocation(line: 126, column: 54, scope: !453, inlinedAt: !454)
!464 = !DILocation(line: 125, column: 9, scope: !453, inlinedAt: !454)
!465 = !DILocation(line: 127, column: 3, scope: !453, inlinedAt: !454)
!466 = !DILocation(line: 127, column: 13, scope: !453, inlinedAt: !454)
!467 = !DILocation(line: 127, column: 15, scope: !453, inlinedAt: !454)
!468 = !DILocation(line: 127, column: 20, scope: !453, inlinedAt: !454)
!469 = !DILocation(line: 127, column: 30, scope: !453, inlinedAt: !454)
!470 = !DILocation(line: 127, column: 32, scope: !453, inlinedAt: !454)
!471 = !DILocation(line: 127, column: 37, scope: !453, inlinedAt: !454)
!472 = !DILocation(line: 127, column: 47, scope: !453, inlinedAt: !454)
!473 = !DILocation(line: 127, column: 49, scope: !453, inlinedAt: !454)
!474 = !DILocation(line: 127, column: 54, scope: !453, inlinedAt: !454)
!475 = !DILocation(line: 128, column: 3, scope: !453, inlinedAt: !454)
!476 = !DILocation(line: 128, column: 13, scope: !453, inlinedAt: !454)
!477 = !DILocation(line: 128, column: 15, scope: !453, inlinedAt: !454)
!478 = !DILocation(line: 128, column: 20, scope: !453, inlinedAt: !454)
!479 = !DILocation(line: 128, column: 30, scope: !453, inlinedAt: !454)
!480 = !DILocation(line: 128, column: 32, scope: !453, inlinedAt: !454)
!481 = !DILocation(line: 128, column: 37, scope: !453, inlinedAt: !454)
!482 = !DILocation(line: 128, column: 47, scope: !453, inlinedAt: !454)
!483 = !DILocation(line: 128, column: 49, scope: !453, inlinedAt: !454)
!484 = !DILocation(line: 128, column: 54, scope: !453, inlinedAt: !454)
!485 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.float[<3>].angle", scope: !8, file: !8, line: 38, type: !486, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !16)
!486 = !DISubroutineType(types: !487)
!487 = !{!13, !12, !12}
!488 = !DILocalVariable(name: "self", arg: 1, scope: !485, file: !8, line: 38, type: !12)
!489 = !DILocation(line: 38, column: 27, scope: !485)
!490 = !DILocalVariable(name: "v2", arg: 2, scope: !485, file: !8, line: 38, type: !12)
!491 = !DILocation(line: 38, column: 44, scope: !485)
!492 = !DILocalVariable(name: "len", scope: !493, file: !8, line: 135, type: !13, align: 4)
!493 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !8, file: !8, line: 133, scopeLine: 133, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !16)
!494 = !DILocation(line: 135, column: 6, scope: !493, inlinedAt: !495)
!495 = !DILocation(line: 38, column: 51, scope: !485)
!496 = !DILocation(line: 135, column: 21, scope: !493, inlinedAt: !495)
!497 = !DILocation(line: 135, column: 12, scope: !493, inlinedAt: !495)
!498 = !DILocation(line: 617, column: 60, scope: !499, inlinedAt: !500)
!499 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !67, file: !67, line: 617, scopeLine: 617, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!500 = !DILocation(line: 618, column: 55, scope: !501, inlinedAt: !497)
!501 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !67, file: !67, line: 618, scopeLine: 618, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!502 = !DILocation(line: 617, column: 64, scope: !499, inlinedAt: !500)
!503 = !DILocation(line: 602, column: 81, scope: !504, inlinedAt: !498)
!504 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !67, file: !67, line: 602, scopeLine: 602, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!505 = !DILocation(line: 602, column: 78, scope: !504, inlinedAt: !498)
!506 = !DILocalVariable(name: "dot", scope: !493, file: !8, line: 136, type: !13, align: 4)
!507 = !DILocation(line: 136, column: 6, scope: !493, inlinedAt: !495)
!508 = !DILocation(line: 617, column: 60, scope: !509, inlinedAt: !510)
!509 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !67, file: !67, line: 617, scopeLine: 617, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!510 = !DILocation(line: 136, column: 12, scope: !493, inlinedAt: !495)
!511 = !DILocation(line: 617, column: 64, scope: !509, inlinedAt: !510)
!512 = !DILocation(line: 602, column: 81, scope: !513, inlinedAt: !508)
!513 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !67, file: !67, line: 602, scopeLine: 602, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!514 = !DILocation(line: 602, column: 78, scope: !513, inlinedAt: !508)
!515 = !DILocation(line: 121, column: 21, scope: !516, inlinedAt: !517)
!516 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !67, file: !67, line: 118, scopeLine: 118, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!517 = !DILocation(line: 137, column: 9, scope: !493, inlinedAt: !495)
!518 = !DILocation(line: 121, column: 10, scope: !516, inlinedAt: !517)
!519 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.double[<3>].angle", scope: !8, file: !8, line: 39, type: !520, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !16)
!520 = !DISubroutineType(types: !521)
!521 = !{!37, !36, !36}
!522 = !DILocalVariable(name: "self", arg: 1, scope: !519, file: !8, line: 39, type: !36)
!523 = !DILocation(line: 39, column: 29, scope: !519)
!524 = !DILocalVariable(name: "v2", arg: 2, scope: !519, file: !8, line: 39, type: !36)
!525 = !DILocation(line: 39, column: 47, scope: !519)
!526 = !DILocalVariable(name: "len", scope: !527, file: !8, line: 135, type: !37, align: 8)
!527 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !8, file: !8, line: 133, scopeLine: 133, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !16)
!528 = !DILocation(line: 135, column: 6, scope: !527, inlinedAt: !529)
!529 = !DILocation(line: 39, column: 54, scope: !519)
!530 = !DILocation(line: 135, column: 21, scope: !527, inlinedAt: !529)
!531 = !DILocation(line: 135, column: 12, scope: !527, inlinedAt: !529)
!532 = !DILocation(line: 660, column: 64, scope: !533, inlinedAt: !534)
!533 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !67, file: !67, line: 660, scopeLine: 660, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!534 = !DILocation(line: 661, column: 58, scope: !535, inlinedAt: !531)
!535 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !67, file: !67, line: 661, scopeLine: 661, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!536 = !DILocation(line: 660, column: 68, scope: !533, inlinedAt: !534)
!537 = !DILocation(line: 645, column: 85, scope: !538, inlinedAt: !532)
!538 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !67, file: !67, line: 645, scopeLine: 645, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!539 = !DILocation(line: 645, column: 82, scope: !538, inlinedAt: !532)
!540 = !DILocalVariable(name: "dot", scope: !527, file: !8, line: 136, type: !37, align: 8)
!541 = !DILocation(line: 136, column: 6, scope: !527, inlinedAt: !529)
!542 = !DILocation(line: 660, column: 64, scope: !543, inlinedAt: !544)
!543 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !67, file: !67, line: 660, scopeLine: 660, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!544 = !DILocation(line: 136, column: 12, scope: !527, inlinedAt: !529)
!545 = !DILocation(line: 660, column: 68, scope: !543, inlinedAt: !544)
!546 = !DILocation(line: 645, column: 85, scope: !547, inlinedAt: !542)
!547 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !67, file: !67, line: 645, scopeLine: 645, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!548 = !DILocation(line: 645, column: 82, scope: !547, inlinedAt: !542)
!549 = !DILocation(line: 123, column: 20, scope: !550, inlinedAt: !551)
!550 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !67, file: !67, line: 118, scopeLine: 118, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!551 = !DILocation(line: 137, column: 9, scope: !527, inlinedAt: !529)
!552 = !DILocation(line: 123, column: 10, scope: !550, inlinedAt: !551)
!553 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.float[<3>].refract", scope: !8, file: !8, line: 41, type: !554, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !16)
!554 = !DISubroutineType(types: !555)
!555 = !{!12, !12, !12, !13}
!556 = !DILocalVariable(name: "self", arg: 1, scope: !553, file: !8, line: 41, type: !12)
!557 = !DILocation(line: 41, column: 34, scope: !553)
!558 = !DILocalVariable(name: "n", arg: 2, scope: !553, file: !8, line: 41, type: !12)
!559 = !DILocation(line: 41, column: 51, scope: !553)
!560 = !DILocalVariable(name: "r", arg: 3, scope: !553, file: !8, line: 41, type: !13)
!561 = !DILocation(line: 41, column: 60, scope: !553)
!562 = !DILocalVariable(name: "dot", scope: !563, file: !8, line: 218, type: !13, align: 4)
!563 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !8, file: !8, line: 216, scopeLine: 216, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !16)
!564 = !DILocation(line: 218, column: 6, scope: !563, inlinedAt: !565)
!565 = !DILocation(line: 41, column: 66, scope: !553)
!566 = !DILocation(line: 617, column: 60, scope: !567, inlinedAt: !568)
!567 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !67, file: !67, line: 617, scopeLine: 617, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!568 = !DILocation(line: 218, column: 12, scope: !563, inlinedAt: !565)
!569 = !DILocation(line: 617, column: 64, scope: !567, inlinedAt: !568)
!570 = !DILocation(line: 602, column: 81, scope: !571, inlinedAt: !566)
!571 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !67, file: !67, line: 602, scopeLine: 602, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!572 = !DILocation(line: 602, column: 78, scope: !571, inlinedAt: !566)
!573 = !DILocalVariable(name: "d", scope: !563, file: !8, line: 219, type: !13, align: 4)
!574 = !DILocation(line: 219, column: 6, scope: !563, inlinedAt: !565)
!575 = !DILocation(line: 219, column: 14, scope: !563, inlinedAt: !565)
!576 = !DILocation(line: 219, column: 18, scope: !563, inlinedAt: !565)
!577 = !DILocation(line: 219, column: 27, scope: !563, inlinedAt: !565)
!578 = !DILocation(line: 219, column: 33, scope: !563, inlinedAt: !565)
!579 = !DILocation(line: 219, column: 23, scope: !563, inlinedAt: !565)
!580 = !DILocation(line: 219, column: 10, scope: !563, inlinedAt: !565)
!581 = !DILocation(line: 221, column: 9, scope: !563, inlinedAt: !565)
!582 = !DILocation(line: 221, column: 17, scope: !563, inlinedAt: !565)
!583 = !DILocation(line: 221, column: 21, scope: !563, inlinedAt: !565)
!584 = !DILocation(line: 221, column: 25, scope: !563, inlinedAt: !565)
!585 = !DILocation(line: 221, column: 30, scope: !563, inlinedAt: !565)
!586 = !DILocation(line: 221, column: 34, scope: !563, inlinedAt: !565)
!587 = !DILocation(line: 26, column: 10, scope: !588, inlinedAt: !590)
!588 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !589, file: !589, line: 21, scopeLine: 21, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!589 = !DIFile(filename: "values.c3", directory: "/usr/lib/c3c/lib/std/core")
!590 = !DILocation(line: 489, column: 25, scope: !591, inlinedAt: !592)
!591 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !67, file: !67, line: 489, scopeLine: 489, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!592 = !DILocation(line: 221, column: 40, scope: !563, inlinedAt: !565)
!593 = !DILocation(line: 221, column: 57, scope: !563, inlinedAt: !565)
!594 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.double[<3>].refract", scope: !8, file: !8, line: 42, type: !595, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !16)
!595 = !DISubroutineType(types: !596)
!596 = !{!36, !36, !36, !37}
!597 = !DILocalVariable(name: "self", arg: 1, scope: !594, file: !8, line: 42, type: !36)
!598 = !DILocation(line: 42, column: 36, scope: !594)
!599 = !DILocalVariable(name: "n", arg: 2, scope: !594, file: !8, line: 42, type: !36)
!600 = !DILocation(line: 42, column: 54, scope: !594)
!601 = !DILocalVariable(name: "r", arg: 3, scope: !594, file: !8, line: 42, type: !37)
!602 = !DILocation(line: 42, column: 64, scope: !594)
!603 = !DILocalVariable(name: "dot", scope: !604, file: !8, line: 218, type: !37, align: 8)
!604 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !8, file: !8, line: 216, scopeLine: 216, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !16)
!605 = !DILocation(line: 218, column: 6, scope: !604, inlinedAt: !606)
!606 = !DILocation(line: 42, column: 70, scope: !594)
!607 = !DILocation(line: 660, column: 64, scope: !608, inlinedAt: !609)
!608 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !67, file: !67, line: 660, scopeLine: 660, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!609 = !DILocation(line: 218, column: 12, scope: !604, inlinedAt: !606)
!610 = !DILocation(line: 660, column: 68, scope: !608, inlinedAt: !609)
!611 = !DILocation(line: 645, column: 85, scope: !612, inlinedAt: !607)
!612 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !67, file: !67, line: 645, scopeLine: 645, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!613 = !DILocation(line: 645, column: 82, scope: !612, inlinedAt: !607)
!614 = !DILocalVariable(name: "d", scope: !604, file: !8, line: 219, type: !37, align: 8)
!615 = !DILocation(line: 219, column: 6, scope: !604, inlinedAt: !606)
!616 = !DILocation(line: 219, column: 14, scope: !604, inlinedAt: !606)
!617 = !DILocation(line: 219, column: 18, scope: !604, inlinedAt: !606)
!618 = !DILocation(line: 219, column: 27, scope: !604, inlinedAt: !606)
!619 = !DILocation(line: 219, column: 33, scope: !604, inlinedAt: !606)
!620 = !DILocation(line: 219, column: 23, scope: !604, inlinedAt: !606)
!621 = !DILocation(line: 219, column: 10, scope: !604, inlinedAt: !606)
!622 = !DILocation(line: 221, column: 9, scope: !604, inlinedAt: !606)
!623 = !DILocation(line: 221, column: 17, scope: !604, inlinedAt: !606)
!624 = !DILocation(line: 221, column: 21, scope: !604, inlinedAt: !606)
!625 = !DILocation(line: 221, column: 25, scope: !604, inlinedAt: !606)
!626 = !DILocation(line: 221, column: 30, scope: !604, inlinedAt: !606)
!627 = !DILocation(line: 221, column: 34, scope: !604, inlinedAt: !606)
!628 = !DILocation(line: 26, column: 10, scope: !629, inlinedAt: !630)
!629 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !589, file: !589, line: 21, scopeLine: 21, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!630 = !DILocation(line: 489, column: 25, scope: !631, inlinedAt: !632)
!631 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !67, file: !67, line: 489, scopeLine: 489, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!632 = !DILocation(line: 221, column: 40, scope: !604, inlinedAt: !606)
!633 = !DILocation(line: 221, column: 57, scope: !604, inlinedAt: !606)
!634 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.float[<3>].rotate_quat", scope: !8, file: !8, line: 44, type: !635, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !16)
!635 = !DISubroutineType(types: !636)
!636 = !{!12, !12, !637}
!637 = !DICompositeType(tag: DW_TAG_union_type, name: "Quaternion", scope: !8, file: !8, line: 18, size: 128, align: 128, elements: !638, identifier: "std_math_quaternion$float$.Quaternion")
!638 = !{!639, !647}
!639 = !DIDerivedType(tag: DW_TAG_member, scope: !637, file: !8, line: 20, baseType: !640, size: 128, align: 128)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !637, file: !8, line: 20, size: 128, align: 128, elements: !641)
!641 = !{!642, !644, !645, !646}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !640, file: !8, line: 22, baseType: !643, size: 32, align: 32)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !8, file: !8, line: 5, baseType: !13, align: 4)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !640, file: !8, line: 22, baseType: !643, size: 32, align: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !640, file: !8, line: 22, baseType: !643, size: 32, align: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !640, file: !8, line: 22, baseType: !643, size: 32, align: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !637, file: !8, line: 24, baseType: !648, size: 128, align: 128)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 128, align: 32, flags: DIFlagVector, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 4, lowerBound: 0)
!651 = !DILocalVariable(name: "self", arg: 1, scope: !634, file: !8, line: 44, type: !12)
!652 = !DILocation(line: 44, column: 38, scope: !634)
!653 = !DILocalVariable(name: "q", arg: 2, scope: !634, file: !8, line: 44, type: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternionf", scope: !8, file: !8, line: 5, baseType: !637, align: 16)
!655 = !DILocation(line: 44, column: 56, scope: !634)
!656 = !DILocation(line: 150, column: 3, scope: !657, inlinedAt: !658)
!657 = distinct !DISubprogram(name: "rotate_by_quat3", linkageName: "rotate_by_quat3", scope: !8, file: !8, line: 147, scopeLine: 147, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!658 = !DILocation(line: 44, column: 62, scope: !634)
!659 = !DILocation(line: 150, column: 5, scope: !657, inlinedAt: !658)
!660 = !DILocation(line: 150, column: 11, scope: !657, inlinedAt: !658)
!661 = !DILocation(line: 150, column: 17, scope: !657, inlinedAt: !658)
!662 = !DILocation(line: 150, column: 23, scope: !657, inlinedAt: !658)
!663 = !DILocation(line: 150, column: 29, scope: !657, inlinedAt: !658)
!664 = !DILocation(line: 150, column: 35, scope: !657, inlinedAt: !658)
!665 = !DILocation(line: 150, column: 41, scope: !657, inlinedAt: !658)
!666 = !DILocation(line: 150, column: 47, scope: !657, inlinedAt: !658)
!667 = !DILocation(line: 150, column: 53, scope: !657, inlinedAt: !658)
!668 = !DILocation(line: 151, column: 6, scope: !657, inlinedAt: !658)
!669 = !DILocation(line: 151, column: 8, scope: !657, inlinedAt: !658)
!670 = !DILocation(line: 151, column: 18, scope: !657, inlinedAt: !658)
!671 = !DILocation(line: 151, column: 14, scope: !657, inlinedAt: !658)
!672 = !DILocation(line: 151, column: 24, scope: !657, inlinedAt: !658)
!673 = !DILocation(line: 151, column: 34, scope: !657, inlinedAt: !658)
!674 = !DILocation(line: 151, column: 30, scope: !657, inlinedAt: !658)
!675 = !DILocation(line: 151, column: 40, scope: !657, inlinedAt: !658)
!676 = !DILocation(line: 152, column: 6, scope: !657, inlinedAt: !658)
!677 = !DILocation(line: 152, column: 8, scope: !657, inlinedAt: !658)
!678 = !DILocation(line: 152, column: 18, scope: !657, inlinedAt: !658)
!679 = !DILocation(line: 152, column: 14, scope: !657, inlinedAt: !658)
!680 = !DILocation(line: 152, column: 24, scope: !657, inlinedAt: !658)
!681 = !DILocation(line: 152, column: 34, scope: !657, inlinedAt: !658)
!682 = !DILocation(line: 152, column: 30, scope: !657, inlinedAt: !658)
!683 = !DILocation(line: 152, column: 40, scope: !657, inlinedAt: !658)
!684 = !DILocation(line: 149, column: 9, scope: !657, inlinedAt: !658)
!685 = !DILocation(line: 153, column: 3, scope: !657, inlinedAt: !658)
!686 = !DILocation(line: 153, column: 5, scope: !657, inlinedAt: !658)
!687 = !DILocation(line: 153, column: 15, scope: !657, inlinedAt: !658)
!688 = !DILocation(line: 153, column: 11, scope: !657, inlinedAt: !658)
!689 = !DILocation(line: 153, column: 21, scope: !657, inlinedAt: !658)
!690 = !DILocation(line: 153, column: 31, scope: !657, inlinedAt: !658)
!691 = !DILocation(line: 153, column: 27, scope: !657, inlinedAt: !658)
!692 = !DILocation(line: 153, column: 37, scope: !657, inlinedAt: !658)
!693 = !DILocation(line: 154, column: 6, scope: !657, inlinedAt: !658)
!694 = !DILocation(line: 154, column: 8, scope: !657, inlinedAt: !658)
!695 = !DILocation(line: 154, column: 14, scope: !657, inlinedAt: !658)
!696 = !DILocation(line: 154, column: 20, scope: !657, inlinedAt: !658)
!697 = !DILocation(line: 154, column: 26, scope: !657, inlinedAt: !658)
!698 = !DILocation(line: 154, column: 32, scope: !657, inlinedAt: !658)
!699 = !DILocation(line: 154, column: 38, scope: !657, inlinedAt: !658)
!700 = !DILocation(line: 154, column: 44, scope: !657, inlinedAt: !658)
!701 = !DILocation(line: 154, column: 50, scope: !657, inlinedAt: !658)
!702 = !DILocation(line: 154, column: 56, scope: !657, inlinedAt: !658)
!703 = !DILocation(line: 155, column: 6, scope: !657, inlinedAt: !658)
!704 = !DILocation(line: 155, column: 8, scope: !657, inlinedAt: !658)
!705 = !DILocation(line: 155, column: 19, scope: !657, inlinedAt: !658)
!706 = !DILocation(line: 155, column: 14, scope: !657, inlinedAt: !658)
!707 = !DILocation(line: 155, column: 25, scope: !657, inlinedAt: !658)
!708 = !DILocation(line: 155, column: 35, scope: !657, inlinedAt: !658)
!709 = !DILocation(line: 155, column: 31, scope: !657, inlinedAt: !658)
!710 = !DILocation(line: 155, column: 41, scope: !657, inlinedAt: !658)
!711 = !DILocation(line: 156, column: 3, scope: !657, inlinedAt: !658)
!712 = !DILocation(line: 156, column: 5, scope: !657, inlinedAt: !658)
!713 = !DILocation(line: 156, column: 16, scope: !657, inlinedAt: !658)
!714 = !DILocation(line: 156, column: 11, scope: !657, inlinedAt: !658)
!715 = !DILocation(line: 156, column: 22, scope: !657, inlinedAt: !658)
!716 = !DILocation(line: 156, column: 32, scope: !657, inlinedAt: !658)
!717 = !DILocation(line: 156, column: 28, scope: !657, inlinedAt: !658)
!718 = !DILocation(line: 156, column: 38, scope: !657, inlinedAt: !658)
!719 = !DILocation(line: 157, column: 6, scope: !657, inlinedAt: !658)
!720 = !DILocation(line: 157, column: 8, scope: !657, inlinedAt: !658)
!721 = !DILocation(line: 157, column: 18, scope: !657, inlinedAt: !658)
!722 = !DILocation(line: 157, column: 14, scope: !657, inlinedAt: !658)
!723 = !DILocation(line: 157, column: 24, scope: !657, inlinedAt: !658)
!724 = !DILocation(line: 157, column: 34, scope: !657, inlinedAt: !658)
!725 = !DILocation(line: 157, column: 30, scope: !657, inlinedAt: !658)
!726 = !DILocation(line: 157, column: 40, scope: !657, inlinedAt: !658)
!727 = !DILocation(line: 158, column: 6, scope: !657, inlinedAt: !658)
!728 = !DILocation(line: 158, column: 8, scope: !657, inlinedAt: !658)
!729 = !DILocation(line: 158, column: 14, scope: !657, inlinedAt: !658)
!730 = !DILocation(line: 158, column: 20, scope: !657, inlinedAt: !658)
!731 = !DILocation(line: 158, column: 26, scope: !657, inlinedAt: !658)
!732 = !DILocation(line: 158, column: 32, scope: !657, inlinedAt: !658)
!733 = !DILocation(line: 158, column: 38, scope: !657, inlinedAt: !658)
!734 = !DILocation(line: 158, column: 44, scope: !657, inlinedAt: !658)
!735 = !DILocation(line: 158, column: 50, scope: !657, inlinedAt: !658)
!736 = !DILocation(line: 158, column: 56, scope: !657, inlinedAt: !658)
!737 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.double[<3>].rotate_quat", scope: !8, file: !8, line: 45, type: !738, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !16)
!738 = !DISubroutineType(types: !739)
!739 = !{!36, !36, !740}
!740 = !DICompositeType(tag: DW_TAG_union_type, name: "Quaternion", scope: !8, file: !8, line: 18, size: 256, align: 256, elements: !741, identifier: "std_math_quaternion$double$.Quaternion")
!741 = !{!742, !750}
!742 = !DIDerivedType(tag: DW_TAG_member, scope: !740, file: !8, line: 20, baseType: !743, size: 256, align: 256)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !740, file: !8, line: 20, size: 256, align: 256, elements: !744)
!744 = !{!745, !747, !748, !749}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !743, file: !8, line: 22, baseType: !746, size: 64, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !8, file: !8, line: 6, baseType: !37, align: 8)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !743, file: !8, line: 22, baseType: !746, size: 64, align: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !743, file: !8, line: 22, baseType: !746, size: 64, align: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !743, file: !8, line: 22, baseType: !746, size: 64, align: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !740, file: !8, line: 24, baseType: !751, size: 256, align: 256)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 256, align: 64, flags: DIFlagVector, elements: !649)
!752 = !DILocalVariable(name: "self", arg: 1, scope: !737, file: !8, line: 45, type: !36)
!753 = !DILocation(line: 45, column: 40, scope: !737)
!754 = !DILocalVariable(name: "q", arg: 2, scope: !737, file: !8, line: 45, type: !755)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternion", scope: !8, file: !8, line: 6, baseType: !740, align: 32)
!756 = !DILocation(line: 45, column: 57, scope: !737)
!757 = !DILocation(line: 150, column: 3, scope: !758, inlinedAt: !759)
!758 = distinct !DISubprogram(name: "rotate_by_quat3", linkageName: "rotate_by_quat3", scope: !8, file: !8, line: 147, scopeLine: 147, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!759 = !DILocation(line: 45, column: 63, scope: !737)
!760 = !DILocation(line: 150, column: 5, scope: !758, inlinedAt: !759)
!761 = !DILocation(line: 150, column: 11, scope: !758, inlinedAt: !759)
!762 = !DILocation(line: 150, column: 17, scope: !758, inlinedAt: !759)
!763 = !DILocation(line: 150, column: 23, scope: !758, inlinedAt: !759)
!764 = !DILocation(line: 150, column: 29, scope: !758, inlinedAt: !759)
!765 = !DILocation(line: 150, column: 35, scope: !758, inlinedAt: !759)
!766 = !DILocation(line: 150, column: 41, scope: !758, inlinedAt: !759)
!767 = !DILocation(line: 150, column: 47, scope: !758, inlinedAt: !759)
!768 = !DILocation(line: 150, column: 53, scope: !758, inlinedAt: !759)
!769 = !DILocation(line: 151, column: 6, scope: !758, inlinedAt: !759)
!770 = !DILocation(line: 151, column: 8, scope: !758, inlinedAt: !759)
!771 = !DILocation(line: 151, column: 18, scope: !758, inlinedAt: !759)
!772 = !DILocation(line: 151, column: 14, scope: !758, inlinedAt: !759)
!773 = !DILocation(line: 151, column: 24, scope: !758, inlinedAt: !759)
!774 = !DILocation(line: 151, column: 34, scope: !758, inlinedAt: !759)
!775 = !DILocation(line: 151, column: 30, scope: !758, inlinedAt: !759)
!776 = !DILocation(line: 151, column: 40, scope: !758, inlinedAt: !759)
!777 = !DILocation(line: 152, column: 6, scope: !758, inlinedAt: !759)
!778 = !DILocation(line: 152, column: 8, scope: !758, inlinedAt: !759)
!779 = !DILocation(line: 152, column: 18, scope: !758, inlinedAt: !759)
!780 = !DILocation(line: 152, column: 14, scope: !758, inlinedAt: !759)
!781 = !DILocation(line: 152, column: 24, scope: !758, inlinedAt: !759)
!782 = !DILocation(line: 152, column: 34, scope: !758, inlinedAt: !759)
!783 = !DILocation(line: 152, column: 30, scope: !758, inlinedAt: !759)
!784 = !DILocation(line: 152, column: 40, scope: !758, inlinedAt: !759)
!785 = !DILocation(line: 149, column: 9, scope: !758, inlinedAt: !759)
!786 = !DILocation(line: 153, column: 3, scope: !758, inlinedAt: !759)
!787 = !DILocation(line: 153, column: 5, scope: !758, inlinedAt: !759)
!788 = !DILocation(line: 153, column: 15, scope: !758, inlinedAt: !759)
!789 = !DILocation(line: 153, column: 11, scope: !758, inlinedAt: !759)
!790 = !DILocation(line: 153, column: 21, scope: !758, inlinedAt: !759)
!791 = !DILocation(line: 153, column: 31, scope: !758, inlinedAt: !759)
!792 = !DILocation(line: 153, column: 27, scope: !758, inlinedAt: !759)
!793 = !DILocation(line: 153, column: 37, scope: !758, inlinedAt: !759)
!794 = !DILocation(line: 154, column: 6, scope: !758, inlinedAt: !759)
!795 = !DILocation(line: 154, column: 8, scope: !758, inlinedAt: !759)
!796 = !DILocation(line: 154, column: 14, scope: !758, inlinedAt: !759)
!797 = !DILocation(line: 154, column: 20, scope: !758, inlinedAt: !759)
!798 = !DILocation(line: 154, column: 26, scope: !758, inlinedAt: !759)
!799 = !DILocation(line: 154, column: 32, scope: !758, inlinedAt: !759)
