; ModuleID = 'std::core::builtin'
source_filename = "std::core::builtin"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%"void*[]" = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }

$std.core.builtin.panicf = comdat any

$std.core.builtin.print_backtrace = comdat any

$std.core.builtin.default_panic = comdat any

$std.core.builtin.sig_panic = comdat any

$std.core.builtin.sig_bus_error = comdat any

$std.core.builtin.sig_segmentation_fault = comdat any

$"$ct.std.core.builtin.EmptySlot" = comdat any

$"$ct.p$void" = comdat any

$"$ct.void" = comdat any

$"$ct.int" = comdat any

$"$ct.std.core.builtin.PrefetchLocality" = comdat any

$std.core.builtin.EMPTY_MACRO_SLOT = comdat any

$std.core.builtin.panic = comdat any

$std.core.builtin.MAX_FRAMEADDRESS = comdat any

$"$ct.std.core.mem.allocator.OnStackAllocator" = comdat any

$"$ct.ulong" = comdat any

$"$ct.std.core.mem.allocator.TempAllocator" = comdat any

$"$ct.fault" = comdat any

$"$ct.String" = comdat any

$"$ct.sa$char" = comdat any

$"$ct.char" = comdat any

$"$ct.uint" = comdat any

$std.core.builtin.old_bus_error = comdat any

$std.core.builtin.old_segmentation_fault = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "EMPTY_MACRO_SLOT", linkageName: "std.core.builtin.EMPTY_MACRO_SLOT", scope: !2, file: !2, line: 27, type: !3, isLocal: false, isDefinition: true, align: 8)
!2 = !DIFile(filename: "builtin.c3", directory: "/usr/lib/c3c/lib/std/core")
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "EmptySlot", scope: !2, file: !2, line: 29, baseType: !4, align: 8)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "in_panic", linkageName: "std.core.builtin.in_panic", scope: !2, file: !2, line: 156, type: !7, isLocal: true, isDefinition: true, align: 1)
!7 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "panic", linkageName: "std.core.builtin.panic", scope: !2, file: !2, line: 177, type: !10, isLocal: false, isDefinition: true, align: 8)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "PanicFn", scope: !2, file: !2, line: 175, baseType: !11, align: 8)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PanicFn", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DISubroutineType(types: !13)
!13 = !{null, !14, !14, !14, !23}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !16, identifier: "char[]")
!16 = !{!17, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !15, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !15, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !22)
!22 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "MAX_FRAMEADDRESS", linkageName: "std.core.builtin.MAX_FRAMEADDRESS", scope: !2, file: !2, line: 499, type: !26, isLocal: false, isDefinition: true, align: 4)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "old_bus_error", linkageName: "std.core.builtin.old_bus_error", scope: !2, file: !2, line: 790, type: !29, isLocal: false, isDefinition: true, align: 8)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "SignalFunction", scope: !2, file: !2, line: 55, baseType: !30, align: 8)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SignalFunction", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !26}
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "old_segmentation_fault", linkageName: "std.core.builtin.old_segmentation_fault", scope: !2, file: !2, line: 791, type: !29, isLocal: false, isDefinition: true, align: 8)
!35 = !{i32 2, !"Dwarf Version", i32 4}
!36 = !{i32 2, !"Debug Info Version", i32 3}
!37 = !{i32 2, !"wchar_size", i32 4}
!38 = !{i32 4, !"PIE Level", i32 2}
!39 = !{i32 4, !"PIC Level", i32 2}
!40 = !{i32 1, !"uwtable", i32 2}
!41 = !{i32 2, !"frame-pointer", i32 2}
!42 = distinct !DICompileUnit(language: DW_LANG_C11, file: !43, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !44, splitDebugInlining: false)
!43 = !DIFile(filename: "builtin_comparison.c3", directory: "/usr/lib/c3c/lib/std/core")
!44 = !{!0, !5, !8, !24, !27, !33}
!45 = distinct !DISubprogram(name: "panicf", linkageName: "std.core.builtin.panicf", scope: !2, file: !2, line: 179, type: !46, scopeLine: 179, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !42, retainedNodes: !58)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !14, !14, !14, !23, !48}
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !49, identifier: "any[]")
!49 = !{!50, !57}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !48, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !53, identifier: "any")
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !52, baseType: !4, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !52, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !48, baseType: !21, size: 64, align: 64, offset: 64)
!58 = !{}
!59 = !DILocalVariable(name: "fmt", arg: 1, scope: !45, file: !2, line: 179, type: !14)
!60 = !DILocation(line: 179, column: 23, scope: !45)
!61 = !DILocalVariable(name: "file", arg: 2, scope: !45, file: !2, line: 179, type: !14)
!62 = !DILocation(line: 179, column: 35, scope: !45)
!63 = !DILocalVariable(name: "function", arg: 3, scope: !45, file: !2, line: 179, type: !14)
!64 = !DILocation(line: 179, column: 48, scope: !45)
!65 = !DILocalVariable(name: "line", arg: 4, scope: !45, file: !2, line: 179, type: !23)
!66 = !DILocation(line: 179, column: 63, scope: !45)
!67 = !DILocalVariable(name: "args", arg: 5, scope: !45, file: !2, line: 179, type: !48)
!68 = !DILocation(line: 179, column: 69, scope: !45)
!69 = !DILocation(line: 181, column: 6, scope: !45)
!70 = !DILocation(line: 206, column: 15, scope: !71, inlinedAt: !73)
!71 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !72, file: !72, line: 204, scopeLine: 204, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!72 = !DIFile(filename: "io.c3", directory: "/usr/lib/c3c/lib/std/io")
!73 = !DILocation(line: 183, column: 3, scope: !74)
!74 = distinct !DILexicalBlock(scope: !45, file: !2, line: 182, column: 2)
!75 = !DILocation(line: 116, column: 24, scope: !76, inlinedAt: !77)
!76 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !72, file: !72, line: 112, scopeLine: 112, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!77 = !DILocation(line: 206, column: 2, scope: !71, inlinedAt: !73)
!78 = !DILocation(line: 116, column: 34, scope: !76, inlinedAt: !77)
!79 = !DILocation(line: 139, column: 11, scope: !76, inlinedAt: !77)
!80 = !DILocation(line: 216, column: 16, scope: !81, inlinedAt: !82)
!81 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !72, file: !72, line: 214, scopeLine: 214, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!82 = !DILocation(line: 184, column: 3, scope: !74)
!83 = !DILocalVariable(name: "len", scope: !84, file: !2, line: 172, type: !21, align: 8)
!84 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !72, file: !72, line: 170, scopeLine: 170, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42, retainedNodes: !58)
!85 = !DILocation(line: 172, column: 6, scope: !84, inlinedAt: !86)
!86 = !DILocation(line: 216, column: 2, scope: !81, inlinedAt: !82)
!87 = !DILocation(line: 116, column: 24, scope: !88, inlinedAt: !89)
!88 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !72, file: !72, line: 112, scopeLine: 112, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!89 = !DILocation(line: 172, column: 12, scope: !84, inlinedAt: !86)
!90 = !DILocation(line: 116, column: 34, scope: !88, inlinedAt: !89)
!91 = !DILocation(line: 139, column: 11, scope: !88, inlinedAt: !89)
!92 = !DILocation(line: 173, column: 2, scope: !84, inlinedAt: !86)
!93 = !DILocation(line: 88, column: 11, scope: !84, inlinedAt: !86)
!94 = !DILocation(line: 178, column: 4, scope: !84, inlinedAt: !86)
!95 = !DILocation(line: 220, column: 11, scope: !84, inlinedAt: !86)
!96 = !DILocation(line: 180, column: 9, scope: !84, inlinedAt: !86)
!97 = !DILocation(line: 185, column: 9, scope: !74)
!98 = !DILocation(line: 187, column: 13, scope: !45)
!99 = !DILocalVariable(name: "buffer", scope: !100, file: !2, line: 544, type: !102, align: 16)
!100 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !101, file: !101, line: 542, scopeLine: 542, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42, retainedNodes: !58)
!101 = !DIFile(filename: "mem.c3", directory: "/usr/lib/c3c/lib/std/core")
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 4096, align: 8, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 512, lowerBound: 0)
!105 = !DILocation(line: 544, column: 14, scope: !100, inlinedAt: !106)
!106 = !DILocation(line: 188, column: 2, scope: !45)
!107 = !DILocalVariable(name: "allocator", scope: !100, file: !2, line: 545, type: !108, align: 8)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 12, size: 384, align: 64, elements: !109, identifier: "std.core.mem.allocator.OnStackAllocator")
!109 = !{!110, !115, !116, !117}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !108, file: !2, line: 14, baseType: !111, size: 128, align: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !112, identifier: "Allocator")
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !111, baseType: !4, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !111, baseType: !56, size: 64, align: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !108, file: !2, line: 15, baseType: !15, size: 128, align: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !108, file: !2, line: 16, baseType: !21, size: 64, align: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !108, file: !2, line: 17, baseType: !118, size: 64, align: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !119, size: 64, align: 64, dwarfAddressSpace: 0)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !120, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!120 = !{!121, !122, !123}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !119, file: !2, line: 22, baseType: !7, size: 8, align: 8)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !119, file: !2, line: 23, baseType: !118, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !119, file: !2, line: 24, baseType: !4, size: 64, align: 64, offset: 128)
!124 = !DILocation(line: 545, column: 19, scope: !100, inlinedAt: !106)
!125 = !DILocation(line: 546, column: 18, scope: !100, inlinedAt: !106)
!126 = !DILocation(line: 546, column: 26, scope: !100, inlinedAt: !106)
!127 = !DILocation(line: 546, column: 2, scope: !100, inlinedAt: !106)
!128 = !DILocalVariable(name: "allocator", scope: !45, file: !2, line: 188, type: !111, align: 8)
!129 = !DILocation(line: 188, column: 28, scope: !45)
!130 = !DILocation(line: 548, column: 8, scope: !131, inlinedAt: !106)
!131 = distinct !DILexicalBlock(scope: !100, file: !101, line: 548, column: 2)
!132 = !DILocalVariable(name: "s", scope: !133, file: !2, line: 190, type: !134, align: 8)
!133 = distinct !DILexicalBlock(scope: !45, file: !2, line: 189, column: 2)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 7, baseType: !135, align: 8)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !136, size: 64, align: 64, dwarfAddressSpace: 0)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 8, baseType: null, align: 1)
!137 = !DILocation(line: 190, column: 11, scope: !133)
!138 = !DILocation(line: 191, column: 10, scope: !133)
!139 = !DILocation(line: 18, column: 12, scope: !133)
!140 = !DILocation(line: 18, column: 11, scope: !133)
!141 = !DILocation(line: 191, column: 3, scope: !133)
!142 = !DILocation(line: 192, column: 3, scope: !133)
!143 = !DILocation(line: 193, column: 14, scope: !133)
!144 = !DILocation(line: 194, column: 3, scope: !133)
!145 = !DILocation(line: 194, column: 9, scope: !133)
!146 = !DILocation(line: 194, column: 39, scope: !133)
!147 = !DILocation(line: 547, column: 8, scope: !148, inlinedAt: !106)
!148 = distinct !DILexicalBlock(scope: !100, file: !101, line: 547, column: 8)
!149 = distinct !DISubprogram(name: "print_backtrace", linkageName: "std.core.builtin.print_backtrace", scope: !2, file: !2, line: 99, type: !150, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !42, retainedNodes: !58)
!150 = !DISubroutineType(types: !151)
!151 = !{!7, !14, !26}
!152 = !DILocalVariable(name: "message", arg: 1, scope: !149, file: !2, line: 99, type: !14)
!153 = !DILocation(line: 99, column: 32, scope: !149)
!154 = !DILocalVariable(name: "backtraces_to_ignore", arg: 2, scope: !149, file: !2, line: 99, type: !26)
!155 = !DILocation(line: 99, column: 45, scope: !149)
!156 = !DILocalVariable(name: "buffer", scope: !157, file: !2, line: 544, type: !158, align: 16)
!157 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !101, file: !101, line: 542, scopeLine: 542, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42, retainedNodes: !58)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 34816, align: 8, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 4352, lowerBound: 0)
!161 = !DILocation(line: 544, column: 14, scope: !157, inlinedAt: !162)
!162 = !DILocation(line: 99, column: 98, scope: !149)
!163 = !DILocalVariable(name: "allocator", scope: !157, file: !2, line: 545, type: !108, align: 8)
!164 = !DILocation(line: 545, column: 19, scope: !157, inlinedAt: !162)
!165 = !DILocation(line: 546, column: 18, scope: !157, inlinedAt: !162)
!166 = !DILocation(line: 546, column: 26, scope: !157, inlinedAt: !162)
!167 = !DILocation(line: 546, column: 2, scope: !157, inlinedAt: !162)
!168 = !DILocalVariable(name: "smem", scope: !149, file: !2, line: 99, type: !111, align: 8)
!169 = !DILocation(line: 99, column: 127, scope: !149)
!170 = !DILocation(line: 548, column: 8, scope: !171, inlinedAt: !162)
!171 = distinct !DILexicalBlock(scope: !157, file: !101, line: 548, column: 2)
!172 = !DILocalVariable(name: "t", scope: !173, file: !2, line: 101, type: !111, align: 8)
!173 = distinct !DILexicalBlock(scope: !149, file: !2, line: 100, column: 1)
!174 = !DILocation(line: 101, column: 12, scope: !173)
!175 = !DILocation(line: 101, column: 16, scope: !173)
!176 = !DILocalVariable(name: "new_t", scope: !173, file: !2, line: 102, type: !177, align: 8)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !178, size: 64, align: 64, dwarfAddressSpace: 0)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 32, size: 512, align: 64, elements: !179, identifier: "std.core.mem.allocator.TempAllocator")
!179 = !{!180, !181, !193, !194, !195, !196, !197, !198}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !178, file: !2, line: 34, baseType: !111, size: 128, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !178, file: !2, line: 35, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !183, size: 64, align: 64, dwarfAddressSpace: 0)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 52, size: 256, align: 64, elements: !184, identifier: "std.core.mem.allocator.TempAllocatorPage")
!184 = !{!185, !186, !187, !188, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !183, file: !2, line: 54, baseType: !182, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !183, file: !2, line: 55, baseType: !4, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !183, file: !2, line: 56, baseType: !21, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !183, file: !2, line: 57, baseType: !21, size: 64, align: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !183, file: !2, line: 58, baseType: !190, align: 8, offset: 256)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, align: 8, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 0, lowerBound: 0)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !178, file: !2, line: 36, baseType: !177, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !178, file: !2, line: 37, baseType: !7, size: 8, align: 8, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !178, file: !2, line: 38, baseType: !21, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !178, file: !2, line: 39, baseType: !21, size: 64, align: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !178, file: !2, line: 40, baseType: !21, size: 64, align: 64, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !178, file: !2, line: 41, baseType: !190, align: 8, offset: 512)
!199 = !DILocation(line: 102, column: 17, scope: !173)
!200 = !DILocation(line: 102, column: 55, scope: !173)
!201 = !DILocation(line: 66, column: 11, scope: !173)
!202 = !DILocation(line: 102, column: 25, scope: !173)
!203 = !DILocation(line: 103, column: 28, scope: !173)
!204 = !DILocalVariable(name: "buffer", scope: !173, file: !2, line: 109, type: !205, align: 16)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, align: 64, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 256, lowerBound: 0)
!208 = !DILocation(line: 109, column: 13, scope: !173)
!209 = !DILocalVariable(name: "backtraces", scope: !173, file: !2, line: 110, type: !210, align: 8)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !211, identifier: "void*[]")
!211 = !{!212, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !210, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !210, baseType: !21, size: 64, align: 64, offset: 64)
!215 = !DILocation(line: 110, column: 10, scope: !173)
!216 = !DILocation(line: 110, column: 51, scope: !173)
!217 = !DILocation(line: 110, column: 23, scope: !173)
!218 = !DILocation(line: 111, column: 2, scope: !173)
!219 = !DILocalVariable(name: "backtrace", scope: !173, file: !2, line: 112, type: !220, align: 8)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !221, identifier: "std_collections_list$std.os.backtrace.Backtrace$.List")
!221 = !{!222, !223, !224, !225}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !220, file: !2, line: 20, baseType: !21, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !220, file: !2, line: 21, baseType: !21, size: 64, align: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !220, file: !2, line: 22, baseType: !111, size: 128, align: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !220, file: !2, line: 23, baseType: !226, size: 64, align: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !227, size: 64, align: 64, dwarfAddressSpace: 0)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 88, baseType: !228, align: 8)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 9, size: 704, align: 64, elements: !229, identifier: "std.os.backtrace.Backtrace")
!229 = !{!230, !232, !233, !234, !235, !236, !237}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !228, file: !2, line: 11, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !22)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !228, file: !2, line: 12, baseType: !14, size: 128, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !228, file: !2, line: 13, baseType: !14, size: 128, align: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !228, file: !2, line: 14, baseType: !14, size: 128, align: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !228, file: !2, line: 15, baseType: !23, size: 32, align: 32, offset: 448)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !228, file: !2, line: 16, baseType: !111, size: 128, align: 64, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !228, file: !2, line: 17, baseType: !7, size: 8, align: 8, offset: 640)
!238 = !DILocation(line: 112, column: 17, scope: !173)
!239 = !DILocation(line: 112, column: 29, scope: !173)
!240 = !DILocation(line: 113, column: 12, scope: !173)
!241 = !DILocation(line: 106, column: 29, scope: !242)
!242 = distinct !DILexicalBlock(scope: !173, file: !2, line: 105, column: 2)
!243 = !DILocation(line: 107, column: 3, scope: !242)
!244 = !DILocation(line: 131, column: 11, scope: !242)
!245 = !DILocation(line: 547, column: 8, scope: !246, inlinedAt: !162)
!246 = distinct !DILexicalBlock(scope: !157, file: !101, line: 547, column: 8)
!247 = !DILocation(line: 114, column: 6, scope: !173)
!248 = !DILocation(line: 114, column: 25, scope: !173)
!249 = !DILocation(line: 106, column: 29, scope: !250)
!250 = distinct !DILexicalBlock(scope: !173, file: !2, line: 105, column: 2)
!251 = !DILocation(line: 107, column: 3, scope: !250)
!252 = !DILocation(line: 131, column: 11, scope: !250)
!253 = !DILocation(line: 547, column: 8, scope: !254, inlinedAt: !162)
!254 = distinct !DILexicalBlock(scope: !157, file: !101, line: 547, column: 8)
!255 = !DILocation(line: 206, column: 15, scope: !256, inlinedAt: !257)
!256 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !72, file: !72, line: 204, scopeLine: 204, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!257 = !DILocation(line: 115, column: 2, scope: !173)
!258 = !DILocation(line: 116, column: 24, scope: !259, inlinedAt: !260)
!259 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !72, file: !72, line: 112, scopeLine: 112, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!260 = !DILocation(line: 206, column: 2, scope: !256, inlinedAt: !257)
!261 = !DILocation(line: 116, column: 34, scope: !259, inlinedAt: !260)
!262 = !DILocation(line: 139, column: 11, scope: !259, inlinedAt: !260)
!263 = !DILocation(line: 206, column: 15, scope: !264, inlinedAt: !265)
!264 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !72, file: !72, line: 204, scopeLine: 204, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!265 = !DILocation(line: 116, column: 2, scope: !173)
!266 = !DILocation(line: 116, column: 24, scope: !267, inlinedAt: !268)
!267 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !72, file: !72, line: 112, scopeLine: 112, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!268 = !DILocation(line: 206, column: 2, scope: !264, inlinedAt: !265)
!269 = !DILocation(line: 116, column: 34, scope: !267, inlinedAt: !268)
!270 = !DILocation(line: 139, column: 11, scope: !267, inlinedAt: !268)
!271 = !DILocation(line: 216, column: 16, scope: !272, inlinedAt: !273)
!272 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !72, file: !72, line: 214, scopeLine: 214, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!273 = !DILocation(line: 117, column: 2, scope: !173)
!274 = !DILocalVariable(name: "len", scope: !275, file: !2, line: 172, type: !21, align: 8)
!275 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !72, file: !72, line: 170, scopeLine: 170, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42, retainedNodes: !58)
!276 = !DILocation(line: 172, column: 6, scope: !275, inlinedAt: !277)
!277 = !DILocation(line: 216, column: 2, scope: !272, inlinedAt: !273)
!278 = !DILocation(line: 116, column: 24, scope: !279, inlinedAt: !280)
!279 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !72, file: !72, line: 112, scopeLine: 112, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!280 = !DILocation(line: 172, column: 12, scope: !275, inlinedAt: !277)
!281 = !DILocation(line: 116, column: 34, scope: !279, inlinedAt: !280)
!282 = !DILocation(line: 139, column: 11, scope: !279, inlinedAt: !280)
