; ModuleID = 'std::io::file'
source_filename = "std::io::file"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%File = type { ptr }
%PathImp = type { %"char[]", i32, %any }
%"any[]" = type { ptr, i64 }

$std.io.File.reopen = comdat any

$std.io.File.seek = comdat any

$std.io.File.write_byte = comdat any

$std.io.File.close = comdat any

$std.io.File.eof = comdat any

$std.io.File.read = comdat any

$std.io.File.write = comdat any

$std.io.File.read_byte = comdat any

$std.io.File.flush = comdat any

$std.io.File.fd = comdat any

$std.io.File.isatty = comdat any

$std.io.file.open = comdat any

$std.io.file.open_path = comdat any

$std.io.file.exists = comdat any

$std.io.file.from_handle = comdat any

$std.io.file.is_file = comdat any

$std.io.file.is_dir = comdat any

$std.io.file.get_size = comdat any

$std.io.file.delete = comdat any

$std.io.file.load_buffer = comdat any

$std.io.file.load = comdat any

$std.io.file.load_path = comdat any

$std.io.file.load_temp = comdat any

$std.io.file.load_path_temp = comdat any

$std.io.file.save = comdat any

$.dyn_search = comdat any

$std.io.OVERFLOW = comdat any

$"$ct.ulong" = comdat any

$"$sel.acquire" = comdat any

$"$sel.release" = comdat any

$std.io.FILE_NOT_VALID = comdat any

$std.io.INTERRUPTED = comdat any


!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIE Level", i32 2}
!4 = !{i32 4, !"PIC Level", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = !{i32 2, !"frame-pointer", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !8, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, splitDebugInlining: false)
!8 = !DIFile(filename: "file.c3", directory: "/usr/lib/c3c/lib/std/io")
!9 = !{!10, !16}
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Seek", scope: !8, file: !8, line: 7, baseType: !11, size: 32, align: 32, elements: !12)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !{!13, !14, !15}
!13 = !DIEnumerator(name: "SET", value: 0)
!14 = !DIEnumerator(name: "CURSOR", value: 1)
!15 = !DIEnumerator(name: "END", value: 2)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !17, file: !8, line: 23, baseType: !11, size: 32, align: 32, elements: !37)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !8, file: !8, line: 16, size: 320, align: 64, elements: !18, identifier: "std.io.path.PathImp")
!18 = !{!19, !29, !30}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !17, file: !8, line: 18, baseType: !20, size: 128, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !22, identifier: "char[]")
!22 = !{!23, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !21, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !21, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !28)
!28 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !17, file: !8, line: 19, baseType: !16, size: 32, align: 32, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !17, file: !8, line: 20, baseType: !31, size: 128, align: 64, offset: 192)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !32, identifier: "Allocator")
!32 = !{!33, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !31, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !31, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!37 = !{!38, !39}
!38 = !DIEnumerator(name: "WIN32", value: 0)
!39 = !DIEnumerator(name: "POSIX", value: 1)
!40 = distinct !DISubprogram(name: "reopen", linkageName: "std.io.File.reopen", scope: !8, file: !8, line: 56, type: !41, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !34, !45, !20, !20}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !44)
!44 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "File*", baseType: !46, size: 64, align: 64, dwarfAddressSpace: 0)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !8, file: !8, line: 4, size: 64, align: 64, elements: !47, identifier: "std.io.File")
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !46, file: !8, line: 6, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !8, file: !8, line: 374, baseType: !34, align: 8)
!50 = !{}
!51 = !DILocation(line: 57, column: 1, scope: !40)
!52 = !DILocalVariable(name: "self", arg: 1, scope: !40, file: !8, line: 56, type: !45)
!53 = !DILocation(line: 56, column: 22, scope: !40)
!54 = !DILocalVariable(name: "filename", arg: 2, scope: !40, file: !8, line: 56, type: !20)
!55 = !DILocation(line: 56, column: 36, scope: !40)
!56 = !DILocalVariable(name: "mode", arg: 3, scope: !40, file: !8, line: 56, type: !20)
!57 = !DILocation(line: 56, column: 53, scope: !40)
!58 = !DILocation(line: 54, column: 11, scope: !59)
!59 = distinct !DILexicalBlock(scope: !40, file: !8, line: 57, column: 1)
!60 = !DILocation(line: 58, column: 2, scope: !40)
!61 = !DILocation(line: 58, column: 33, scope: !40)
!62 = !DILocation(line: 58, column: 44, scope: !40)
!63 = !DILocation(line: 58, column: 54, scope: !40)
!64 = !DILocation(line: 39, column: 11, scope: !40)
!65 = !DILocation(line: 58, column: 14, scope: !40)
!66 = !DILocation(line: 40, column: 11, scope: !40)
!67 = distinct !DISubprogram(name: "seek", linkageName: "std.io.File.seek", scope: !8, file: !8, line: 64, type: !68, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!68 = !DISubroutineType(types: !69)
!69 = !{!43, !70, !45, !44, !10}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!71 = !DILocation(line: 65, column: 1, scope: !67)
!72 = !DILocalVariable(name: "self", arg: 1, scope: !67, file: !8, line: 64, type: !45)
!73 = !DILocation(line: 64, column: 19, scope: !67)
!74 = !DILocalVariable(name: "offset", arg: 2, scope: !67, file: !8, line: 64, type: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !44)
!76 = !DILocation(line: 64, column: 30, scope: !67)
!77 = !DILocalVariable(name: "seek_mode", arg: 3, scope: !67, file: !8, line: 64, type: !10)
!78 = !DILocation(line: 64, column: 43, scope: !67)
!79 = !DILocation(line: 62, column: 11, scope: !80)
!80 = distinct !DILexicalBlock(scope: !67, file: !8, line: 65, column: 1)
!81 = !DILocation(line: 66, column: 19, scope: !67)
!82 = !DILocation(line: 66, column: 38, scope: !67)
!83 = !DILocation(line: 66, column: 2, scope: !67)
!84 = !DILocation(line: 67, column: 26, scope: !67)
!85 = !DILocation(line: 67, column: 9, scope: !67)
!86 = distinct !DISubprogram(name: "write_byte", linkageName: "std.io.File.write_byte", scope: !8, file: !8, line: 90, type: !87, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!87 = !DISubroutineType(types: !88)
!88 = !{!43, !34, !45, !25}
!89 = !DILocation(line: 91, column: 1, scope: !86)
!90 = !DILocalVariable(name: "self", arg: 1, scope: !86, file: !8, line: 90, type: !45)
!91 = !DILocation(line: 90, column: 26, scope: !86)
!92 = !DILocalVariable(name: "c", arg: 2, scope: !86, file: !8, line: 90, type: !25)
!93 = !DILocation(line: 90, column: 38, scope: !86)
!94 = !DILocation(line: 88, column: 11, scope: !95)
!95 = distinct !DILexicalBlock(scope: !86, file: !8, line: 91, column: 1)
!96 = !DILocation(line: 92, column: 26, scope: !86)
!97 = !DILocation(line: 92, column: 29, scope: !86)
!98 = !DILocation(line: 92, column: 9, scope: !86)
!99 = distinct !DISubprogram(name: "close", linkageName: "std.io.File.close", scope: !8, file: !8, line: 98, type: !100, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!100 = !DISubroutineType(types: !101)
!101 = !{!43, !34, !45}
!102 = !DILocation(line: 99, column: 1, scope: !99)
!103 = !DILocalVariable(name: "self", arg: 1, scope: !99, file: !8, line: 98, type: !45)
!104 = !DILocation(line: 98, column: 21, scope: !99)
!105 = !DILocation(line: 100, column: 6, scope: !99)
!106 = !DILocation(line: 100, column: 32, scope: !99)
!107 = !DILocation(line: 100, column: 19, scope: !99)
!108 = !DILocation(line: 102, column: 11, scope: !109)
!109 = distinct !DILexicalBlock(scope: !110, file: !8, line: 102, column: 3)
!110 = distinct !DILexicalBlock(scope: !99, file: !8, line: 101, column: 2)
!111 = !DILocation(line: 105, column: 30, scope: !112)
!112 = distinct !DILexicalBlock(scope: !109, file: !8, line: 105, column: 23)
!113 = !DILocation(line: 106, column: 30, scope: !114)
!114 = distinct !DILexicalBlock(scope: !109, file: !8, line: 106, column: 23)
!115 = !DILocation(line: 114, column: 28, scope: !116)
!116 = distinct !DILexicalBlock(scope: !109, file: !8, line: 114, column: 21)
!117 = !DILocation(line: 115, column: 20, scope: !118)
!118 = distinct !DILexicalBlock(scope: !109, file: !8, line: 115, column: 13)
!119 = !DILocation(line: 118, column: 2, scope: !99)
!120 = !DILocation(line: 118, column: 14, scope: !99)
!121 = distinct !DISubprogram(name: "eof", linkageName: "std.io.File.eof", scope: !8, file: !8, line: 124, type: !122, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !45}
!124 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!125 = !DILocation(line: 125, column: 1, scope: !121)
!126 = !DILocalVariable(name: "self", arg: 1, scope: !121, file: !8, line: 124, type: !45)
!127 = !DILocation(line: 124, column: 18, scope: !121)
!128 = !DILocation(line: 122, column: 11, scope: !129)
!129 = distinct !DILexicalBlock(scope: !121, file: !8, line: 125, column: 1)
!130 = !DILocation(line: 126, column: 20, scope: !121)
!131 = !DILocation(line: 126, column: 9, scope: !121)
!132 = distinct !DISubprogram(name: "read", linkageName: "std.io.File.read", scope: !8, file: !8, line: 132, type: !133, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!133 = !DISubroutineType(types: !134)
!134 = !{!43, !70, !45, !21}
!135 = !DILocation(line: 133, column: 1, scope: !132)
!136 = !DILocalVariable(name: "self", arg: 1, scope: !132, file: !8, line: 132, type: !45)
!137 = !DILocation(line: 132, column: 19, scope: !132)
!138 = !DILocalVariable(name: "buffer", arg: 2, scope: !132, file: !8, line: 132, type: !21)
!139 = !DILocation(line: 132, column: 33, scope: !132)
!140 = !DILocation(line: 134, column: 26, scope: !132)
!141 = !DILocation(line: 134, column: 9, scope: !132)
!142 = distinct !DISubprogram(name: "write", linkageName: "std.io.File.write", scope: !8, file: !8, line: 141, type: !133, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!143 = !DILocation(line: 142, column: 1, scope: !142)
!144 = !DILocalVariable(name: "self", arg: 1, scope: !142, file: !8, line: 141, type: !45)
!145 = !DILocation(line: 141, column: 20, scope: !142)
!146 = !DILocalVariable(name: "buffer", arg: 2, scope: !142, file: !8, line: 141, type: !21)
!147 = !DILocation(line: 141, column: 34, scope: !142)
!148 = !DILocation(line: 139, column: 11, scope: !149)
!149 = distinct !DILexicalBlock(scope: !142, file: !8, line: 142, column: 1)
!150 = !DILocation(line: 143, column: 27, scope: !142)
!151 = !DILocation(line: 143, column: 9, scope: !142)
!152 = distinct !DISubprogram(name: "read_byte", linkageName: "std.io.File.read_byte", scope: !8, file: !8, line: 156, type: !153, scopeLine: 156, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!153 = !DISubroutineType(types: !154)
!154 = !{!43, !24, !45}
!155 = !DILocation(line: 157, column: 1, scope: !152)
!156 = !DILocalVariable(name: "self", arg: 1, scope: !152, file: !8, line: 156, type: !45)
!157 = !DILocation(line: 156, column: 25, scope: !152)
!158 = !DILocalVariable(name: "c", scope: !152, file: !8, line: 158, type: !11, align: 4)
!159 = !DILocation(line: 158, column: 6, scope: !152)
!160 = !DILocation(line: 158, column: 22, scope: !152)
!161 = !DILocation(line: 158, column: 10, scope: !152)
!162 = !DILocation(line: 159, column: 6, scope: !152)
!163 = !DILocation(line: 159, column: 22, scope: !152)
!164 = !DILocation(line: 160, column: 9, scope: !152)
!165 = distinct !DISubprogram(name: "flush", linkageName: "std.io.File.flush", scope: !8, file: !8, line: 222, type: !100, scopeLine: 222, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!166 = !DILocation(line: 223, column: 1, scope: !165)
!167 = !DILocalVariable(name: "self", arg: 1, scope: !165, file: !8, line: 222, type: !45)
!168 = !DILocation(line: 222, column: 21, scope: !165)
!169 = !DILocation(line: 220, column: 11, scope: !170)
!170 = distinct !DILexicalBlock(scope: !165, file: !8, line: 223, column: 1)
!171 = !DILocation(line: 224, column: 15, scope: !165)
!172 = !DILocation(line: 224, column: 2, scope: !165)
!173 = distinct !DISubprogram(name: "fd", linkageName: "std.io.File.fd", scope: !8, file: !8, line: 146, type: !174, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !46}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "Fd", scope: !8, file: !8, line: 53, baseType: !11, align: 4)
!177 = !DILocalVariable(name: "self", arg: 1, scope: !173, file: !8, line: 146, type: !46)
!178 = !DILocation(line: 146, column: 15, scope: !173)
!179 = !DILocation(line: 148, column: 22, scope: !173)
!180 = !DILocation(line: 148, column: 9, scope: !173)
!181 = distinct !DISubprogram(name: "isatty", linkageName: "std.io.File.isatty", scope: !8, file: !8, line: 151, type: !182, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!182 = !DISubroutineType(types: !183)
!183 = !{!124, !46}
!184 = !DILocalVariable(name: "self", arg: 1, scope: !181, file: !8, line: 151, type: !46)
!185 = !DILocation(line: 151, column: 21, scope: !181)
!186 = !DILocation(line: 153, column: 22, scope: !181)
!187 = !DILocation(line: 153, column: 9, scope: !181)
!188 = distinct !DISubprogram(name: "open", linkageName: "std.io.file.open", scope: !8, file: !8, line: 12, type: !189, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!189 = !DISubroutineType(types: !190)
!190 = !{!43, !45, !20, !20}
!191 = !DILocalVariable(name: "filename", arg: 1, scope: !188, file: !8, line: 12, type: !20)
!192 = !DILocation(line: 12, column: 22, scope: !188)
!193 = !DILocalVariable(name: "mode", arg: 2, scope: !188, file: !8, line: 12, type: !20)
!194 = !DILocation(line: 12, column: 39, scope: !188)
!195 = !DILocation(line: 14, column: 38, scope: !188)
!196 = !DILocation(line: 14, column: 48, scope: !188)
!197 = !DILocation(line: 5, column: 11, scope: !188)
!198 = !DILocation(line: 14, column: 21, scope: !188)
!199 = !DILocation(line: 6, column: 11, scope: !188)
!200 = !DILocation(line: 14, column: 9, scope: !188)
!201 = distinct !DISubprogram(name: "open_path", linkageName: "std.io.file.open_path", scope: !8, file: !8, line: 17, type: !202, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!202 = !DISubroutineType(types: !203)
!203 = !{!43, !45, !17, !20}
!204 = !DILocalVariable(name: "path", arg: 1, scope: !201, file: !8, line: 17, type: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "Path", scope: !8, file: !8, line: 14, baseType: !17, align: 8)
!206 = !DILocation(line: 17, column: 25, scope: !201)
!207 = !DILocalVariable(name: "mode", arg: 2, scope: !201, file: !8, line: 17, type: !20)
!208 = !DILocation(line: 17, column: 38, scope: !201)
!209 = !DILocation(line: 19, column: 38, scope: !201)
!210 = !DILocation(line: 19, column: 55, scope: !201)
!211 = !DILocation(line: 5, column: 11, scope: !201)
!212 = !DILocation(line: 19, column: 21, scope: !201)
!213 = !DILocation(line: 6, column: 11, scope: !201)
!214 = !DILocation(line: 19, column: 9, scope: !201)
!215 = distinct !DISubprogram(name: "exists", linkageName: "std.io.file.exists", scope: !8, file: !8, line: 22, type: !216, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!216 = !DISubroutineType(types: !217)
!217 = !{!124, !20}
!218 = !DILocalVariable(name: "file", arg: 1, scope: !215, file: !8, line: 22, type: !20)
!219 = !DILocation(line: 22, column: 23, scope: !215)
!220 = !DILocalVariable(name: "state", scope: !221, file: !8, line: 594, type: !223, align: 8)
!221 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !222, file: !222, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !50)
!222 = !DIFile(filename: "mem.c3", directory: "/usr/lib/c3c/lib/std/core")
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !8, file: !8, line: 402, baseType: !224, align: 8)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !225, size: 64, align: 64, dwarfAddressSpace: 0)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !8, file: !8, line: 32, size: 512, align: 64, elements: !226, identifier: "std.core.mem.allocator.TempAllocator")
!226 = !{!227, !228, !240, !241, !242, !243, !244, !245}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !225, file: !8, line: 34, baseType: !31, size: 128, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !225, file: !8, line: 35, baseType: !229, size: 64, align: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !230, size: 64, align: 64, dwarfAddressSpace: 0)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !8, file: !8, line: 52, size: 256, align: 64, elements: !231, identifier: "std.core.mem.allocator.TempAllocatorPage")
!231 = !{!232, !233, !234, !235, !236}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !230, file: !8, line: 54, baseType: !229, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !230, file: !8, line: 55, baseType: !34, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !230, file: !8, line: 56, baseType: !27, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !230, file: !8, line: 57, baseType: !27, size: 64, align: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !230, file: !8, line: 58, baseType: !237, align: 8, offset: 256)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, align: 8, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 0, lowerBound: 0)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !225, file: !8, line: 36, baseType: !224, size: 64, align: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !225, file: !8, line: 37, baseType: !124, size: 8, align: 8, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !225, file: !8, line: 38, baseType: !27, size: 64, align: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !225, file: !8, line: 39, baseType: !27, size: 64, align: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !225, file: !8, line: 40, baseType: !27, size: 64, align: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !225, file: !8, line: 41, baseType: !237, align: 8, offset: 512)
!246 = !DILocation(line: 594, column: 12, scope: !221, inlinedAt: !247)
!247 = !DILocation(line: 22, column: 32, scope: !215)
!248 = !DILocation(line: 594, column: 20, scope: !221, inlinedAt: !247)
!249 = !DILocation(line: 24, column: 39, scope: !250)
!250 = distinct !DILexicalBlock(scope: !215, file: !8, line: 23, column: 1)
!251 = !DILocation(line: 24, column: 9, scope: !250)
!252 = !DILocation(line: 597, column: 23, scope: !253, inlinedAt: !247)
!253 = distinct !DILexicalBlock(scope: !221, file: !222, line: 596, column: 2)
!254 = !DILocation(line: 597, column: 3, scope: !253, inlinedAt: !247)
!255 = distinct !DISubprogram(name: "from_handle", linkageName: "std.io.file.from_handle", scope: !8, file: !8, line: 27, type: !256, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!256 = !DISubroutineType(types: !257)
!257 = !{!46, !34}
!258 = !DILocalVariable(name: "file", arg: 1, scope: !255, file: !8, line: 27, type: !49)
!259 = !DILocation(line: 27, column: 27, scope: !255)
!260 = !DILocation(line: 29, column: 19, scope: !255)
!261 = distinct !DISubprogram(name: "is_file", linkageName: "std.io.file.is_file", scope: !8, file: !8, line: 32, type: !216, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!262 = !DILocalVariable(name: "path", arg: 1, scope: !261, file: !8, line: 32, type: !20)
!263 = !DILocation(line: 32, column: 24, scope: !261)
!264 = !DILocation(line: 34, column: 28, scope: !261)
!265 = !DILocation(line: 34, column: 9, scope: !261)
!266 = distinct !DISubprogram(name: "is_dir", linkageName: "std.io.file.is_dir", scope: !8, file: !8, line: 37, type: !216, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!267 = !DILocalVariable(name: "path", arg: 1, scope: !266, file: !8, line: 37, type: !20)
!268 = !DILocation(line: 37, column: 23, scope: !266)
!269 = !DILocation(line: 39, column: 27, scope: !266)
!270 = !DILocation(line: 39, column: 9, scope: !266)
!271 = distinct !DISubprogram(name: "get_size", linkageName: "std.io.file.get_size", scope: !8, file: !8, line: 42, type: !272, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!272 = !DISubroutineType(types: !273)
!273 = !{!43, !274, !20}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ulong*", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!275 = !DILocalVariable(name: "path", arg: 1, scope: !271, file: !8, line: 42, type: !20)
!276 = !DILocation(line: 42, column: 25, scope: !271)
!277 = !DILocation(line: 44, column: 9, scope: !271)
!278 = distinct !DISubprogram(name: "delete", linkageName: "std.io.file.delete", scope: !8, file: !8, line: 47, type: !279, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!279 = !DISubroutineType(types: !280)
!280 = !{!43, !34, !20}
!281 = !DILocalVariable(name: "filename", arg: 1, scope: !278, file: !8, line: 47, type: !20)
!282 = !DILocation(line: 47, column: 24, scope: !278)
!283 = !DILocation(line: 49, column: 27, scope: !278)
!284 = !DILocation(line: 49, column: 9, scope: !278)
!285 = distinct !DISubprogram(name: "load_buffer", linkageName: "std.io.file.load_buffer", scope: !8, file: !8, line: 170, type: !286, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !50)
!286 = !DISubroutineType(types: !287)
!287 = !{!43, !288, !20, !21}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char[]*", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!289 = !DILocalVariable(name: "filename", arg: 1, scope: !285, file: !8, line: 170, type: !20)
!290 = !DILocation(line: 170, column: 31, scope: !285)
!291 = !DILocalVariable(name: "buffer", arg: 2, scope: !285, file: !8, line: 170, type: !21)
