; ModuleID = 'std::os::linux'
source_filename = "std::os::linux"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%Backtrace = type { i64, %"char[]", %"char[]", %"char[]", i32, %any, i8 }
%any = type { ptr, i64 }
%File = type { ptr }
%Elf64_Ehdr = type { [16 x i8], i16, i16, i32, i64, i64, i64, i32, i16, i16, i16, i16, i16, i16 }
%"any[]" = type { ptr, i64 }
%Elf64_Phdr = type { i32, i32, i64, i64, i64, i64, i64, i64 }
%Elf32_Ehdr = type { [16 x i8], i16, i16, i32, i32, i32, i32, i32, i16, i16, i16, i16, i16, i16 }
%Elf32_Phdr = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%"char[][]" = type { ptr, i64 }
%Linux_Dl_info = type { ptr, ptr, ptr, ptr }
%"void*[]" = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }

$std.os.linux.backtrace_line_parse = comdat any

$std.os.linux.symbolize_backtrace = comdat any

$"$ct.std.os.linux.Elf32_Ehdr" = comdat any

$"$ct.std.os.linux.Elf32_Phdr" = comdat any

$"$ct.std.os.linux.Elf64_Ehdr" = comdat any

$"$ct.std.os.linux.Elf64_Phdr" = comdat any

$"$ct.std.os.linux.Linux_Dl_info" = comdat any

$std.os.linux.PT_PHDR = comdat any

$std.os.linux.EI_NIDENT = comdat any

$std.io.UNEXPECTED_EOF = comdat any

$std.os.backtrace.IMAGE_NOT_FOUND = comdat any

$"$ct.ulong" = comdat any

$"$ct.int" = comdat any

$"$ct.p$void" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PT_PHDR", linkageName: "std.os.linux.PT_PHDR", scope: !2, file: !2, line: 6, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "linux.c3", directory: "/usr/lib/c3c/lib/std/os/linux")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "EI_NIDENT", linkageName: "std.os.linux.EI_NIDENT", scope: !2, file: !2, line: 7, type: !3, isLocal: false, isDefinition: true, align: 4)
!6 = !{i32 2, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 2, !"wchar_size", i32 4}
!9 = !{i32 4, !"PIE Level", i32 2}
!10 = !{i32 4, !"PIC Level", i32 2}
!11 = !{i32 1, !"uwtable", i32 2}
!12 = !{i32 2, !"frame-pointer", i32 2}
!13 = distinct !DICompileUnit(language: DW_LANG_C11, file: !14, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !15, splitDebugInlining: false)
!14 = !DIFile(filename: "heap.c3", directory: "/usr/lib/c3c/lib/std/os/linux")
!15 = !{!0, !4}
!16 = distinct !DISubprogram(name: "elf_module_image_base", linkageName: "std.os.linux.elf_module_image_base", scope: !2, file: !2, line: 92, type: !17, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !31)
!17 = !DISubroutineType(types: !18)
!18 = !{!19, !21, !23}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !20)
!20 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ulong*", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !25, identifier: "char[]")
!25 = !{!26, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !24, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !24, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !22)
!31 = !{}
!32 = !DILocalVariable(name: "path", arg: 1, scope: !16, file: !2, line: 92, type: !23)
!33 = !DILocation(line: 92, column: 40, scope: !16)
!34 = !DILocalVariable(name: "file", scope: !16, file: !2, line: 94, type: !35, align: 8)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !2, file: !2, line: 4, size: 64, align: 64, elements: !36, identifier: "std.io.File")
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !35, file: !2, line: 6, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !2, file: !2, line: 374, baseType: !39, align: 8)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!40 = !DILocation(line: 94, column: 7, scope: !16)
!41 = !DILocation(line: 94, column: 14, scope: !16)
!42 = !DILocalVariable(name: "buffer", scope: !16, file: !2, line: 96, type: !43, align: 1)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32, align: 8, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 4, lowerBound: 0)
!46 = !DILocation(line: 96, column: 10, scope: !16)
!47 = !DILocation(line: 97, column: 23, scope: !16)
!48 = !DILocation(line: 74, column: 6, scope: !49, inlinedAt: !51)
!49 = distinct !DISubprogram(name: "read_all", linkageName: "read_all", scope: !50, file: !50, line: 72, scopeLine: 72, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !31)
!50 = !DIFile(filename: "stream.c3", directory: "/usr/lib/c3c/lib/std/io")
!51 = !DILocation(line: 97, column: 2, scope: !16)
!52 = !DILocation(line: 74, column: 30, scope: !49, inlinedAt: !51)
!53 = !DILocalVariable(name: "n", scope: !49, file: !2, line: 75, type: !30, align: 8)
!54 = !DILocation(line: 75, column: 6, scope: !49, inlinedAt: !51)
!55 = !DILocation(line: 75, column: 10, scope: !49, inlinedAt: !51)
!56 = !DILocation(line: 76, column: 6, scope: !49, inlinedAt: !51)
!57 = !DILocation(line: 76, column: 11, scope: !49, inlinedAt: !51)
!58 = !DILocation(line: 76, column: 30, scope: !49, inlinedAt: !51)
!59 = !DILocation(line: 77, column: 9, scope: !49, inlinedAt: !51)
!60 = !DILocation(line: 95, column: 8, scope: !61)
!61 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!62 = !DILocation(line: 98, column: 6, scope: !16)
!63 = !DILocation(line: 95, column: 8, scope: !64)
!64 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!65 = !DILocalVariable(name: "is_64", scope: !16, file: !2, line: 99, type: !66, align: 1)
!66 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!67 = !DILocation(line: 99, column: 7, scope: !16)
!68 = !DILocation(line: 99, column: 15, scope: !16)
!69 = !DILocation(line: 95, column: 8, scope: !70)
!70 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!71 = !DILocalVariable(name: "is_little_endian", scope: !16, file: !2, line: 100, type: !66, align: 1)
!72 = !DILocation(line: 100, column: 7, scope: !16)
!73 = !DILocation(line: 100, column: 26, scope: !16)
!74 = !DILocation(line: 95, column: 8, scope: !75)
!75 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!76 = !DILocation(line: 102, column: 7, scope: !16)
!77 = !DILocation(line: 95, column: 8, scope: !78)
!78 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!79 = !DILocation(line: 62, column: 11, scope: !16)
!80 = !DILocation(line: 103, column: 2, scope: !16)
!81 = !DILocation(line: 95, column: 8, scope: !82)
!82 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!83 = !DILocation(line: 104, column: 6, scope: !16)
!84 = !DILocalVariable(name: "file_header", scope: !85, file: !2, line: 106, type: !86, align: 8)
!85 = distinct !DILexicalBlock(scope: !16, file: !2, line: 105, column: 2)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "Elf64_Ehdr", scope: !2, file: !2, line: 52, size: 512, align: 64, elements: !87, identifier: "std.os.linux.Elf64_Ehdr")
!87 = !{!88, !92, !95, !96, !99, !101, !103, !104, !105, !106, !107, !108, !109, !110}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "e_ident", scope: !86, file: !2, line: 54, baseType: !89, size: 128, align: 8)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 128, align: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 16, lowerBound: 0)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "e_type", scope: !86, file: !2, line: 55, baseType: !93, size: 16, align: 16, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Half", scope: !2, file: !2, line: 44, baseType: !94, align: 2)
!94 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "e_machine", scope: !86, file: !2, line: 56, baseType: !93, size: 16, align: 16, offset: 144)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "e_version", scope: !86, file: !2, line: 57, baseType: !97, size: 32, align: 32, offset: 160)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Word", scope: !2, file: !2, line: 46, baseType: !98, align: 4)
!98 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "e_entry", scope: !86, file: !2, line: 58, baseType: !100, size: 64, align: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Addr", scope: !2, file: !2, line: 43, baseType: !22, align: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "e_phoff", scope: !86, file: !2, line: 59, baseType: !102, size: 64, align: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Off", scope: !2, file: !2, line: 45, baseType: !22, align: 8)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "e_shoff", scope: !86, file: !2, line: 60, baseType: !102, size: 64, align: 64, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "e_flags", scope: !86, file: !2, line: 61, baseType: !97, size: 32, align: 32, offset: 384)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "e_ehsize", scope: !86, file: !2, line: 62, baseType: !93, size: 16, align: 16, offset: 416)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "e_phentsize", scope: !86, file: !2, line: 63, baseType: !93, size: 16, align: 16, offset: 432)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "e_phnum", scope: !86, file: !2, line: 64, baseType: !93, size: 16, align: 16, offset: 448)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "e_shentsize", scope: !86, file: !2, line: 65, baseType: !93, size: 16, align: 16, offset: 464)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "e_shnum", scope: !86, file: !2, line: 66, baseType: !93, size: 16, align: 16, offset: 480)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "e_shstrndx", scope: !86, file: !2, line: 67, baseType: !93, size: 16, align: 16, offset: 496)
!111 = !DILocation(line: 106, column: 14, scope: !85)
!112 = !DILocation(line: 107, column: 23, scope: !85)
!113 = !DILocation(line: 54, column: 33, scope: !114, inlinedAt: !116)
!114 = distinct !DILexicalBlock(scope: !115, file: !50, line: 55, column: 1)
!115 = distinct !DISubprogram(name: "read_any", linkageName: "read_any", scope: !50, file: !50, line: 54, scopeLine: 54, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!116 = !DILocation(line: 107, column: 3, scope: !85)
!117 = !DILocation(line: 56, column: 27, scope: !115, inlinedAt: !116)
!118 = !DILocation(line: 56, column: 40, scope: !115, inlinedAt: !116)
!119 = !DILocation(line: 74, column: 6, scope: !120, inlinedAt: !121)
!120 = distinct !DISubprogram(name: "read_all", linkageName: "read_all", scope: !50, file: !50, line: 72, scopeLine: 72, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !31)
!121 = !DILocation(line: 56, column: 9, scope: !115, inlinedAt: !116)
!122 = !DILocation(line: 74, column: 30, scope: !120, inlinedAt: !121)
!123 = !DILocalVariable(name: "n", scope: !120, file: !2, line: 75, type: !30, align: 8)
!124 = !DILocation(line: 75, column: 6, scope: !120, inlinedAt: !121)
!125 = !DILocation(line: 75, column: 10, scope: !120, inlinedAt: !121)
!126 = !DILocation(line: 76, column: 6, scope: !120, inlinedAt: !121)
!127 = !DILocation(line: 76, column: 11, scope: !120, inlinedAt: !121)
!128 = !DILocation(line: 76, column: 30, scope: !120, inlinedAt: !121)
!129 = !DILocation(line: 77, column: 9, scope: !120, inlinedAt: !121)
!130 = !DILocation(line: 95, column: 8, scope: !131)
!131 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!132 = !DILocation(line: 108, column: 7, scope: !85)
!133 = !DILocation(line: 95, column: 8, scope: !134)
!134 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!135 = !DILocalVariable(name: "i", scope: !136, file: !2, line: 109, type: !137, align: 8)
!136 = distinct !DILexicalBlock(scope: !85, file: !2, line: 109, column: 3)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !20)
!138 = !DILocation(line: 109, column: 12, scope: !136)
!139 = !DILocation(line: 109, column: 16, scope: !136)
!140 = !DILocation(line: 109, column: 19, scope: !136)
!141 = !DILocation(line: 109, column: 23, scope: !136)
!142 = !DILocalVariable(name: "header", scope: !143, file: !2, line: 111, type: !144, align: 8)
!143 = distinct !DILexicalBlock(scope: !136, file: !2, line: 110, column: 3)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Elf64_Phdr", scope: !2, file: !2, line: 70, size: 448, align: 64, elements: !145, identifier: "std.os.linux.Elf64_Phdr")
!145 = !{!146, !147, !148, !149, !150, !151, !153, !154}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "p_type", scope: !144, file: !2, line: 72, baseType: !97, size: 32, align: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "p_flags", scope: !144, file: !2, line: 73, baseType: !97, size: 32, align: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "p_offset", scope: !144, file: !2, line: 74, baseType: !102, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "p_vaddr", scope: !144, file: !2, line: 75, baseType: !100, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "p_paddr", scope: !144, file: !2, line: 76, baseType: !100, size: 64, align: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "p_filesz", scope: !144, file: !2, line: 77, baseType: !152, size: 64, align: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Xword", scope: !2, file: !2, line: 50, baseType: !22, align: 8)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "p_memsz", scope: !144, file: !2, line: 78, baseType: !152, size: 64, align: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "p_align", scope: !144, file: !2, line: 79, baseType: !152, size: 64, align: 64, offset: 384)
!155 = !DILocation(line: 111, column: 15, scope: !143)
!156 = !DILocation(line: 112, column: 19, scope: !143)
!157 = !DILocation(line: 112, column: 46, scope: !143)
!158 = !DILocation(line: 112, column: 72, scope: !143)
!159 = !DILocation(line: 112, column: 41, scope: !143)
!160 = !DILocation(line: 112, column: 14, scope: !143)
!161 = !DILocation(line: 62, column: 11, scope: !143)
!162 = !DILocation(line: 112, column: 4, scope: !143)
!163 = !DILocation(line: 95, column: 8, scope: !164)
!164 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!165 = !DILocation(line: 113, column: 24, scope: !143)
!166 = !DILocation(line: 54, column: 33, scope: !167, inlinedAt: !169)
!167 = distinct !DILexicalBlock(scope: !168, file: !50, line: 55, column: 1)
!168 = distinct !DISubprogram(name: "read_any", linkageName: "read_any", scope: !50, file: !50, line: 54, scopeLine: 54, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!169 = !DILocation(line: 113, column: 4, scope: !143)
!170 = !DILocation(line: 56, column: 27, scope: !168, inlinedAt: !169)
!171 = !DILocation(line: 56, column: 40, scope: !168, inlinedAt: !169)
!172 = !DILocation(line: 74, column: 6, scope: !173, inlinedAt: !174)
!173 = distinct !DISubprogram(name: "read_all", linkageName: "read_all", scope: !50, file: !50, line: 72, scopeLine: 72, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !31)
!174 = !DILocation(line: 56, column: 9, scope: !168, inlinedAt: !169)
!175 = !DILocation(line: 74, column: 30, scope: !173, inlinedAt: !174)
!176 = !DILocalVariable(name: "n", scope: !173, file: !2, line: 75, type: !30, align: 8)
!177 = !DILocation(line: 75, column: 6, scope: !173, inlinedAt: !174)
!178 = !DILocation(line: 75, column: 10, scope: !173, inlinedAt: !174)
!179 = !DILocation(line: 76, column: 6, scope: !173, inlinedAt: !174)
!180 = !DILocation(line: 76, column: 11, scope: !173, inlinedAt: !174)
!181 = !DILocation(line: 76, column: 30, scope: !173, inlinedAt: !174)
!182 = !DILocation(line: 77, column: 9, scope: !173, inlinedAt: !174)
!183 = !DILocation(line: 95, column: 8, scope: !184)
!184 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!185 = !DILocation(line: 114, column: 8, scope: !143)
!186 = !DILocation(line: 114, column: 41, scope: !143)
!187 = !DILocation(line: 114, column: 58, scope: !143)
!188 = !DILocation(line: 95, column: 8, scope: !189)
!189 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!190 = !DILocation(line: 109, column: 44, scope: !136)
!191 = !DILocation(line: 95, column: 8, scope: !192)
!192 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!193 = !DILocalVariable(name: "file_header", scope: !16, file: !2, line: 118, type: !194, align: 4)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "Elf32_Ehdr", scope: !2, file: !2, line: 13, size: 416, align: 32, elements: !195, identifier: "std.os.linux.Elf32_Ehdr")
!195 = !{!196, !197, !199, !200, !202, !204, !206, !207, !208, !209, !210, !211, !212, !213}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "e_ident", scope: !194, file: !2, line: 15, baseType: !89, size: 128, align: 8)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "e_type", scope: !194, file: !2, line: 16, baseType: !198, size: 16, align: 16, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf32_Half", scope: !2, file: !2, line: 8, baseType: !94, align: 2)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "e_machine", scope: !194, file: !2, line: 17, baseType: !198, size: 16, align: 16, offset: 144)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "e_version", scope: !194, file: !2, line: 18, baseType: !201, size: 32, align: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf32_Word", scope: !2, file: !2, line: 9, baseType: !98, align: 4)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "e_entry", scope: !194, file: !2, line: 19, baseType: !203, size: 32, align: 32, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf32_Addr", scope: !2, file: !2, line: 10, baseType: !98, align: 4)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "e_phoff", scope: !194, file: !2, line: 20, baseType: !205, size: 32, align: 32, offset: 224)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf32_Off", scope: !2, file: !2, line: 11, baseType: !98, align: 4)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "e_shoff", scope: !194, file: !2, line: 21, baseType: !205, size: 32, align: 32, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "e_flags", scope: !194, file: !2, line: 22, baseType: !201, size: 32, align: 32, offset: 288)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "e_ehsize", scope: !194, file: !2, line: 23, baseType: !198, size: 16, align: 16, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "e_phentsize", scope: !194, file: !2, line: 24, baseType: !198, size: 16, align: 16, offset: 336)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "e_phnum", scope: !194, file: !2, line: 25, baseType: !198, size: 16, align: 16, offset: 352)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "e_shentsize", scope: !194, file: !2, line: 26, baseType: !198, size: 16, align: 16, offset: 368)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "e_shnum", scope: !194, file: !2, line: 27, baseType: !198, size: 16, align: 16, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "e_shstrndx", scope: !194, file: !2, line: 28, baseType: !198, size: 16, align: 16, offset: 400)
!214 = !DILocation(line: 118, column: 13, scope: !16)
!215 = !DILocation(line: 119, column: 22, scope: !16)
!216 = !DILocation(line: 54, column: 33, scope: !217, inlinedAt: !219)
!217 = distinct !DILexicalBlock(scope: !218, file: !50, line: 55, column: 1)
!218 = distinct !DISubprogram(name: "read_any", linkageName: "read_any", scope: !50, file: !50, line: 54, scopeLine: 54, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!219 = !DILocation(line: 119, column: 2, scope: !16)
!220 = !DILocation(line: 56, column: 27, scope: !218, inlinedAt: !219)
!221 = !DILocation(line: 56, column: 40, scope: !218, inlinedAt: !219)
!222 = !DILocation(line: 74, column: 6, scope: !223, inlinedAt: !224)
!223 = distinct !DISubprogram(name: "read_all", linkageName: "read_all", scope: !50, file: !50, line: 72, scopeLine: 72, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !31)
!224 = !DILocation(line: 56, column: 9, scope: !218, inlinedAt: !219)
!225 = !DILocation(line: 74, column: 30, scope: !223, inlinedAt: !224)
!226 = !DILocalVariable(name: "n", scope: !223, file: !2, line: 75, type: !30, align: 8)
!227 = !DILocation(line: 75, column: 6, scope: !223, inlinedAt: !224)
!228 = !DILocation(line: 75, column: 10, scope: !223, inlinedAt: !224)
!229 = !DILocation(line: 76, column: 6, scope: !223, inlinedAt: !224)
!230 = !DILocation(line: 76, column: 11, scope: !223, inlinedAt: !224)
!231 = !DILocation(line: 76, column: 30, scope: !223, inlinedAt: !224)
!232 = !DILocation(line: 77, column: 9, scope: !223, inlinedAt: !224)
!233 = !DILocation(line: 95, column: 8, scope: !234)
!234 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!235 = !DILocation(line: 120, column: 6, scope: !16)
!236 = !DILocation(line: 95, column: 8, scope: !237)
!237 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!238 = !DILocalVariable(name: "i", scope: !239, file: !2, line: 121, type: !137, align: 8)
!239 = distinct !DILexicalBlock(scope: !16, file: !2, line: 121, column: 2)
!240 = !DILocation(line: 121, column: 11, scope: !239)
!241 = !DILocation(line: 121, column: 15, scope: !239)
!242 = !DILocation(line: 121, column: 18, scope: !239)
!243 = !DILocation(line: 121, column: 22, scope: !239)
!244 = !DILocalVariable(name: "header", scope: !245, file: !2, line: 123, type: !246, align: 4)
!245 = distinct !DILexicalBlock(scope: !239, file: !2, line: 122, column: 2)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "Elf32_Phdr", scope: !2, file: !2, line: 31, size: 256, align: 32, elements: !247, identifier: "std.os.linux.Elf32_Phdr")
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "p_type", scope: !246, file: !2, line: 33, baseType: !201, size: 32, align: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "p_offset", scope: !246, file: !2, line: 34, baseType: !205, size: 32, align: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "p_vaddr", scope: !246, file: !2, line: 35, baseType: !203, size: 32, align: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "p_paddr", scope: !246, file: !2, line: 36, baseType: !203, size: 32, align: 32, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "p_filesz", scope: !246, file: !2, line: 37, baseType: !201, size: 32, align: 32, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "p_memsz", scope: !246, file: !2, line: 38, baseType: !201, size: 32, align: 32, offset: 160)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "p_flags", scope: !246, file: !2, line: 39, baseType: !201, size: 32, align: 32, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "p_align", scope: !246, file: !2, line: 40, baseType: !201, size: 32, align: 32, offset: 224)
!256 = !DILocation(line: 123, column: 14, scope: !245)
!257 = !DILocation(line: 124, column: 13, scope: !245)
!258 = !DILocation(line: 124, column: 40, scope: !245)
!259 = !DILocation(line: 124, column: 66, scope: !245)
!260 = !DILocation(line: 124, column: 35, scope: !245)
!261 = !DILocation(line: 62, column: 11, scope: !245)
!262 = !DILocation(line: 124, column: 3, scope: !245)
!263 = !DILocation(line: 95, column: 8, scope: !264)
!264 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!265 = !DILocation(line: 125, column: 23, scope: !245)
!266 = !DILocation(line: 54, column: 33, scope: !267, inlinedAt: !269)
!267 = distinct !DILexicalBlock(scope: !268, file: !50, line: 55, column: 1)
!268 = distinct !DISubprogram(name: "read_any", linkageName: "read_any", scope: !50, file: !50, line: 54, scopeLine: 54, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!269 = !DILocation(line: 125, column: 3, scope: !245)
!270 = !DILocation(line: 56, column: 27, scope: !268, inlinedAt: !269)
!271 = !DILocation(line: 56, column: 40, scope: !268, inlinedAt: !269)
!272 = !DILocation(line: 74, column: 6, scope: !273, inlinedAt: !274)
!273 = distinct !DISubprogram(name: "read_all", linkageName: "read_all", scope: !50, file: !50, line: 72, scopeLine: 72, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !31)
!274 = !DILocation(line: 56, column: 9, scope: !268, inlinedAt: !269)
!275 = !DILocation(line: 74, column: 30, scope: !273, inlinedAt: !274)
!276 = !DILocalVariable(name: "n", scope: !273, file: !2, line: 75, type: !30, align: 8)
!277 = !DILocation(line: 75, column: 6, scope: !273, inlinedAt: !274)
!278 = !DILocation(line: 75, column: 10, scope: !273, inlinedAt: !274)
!279 = !DILocation(line: 76, column: 6, scope: !273, inlinedAt: !274)
!280 = !DILocation(line: 76, column: 11, scope: !273, inlinedAt: !274)
!281 = !DILocation(line: 76, column: 30, scope: !273, inlinedAt: !274)
!282 = !DILocation(line: 77, column: 9, scope: !273, inlinedAt: !274)
!283 = !DILocation(line: 95, column: 8, scope: !284)
!284 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!285 = !DILocation(line: 126, column: 7, scope: !245)
!286 = !DILocation(line: 126, column: 47, scope: !245)
!287 = !DILocation(line: 126, column: 64, scope: !245)
!288 = !DILocation(line: 126, column: 40, scope: !245)
!289 = !DILocation(line: 95, column: 8, scope: !290)
!290 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!291 = !DILocation(line: 121, column: 43, scope: !239)
!292 = !DILocation(line: 95, column: 8, scope: !293)
!293 = distinct !DILexicalBlock(scope: !16, file: !2, line: 95, column: 8)
!294 = distinct !DISubprogram(name: "backtrace_add_from_exec", linkageName: "std.os.linux.backtrace_add_from_exec", scope: !2, file: !2, line: 131, type: !295, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !31)
!295 = !DISubroutineType(types: !296)
!296 = !{!19, !39, !297, !302, !39}
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !298, identifier: "Allocator")
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !297, baseType: !39, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, baseType: !301, size: 64, align: 64, offset: 64)
!301 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "List*", baseType: !303, size: 64, align: 64, dwarfAddressSpace: 0)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !304, identifier: "std_collections_list$std.os.backtrace.Backtrace$.List")
!304 = !{!305, !306, !307, !308}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !303, file: !2, line: 20, baseType: !30, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !303, file: !2, line: 21, baseType: !30, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !303, file: !2, line: 22, baseType: !297, size: 128, align: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !303, file: !2, line: 23, baseType: !309, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !310, size: 64, align: 64, dwarfAddressSpace: 0)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 88, baseType: !311, align: 8)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 9, size: 704, align: 64, elements: !312, identifier: "std.os.backtrace.Backtrace")
!312 = !{!313, !315, !316, !317, !318, !319, !320}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !311, file: !2, line: 11, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !22)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !311, file: !2, line: 12, baseType: !23, size: 128, align: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !311, file: !2, line: 13, baseType: !23, size: 128, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !311, file: !2, line: 14, baseType: !23, size: 128, align: 64, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !311, file: !2, line: 15, baseType: !98, size: 32, align: 32, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !311, file: !2, line: 16, baseType: !297, size: 128, align: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !311, file: !2, line: 17, baseType: !66, size: 8, align: 8, offset: 640)
!321 = !DILocalVariable(name: "allocator", arg: 1, scope: !294, file: !2, line: 131, type: !297)
!322 = !DILocation(line: 131, column: 44, scope: !294)
!323 = !DILocalVariable(name: "list", arg: 2, scope: !294, file: !2, line: 131, type: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BacktraceList*", baseType: !325, size: 64, align: 64, dwarfAddressSpace: 0)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "BacktraceList", scope: !2, file: !2, line: 88, baseType: !303, align: 8)
!326 = !DILocation(line: 131, column: 70, scope: !294)
!327 = !DILocalVariable(name: "addr", arg: 3, scope: !294, file: !2, line: 131, type: !39)
!328 = !DILocation(line: 131, column: 82, scope: !294)
!329 = !DILocalVariable(name: "buf", scope: !294, file: !2, line: 133, type: !24, align: 8)
!330 = !DILocation(line: 133, column: 9, scope: !294)
!331 = !DILocation(line: 832, column: 41, scope: !332, inlinedAt: !334)
!332 = distinct !DISubprogram(name: "talloc_array", linkageName: "talloc_array", scope: !333, file: !333, line: 830, scopeLine: 830, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!333 = !DIFile(filename: "mem.c3", directory: "/usr/lib/c3c/lib/std/core")
!334 = !DILocation(line: 133, column: 15, scope: !294)
!335 = !DILocation(line: 832, column: 26, scope: !332, inlinedAt: !334)
!336 = !DILocation(line: 832, column: 18, scope: !332, inlinedAt: !334)
!337 = !DILocation(line: 832, column: 68, scope: !332, inlinedAt: !334)
!338 = !DILocation(line: 832, column: 10, scope: !332, inlinedAt: !334)
!339 = !DILocalVariable(name: "exec_path", scope: !294, file: !2, line: 135, type: !23, align: 8)
!340 = !DILocation(line: 135, column: 9, scope: !294)
!341 = !DILocation(line: 135, column: 61, scope: !294)
!342 = !DILocation(line: 135, column: 73, scope: !294)
!343 = !DILocation(line: 135, column: 111, scope: !294)
!344 = !DILocation(line: 135, column: 79, scope: !294)
!345 = !DILocation(line: 135, column: 21, scope: !294)
!346 = !DILocalVariable(name: "obj_name", scope: !294, file: !2, line: 136, type: !23, align: 8)
!347 = !DILocation(line: 136, column: 9, scope: !294)
!348 = !DILocation(line: 136, column: 35, scope: !294)
!349 = !DILocation(line: 136, column: 20, scope: !294)
!350 = !DILocalVariable(name: "addr2line", scope: !294, file: !2, line: 137, type: !23, align: 8)
!351 = !DILocation(line: 137, column: 9, scope: !294)
!352 = !DILocation(line: 137, column: 61, scope: !294)
!353 = !DILocation(line: 137, column: 74, scope: !294)
!354 = !DILocation(line: 137, column: 80, scope: !294)
!355 = !DILocation(line: 137, column: 86, scope: !294)
!356 = !DILocation(line: 137, column: 92, scope: !294)
!357 = !DILocation(line: 137, column: 98, scope: !294)
!358 = !DILocation(line: 137, column: 104, scope: !294)
!359 = !DILocation(line: 137, column: 139, scope: !294)
!360 = !DILocation(line: 137, column: 115, scope: !294)
!361 = !DILocation(line: 137, column: 21, scope: !294)
!362 = !DILocation(line: 138, column: 77, scope: !294)
!363 = !DILocation(line: 138, column: 9, scope: !294)
!364 = distinct !DISubprogram(name: "backtrace_add_from_dlinfo", linkageName: "std.os.linux.backtrace_add_from_dlinfo", scope: !2, file: !2, line: 141, type: !365, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !31)
!365 = !DISubroutineType(types: !366)
!366 = !{!19, !39, !297, !302, !39, !367}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Linux_Dl_info*", baseType: !368, size: 64, align: 64, dwarfAddressSpace: 0)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "Linux_Dl_info", scope: !2, file: !2, line: 84, size: 256, align: 64, elements: !369, identifier: "std.os.linux.Linux_Dl_info")
!369 = !{!370, !372, !373, !374}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "dli_fname", scope: !368, file: !2, line: 86, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !2, file: !2, line: 10, baseType: !27, align: 8)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dli_fbase", scope: !368, file: !2, line: 87, baseType: !39, size: 64, align: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dli_sname", scope: !368, file: !2, line: 88, baseType: !371, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dli_saddr", scope: !368, file: !2, line: 89, baseType: !39, size: 64, align: 64, offset: 192)
!375 = !DILocalVariable(name: "allocator", arg: 1, scope: !364, file: !2, line: 141, type: !297)
!376 = !DILocation(line: 141, column: 46, scope: !364)
!377 = !DILocalVariable(name: "list", arg: 2, scope: !364, file: !2, line: 141, type: !324)
!378 = !DILocation(line: 141, column: 72, scope: !364)
!379 = !DILocalVariable(name: "addr", arg: 3, scope: !364, file: !2, line: 141, type: !39)
!380 = !DILocation(line: 141, column: 84, scope: !364)
!381 = !DILocalVariable(name: "info", arg: 4, scope: !364, file: !2, line: 141, type: !367)
!382 = !DILocation(line: 141, column: 105, scope: !364)
!383 = !DILocalVariable(name: "buf", scope: !364, file: !2, line: 143, type: !24, align: 8)
!384 = !DILocation(line: 143, column: 9, scope: !364)
!385 = !DILocation(line: 832, column: 41, scope: !386, inlinedAt: !387)
!386 = distinct !DISubprogram(name: "talloc_array", linkageName: "talloc_array", scope: !333, file: !333, line: 830, scopeLine: 830, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!387 = !DILocation(line: 143, column: 15, scope: !364)
!388 = !DILocation(line: 832, column: 26, scope: !386, inlinedAt: !387)
!389 = !DILocation(line: 832, column: 18, scope: !386, inlinedAt: !387)
!390 = !DILocation(line: 832, column: 68, scope: !386, inlinedAt: !387)
!391 = !DILocation(line: 832, column: 10, scope: !386, inlinedAt: !387)
!392 = !DILocalVariable(name: "obj_addr", scope: !364, file: !2, line: 145, type: !39, align: 8)
!393 = !DILocation(line: 145, column: 10, scope: !364)
!394 = !DILocation(line: 145, column: 22, scope: !364)
!395 = !DILocation(line: 145, column: 35, scope: !364)
!396 = !DILocation(line: 145, column: 80, scope: !364)
!397 = !DILocation(line: 145, column: 58, scope: !364)
!398 = !DILocalVariable(name: "obj_path", scope: !364, file: !2, line: 146, type: !371, align: 8)
!399 = !DILocation(line: 146, column: 10, scope: !364)
!400 = !DILocation(line: 146, column: 22, scope: !364)
!401 = !DILocalVariable(name: "sname", scope: !364, file: !2, line: 147, type: !23, align: 8)
!402 = !DILocation(line: 147, column: 10, scope: !364)
!403 = !DILocation(line: 147, column: 22, scope: !364)
!404 = !DILocation(line: 147, column: 39, scope: !364)
!405 = !DILocation(line: 147, column: 67, scope: !364)
!406 = !DILocalVariable(name: "addr2line", scope: !364, file: !2, line: 148, type: !23, align: 8)
!407 = !DILocation(line: 148, column: 10, scope: !364)
!408 = !DILocation(line: 148, column: 62, scope: !364)
!409 = !DILocation(line: 148, column: 75, scope: !364)
!410 = !DILocation(line: 148, column: 81, scope: !364)
!411 = !DILocation(line: 148, column: 87, scope: !364)
!412 = !DILocation(line: 148, column: 93, scope: !364)
!413 = !DILocation(line: 148, column: 99, scope: !364)
!414 = !DILocation(line: 148, column: 105, scope: !364)
!415 = !DILocation(line: 148, column: 150, scope: !364)
!416 = !DILocation(line: 148, column: 161, scope: !364)
!417 = !DILocation(line: 148, column: 126, scope: !364)
!418 = !DILocation(line: 148, column: 22, scope: !364)
!419 = !DILocation(line: 149, column: 67, scope: !364)
!420 = !DILocation(line: 149, column: 94, scope: !364)
!421 = !DILocation(line: 149, column: 9, scope: !364)
!422 = distinct !DISubprogram(name: "backtrace_line_parse", linkageName: "std.os.linux.backtrace_line_parse", scope: !2, file: !2, line: 152, type: !423, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !31)
!423 = !DISubroutineType(types: !424)
!424 = !{!19, !425, !297, !23, !23, !23, !66}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Backtrace*", baseType: !311, size: 64, align: 64, dwarfAddressSpace: 0)
!426 = !DILocalVariable(name: "allocator", arg: 1, scope: !422, file: !2, line: 152, type: !297)
!427 = !DILocation(line: 152, column: 46, scope: !422)
!428 = !DILocalVariable(name: "string", arg: 2, scope: !422, file: !2, line: 152, type: !23)
!429 = !DILocation(line: 152, column: 64, scope: !422)
!430 = !DILocalVariable(name: "obj_name", arg: 3, scope: !422, file: !2, line: 152, type: !23)
!431 = !DILocation(line: 152, column: 79, scope: !422)
!432 = !DILocalVariable(name: "func_name", arg: 4, scope: !422, file: !2, line: 152, type: !23)
!433 = !DILocation(line: 152, column: 96, scope: !422)
!434 = !DILocalVariable(name: "is_inlined", arg: 5, scope: !422, file: !2, line: 152, type: !66)
!435 = !DILocation(line: 152, column: 112, scope: !422)
!436 = !DILocalVariable(name: "parts", scope: !422, file: !2, line: 154, type: !437, align: 8)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !438, identifier: "String[]")
!438 = !{!439, !441}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !437, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !437, baseType: !30, size: 64, align: 64, offset: 64)
!442 = !DILocation(line: 154, column: 11, scope: !422)
!443 = !DILocation(line: 198, column: 46, scope: !444, inlinedAt: !446)
!444 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !445, file: !445, line: 198, scopeLine: 198, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!445 = !DIFile(filename: "string.c3", directory: "/usr/lib/c3c/lib/std/core")
!446 = !DILocation(line: 154, column: 19, scope: !422)
!447 = !DILocation(line: 351, column: 79, scope: !448, inlinedAt: !446)
!448 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !445, file: !445, line: 351, scopeLine: 351, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!449 = !DILocation(line: 155, column: 6, scope: !422)
!450 = !DILocation(line: 155, column: 29, scope: !422)
!451 = !DILocalVariable(name: "line", scope: !422, file: !2, line: 157, type: !98, align: 4)
!452 = !DILocation(line: 157, column: 7, scope: !422)
!453 = !DILocation(line: 157, column: 16, scope: !422)
!454 = !DILocalVariable(name: "source", scope: !422, file: !2, line: 158, type: !23, align: 8)
!455 = !DILocation(line: 158, column: 9, scope: !422)
!456 = !DILocation(line: 158, column: 18, scope: !422)
!457 = !DILocation(line: 159, column: 7, scope: !422)
!458 = !DILocation(line: 159, column: 13, scope: !422)
!459 = !DILocation(line: 159, column: 25, scope: !422)
!460 = !DILocation(line: 159, column: 33, scope: !422)
!461 = !DILocation(line: 159, column: 39, scope: !422)
!462 = !DILocation(line: 159, column: 51, scope: !422)
!463 = !DILocalVariable(name: "index", scope: !464, file: !2, line: 161, type: !30, align: 8)
!464 = distinct !DILexicalBlock(scope: !422, file: !2, line: 160, column: 2)
!465 = !DILocation(line: 161, column: 7, scope: !464)
!466 = !DILocation(line: 161, column: 15, scope: !464)
!467 = !DILocation(line: 161, column: 21, scope: !464)
!468 = !DILocation(line: 162, column: 12, scope: !464)
!469 = !DILocation(line: 162, column: 18, scope: !464)
!470 = !DILocation(line: 162, column: 21, scope: !464)
!471 = !DILocation(line: 162, column: 22, scope: !464)
!472 = !DILocation(line: 163, column: 12, scope: !464)
!473 = !DILocation(line: 163, column: 18, scope: !464)
!474 = !DILocation(line: 163, column: 21, scope: !464)
!475 = !DILocation(line: 166, column: 18, scope: !422)
!476 = !DILocation(line: 166, column: 24, scope: !422)
!477 = !DILocation(line: 166, column: 32, scope: !422)
!478 = !DILocation(line: 167, column: 32, scope: !422)
!479 = !DILocation(line: 167, column: 18, scope: !422)
!480 = !DILocation(line: 168, column: 30, scope: !422)
!481 = !DILocation(line: 168, column: 18, scope: !422)
!482 = !DILocation(line: 169, column: 18, scope: !422)
!483 = !DILocation(line: 170, column: 18, scope: !422)
!484 = !DILocation(line: 171, column: 18, scope: !422)
!485 = distinct !DISubprogram(name: "backtrace_add_addr2line", linkageName: "std.os.linux.backtrace_add_addr2line", scope: !2, file: !2, line: 174, type: !486, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !31)
!486 = !DISubroutineType(types: !487)
!487 = !{!19, !39, !297, !302, !39, !23, !23, !23}
!488 = !DILocalVariable(name: "allocator", arg: 1, scope: !485, file: !2, line: 174, type: !297)
!489 = !DILocation(line: 174, column: 44, scope: !485)
!490 = !DILocalVariable(name: "list", arg: 2, scope: !485, file: !2, line: 174, type: !324)
!491 = !DILocation(line: 174, column: 70, scope: !485)
!492 = !DILocalVariable(name: "addr", arg: 3, scope: !485, file: !2, line: 174, type: !39)
!493 = !DILocation(line: 174, column: 82, scope: !485)
!494 = !DILocalVariable(name: "addr2line", arg: 4, scope: !485, file: !2, line: 174, type: !23)
!495 = !DILocation(line: 174, column: 95, scope: !485)
!496 = !DILocalVariable(name: "obj_name", arg: 5, scope: !485, file: !2, line: 174, type: !23)
!497 = !DILocation(line: 174, column: 113, scope: !485)
!498 = !DILocalVariable(name: "func_name", arg: 6, scope: !485, file: !2, line: 174, type: !23)
!499 = !DILocation(line: 174, column: 130, scope: !485)
!500 = !DILocalVariable(name: "inline_parts", scope: !485, file: !2, line: 176, type: !437, align: 8)
!501 = !DILocation(line: 176, column: 11, scope: !485)
!502 = !DILocation(line: 351, column: 79, scope: !503, inlinedAt: !504)
!503 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !445, file: !445, line: 351, scopeLine: 351, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!504 = !DILocation(line: 176, column: 26, scope: !485)
!505 = !DILocalVariable(name: "last", scope: !485, file: !2, line: 177, type: !30, align: 8)
!506 = !DILocation(line: 177, column: 6, scope: !485)
!507 = !DILocation(line: 177, column: 13, scope: !485)
!508 = !DILocation(line: 178, column: 21, scope: !509)
!509 = distinct !DILexicalBlock(scope: !485, file: !2, line: 178, column: 2)
!510 = !DILocalVariable(name: ".temp", scope: !509, file: !2, line: 178, type: !30, align: 8)
!511 = !DILocation(line: 178, column: 11, scope: !509)
!512 = !DILocalVariable(name: "i", scope: !513, file: !2, line: 178, type: !30, align: 8)
!513 = distinct !DILexicalBlock(scope: !509, file: !2, line: 179, column: 2)
!514 = !DILocation(line: 178, column: 11, scope: !513)
!515 = !DILocalVariable(name: "part", scope: !513, file: !2, line: 178, type: !23, align: 8)
!516 = !DILocation(line: 178, column: 14, scope: !513)
!517 = !DILocation(line: 178, column: 21, scope: !513)
!518 = !DILocalVariable(name: "is_inline", scope: !519, file: !2, line: 180, type: !66, align: 1)
!519 = distinct !DILexicalBlock(scope: !513, file: !2, line: 179, column: 2)
!520 = !DILocation(line: 180, column: 8, scope: !519)
!521 = !DILocation(line: 180, column: 20, scope: !519)
!522 = !DILocation(line: 180, column: 25, scope: !519)
!523 = !DILocalVariable(name: "trace", scope: !519, file: !2, line: 181, type: !311, align: 8)
!524 = !DILocation(line: 181, column: 14, scope: !519)
!525 = !DILocation(line: 181, column: 22, scope: !519)
!526 = !DILocation(line: 182, column: 13, scope: !519)
!527 = !DILocation(line: 185, column: 35, scope: !528)
!528 = distinct !DILexicalBlock(scope: !519, file: !2, line: 183, column: 3)
!529 = !DILocation(line: 185, column: 20, scope: !528)
!530 = !DILocation(line: 186, column: 34, scope: !528)
!531 = !DILocation(line: 186, column: 20, scope: !528)
!532 = !DILocation(line: 187, column: 20, scope: !528)
!533 = !DILocation(line: 188, column: 28, scope: !528)
!534 = !DILocation(line: 188, column: 20, scope: !528)
!535 = !DILocation(line: 189, column: 20, scope: !528)
!536 = !DILocation(line: 190, column: 20, scope: !528)
!537 = !DILocation(line: 191, column: 20, scope: !528)
!538 = !DILocation(line: 184, column: 4, scope: !528)
!539 = !DILocation(line: 193, column: 4, scope: !528)
!540 = !DILocation(line: 195, column: 13, scope: !519)
!541 = !DILocation(line: 195, column: 3, scope: !519)
!542 = distinct !DISubprogram(name: "backtrace_add_element", linkageName: "std.os.linux.backtrace_add_element", scope: !2, file: !2, line: 199, type: !295, scopeLine: 199, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !31)
!543 = !DILocalVariable(name: "allocator", arg: 1, scope: !542, file: !2, line: 199, type: !297)
!544 = !DILocation(line: 199, column: 42, scope: !542)
!545 = !DILocalVariable(name: "list", arg: 2, scope: !542, file: !2, line: 199, type: !324)
!546 = !DILocation(line: 199, column: 68, scope: !542)
!547 = !DILocalVariable(name: "addr", arg: 3, scope: !542, file: !2, line: 199, type: !39)
!548 = !DILocation(line: 199, column: 80, scope: !542)
!549 = !DILocation(line: 201, column: 6, scope: !542)
!550 = !DILocation(line: 203, column: 13, scope: !551)
!551 = distinct !DILexicalBlock(scope: !542, file: !2, line: 202, column: 2)
!552 = !DILocation(line: 203, column: 3, scope: !551)
!553 = !DILocalVariable(name: "state", scope: !554, file: !2, line: 594, type: !555, align: 8)
!554 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !333, file: !333, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !31)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 402, baseType: !556, align: 8)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !557, size: 64, align: 64, dwarfAddressSpace: 0)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 32, size: 512, align: 64, elements: !558, identifier: "std.core.mem.allocator.TempAllocator")
!558 = !{!559, !560, !572, !573, !574, !575, !576, !577}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !557, file: !2, line: 34, baseType: !297, size: 128, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !557, file: !2, line: 35, baseType: !561, size: 64, align: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !562, size: 64, align: 64, dwarfAddressSpace: 0)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 52, size: 256, align: 64, elements: !563, identifier: "std.core.mem.allocator.TempAllocatorPage")
!563 = !{!564, !565, !566, !567, !568}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !562, file: !2, line: 54, baseType: !561, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !562, file: !2, line: 55, baseType: !39, size: 64, align: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !562, file: !2, line: 56, baseType: !30, size: 64, align: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !562, file: !2, line: 57, baseType: !30, size: 64, align: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !562, file: !2, line: 58, baseType: !569, align: 8, offset: 256)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, align: 8, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 0, lowerBound: 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !557, file: !2, line: 36, baseType: !556, size: 64, align: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !557, file: !2, line: 37, baseType: !66, size: 8, align: 8, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !557, file: !2, line: 38, baseType: !30, size: 64, align: 64, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !557, file: !2, line: 39, baseType: !30, size: 64, align: 64, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !557, file: !2, line: 40, baseType: !30, size: 64, align: 64, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !557, file: !2, line: 41, baseType: !569, align: 8, offset: 512)
!578 = !DILocation(line: 594, column: 12, scope: !554, inlinedAt: !579)
!579 = !DILocation(line: 207, column: 2, scope: !542)
!580 = !DILocation(line: 594, column: 20, scope: !554, inlinedAt: !579)
!581 = !DILocalVariable(name: "info", scope: !582, file: !2, line: 209, type: !368, align: 8)
!582 = distinct !DILexicalBlock(scope: !542, file: !2, line: 208, column: 2)
!583 = !DILocation(line: 209, column: 17, scope: !582)
!584 = !DILocation(line: 210, column: 21, scope: !582)
!585 = !DILocation(line: 210, column: 7, scope: !582)
!586 = !DILocation(line: 212, column: 52, scope: !587)
!587 = distinct !DILexicalBlock(scope: !582, file: !2, line: 211, column: 3)
!588 = !DILocation(line: 212, column: 11, scope: !587)
!589 = !DILocation(line: 597, column: 23, scope: !590, inlinedAt: !579)
!590 = distinct !DILexicalBlock(scope: !554, file: !333, line: 596, column: 2)
!591 = !DILocation(line: 597, column: 3, scope: !590, inlinedAt: !579)
!592 = !DILocation(line: 597, column: 23, scope: !593, inlinedAt: !579)
!593 = distinct !DILexicalBlock(scope: !554, file: !333, line: 596, column: 2)
!594 = !DILocation(line: 597, column: 3, scope: !593, inlinedAt: !579)
!595 = !DILocation(line: 214, column: 60, scope: !582)
!596 = !DILocation(line: 214, column: 10, scope: !582)
!597 = !DILocation(line: 597, column: 23, scope: !598, inlinedAt: !579)
!598 = distinct !DILexicalBlock(scope: !554, file: !333, line: 596, column: 2)
!599 = !DILocation(line: 597, column: 3, scope: !598, inlinedAt: !579)
!600 = !DILocation(line: 597, column: 23, scope: !601, inlinedAt: !579)
!601 = distinct !DILexicalBlock(scope: !554, file: !333, line: 596, column: 2)
!602 = !DILocation(line: 597, column: 3, scope: !601, inlinedAt: !579)
!603 = distinct !DISubprogram(name: "symbolize_backtrace", linkageName: "std.os.linux.symbolize_backtrace", scope: !2, file: !2, line: 218, type: !604, scopeLine: 218, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !31)
!604 = !DISubroutineType(types: !605)
!605 = !{!19, !324, !297, !606}
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !607, identifier: "void*[]")
!607 = !{!608, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !606, baseType: !609, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !606, baseType: !30, size: 64, align: 64, offset: 64)
!611 = !DILocalVariable(name: "allocator", arg: 1, scope: !603, file: !2, line: 218, type: !297)
!612 = !DILocation(line: 218, column: 49, scope: !603)
!613 = !DILocalVariable(name: "backtrace", arg: 2, scope: !603, file: !2, line: 218, type: !606)
!614 = !DILocation(line: 218, column: 68, scope: !603)
!615 = !DILocalVariable(name: "list", scope: !603, file: !2, line: 220, type: !325, align: 8)
!616 = !DILocation(line: 220, column: 16, scope: !603)
!617 = !DILocation(line: 221, column: 23, scope: !603)
!618 = !DILocation(line: 221, column: 2, scope: !603)
!619 = !DILocalVariable(name: "state", scope: !620, file: !2, line: 594, type: !555, align: 8)
!620 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !333, file: !333, line: 592, scopeLine: 592, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !31)
!621 = !DILocation(line: 594, column: 12, scope: !620, inlinedAt: !622)
!622 = !DILocation(line: 230, column: 2, scope: !603)
!623 = !DILocation(line: 594, column: 20, scope: !620, inlinedAt: !622)
!624 = !DILocation(line: 232, column: 19, scope: !625)
!625 = distinct !DILexicalBlock(scope: !626, file: !2, line: 232, column: 3)
!626 = distinct !DILexicalBlock(scope: !603, file: !2, line: 231, column: 2)
!627 = !DILocalVariable(name: ".temp", scope: !625, file: !2, line: 232, type: !30, align: 8)
!628 = !DILocalVariable(name: "addr", scope: !629, file: !2, line: 232, type: !39, align: 8)
!629 = distinct !DILexicalBlock(scope: !625, file: !2, line: 233, column: 3)
!630 = !DILocation(line: 232, column: 12, scope: !629)
!631 = !DILocation(line: 232, column: 19, scope: !629)
!632 = !DILocation(line: 234, column: 44, scope: !633)
!633 = distinct !DILexicalBlock(scope: !629, file: !2, line: 233, column: 3)
!634 = !DILocation(line: 234, column: 4, scope: !633)
!635 = !DILocation(line: 597, column: 23, scope: !636, inlinedAt: !622)
!636 = distinct !DILexicalBlock(scope: !620, file: !333, line: 596, column: 2)
!637 = !DILocation(line: 597, column: 3, scope: !636, inlinedAt: !622)
!638 = !DILocation(line: 224, column: 20, scope: !639)
!639 = distinct !DILexicalBlock(scope: !640, file: !2, line: 224, column: 3)
!640 = distinct !DILexicalBlock(scope: !603, file: !2, line: 223, column: 2)
!641 = !DILocalVariable(name: ".temp", scope: !639, file: !2, line: 224, type: !30, align: 8)
!642 = !DILocalVariable(name: "trace", scope: !643, file: !2, line: 224, type: !310, align: 8)
!643 = distinct !DILexicalBlock(scope: !639, file: !2, line: 225, column: 3)
!644 = !DILocation(line: 224, column: 12, scope: !643)
!645 = !DILocation(line: 378, column: 26, scope: !646, inlinedAt: !644)
!646 = distinct !DILexicalBlock(scope: !648, file: !647, line: 379, column: 1)
!647 = !DIFile(filename: "list.c3", directory: "/usr/lib/c3c/lib/std/collections")
!648 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !647, file: !647, line: 378, scopeLine: 378, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!649 = !DILocation(line: 376, column: 11, scope: !646, inlinedAt: !644)
!650 = !DILocation(line: 376, column: 19, scope: !646, inlinedAt: !644)
!651 = !DILocation(line: 224, column: 12, scope: !646, inlinedAt: !644)
!652 = !DILocation(line: 380, column: 9, scope: !648, inlinedAt: !644)
!653 = !DILocation(line: 380, column: 22, scope: !648, inlinedAt: !644)
!654 = !DILocation(line: 226, column: 4, scope: !655)
!655 = distinct !DILexicalBlock(scope: !643, file: !2, line: 225, column: 3)
!656 = !DILocation(line: 228, column: 3, scope: !640)
!657 = !DILocation(line: 597, column: 23, scope: !658, inlinedAt: !622)
!658 = distinct !DILexicalBlock(scope: !620, file: !333, line: 596, column: 2)
!659 = !DILocation(line: 597, column: 3, scope: !658, inlinedAt: !622)
!660 = !DILocation(line: 237, column: 9, scope: !603)
