; ModuleID = 'std::collections::object'
source_filename = "std::collections::object"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%Object = type { i64, %any, %.anon }
%.anon = type { i128, [32 x i8] }
%"char[]" = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%"char[][]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%HashMap = type { %"Entry*[]", %any, i32, i32, float }
%"Entry*[]" = type { ptr, i64 }

$std.collections.object.Object.to_format = comdat any

$std.collections.object.Object.free = comdat any

$std.collections.object.Object.is_null = comdat any

$std.collections.object.Object.is_empty = comdat any

$std.collections.object.Object.is_map = comdat any

$std.collections.object.Object.is_array = comdat any

$std.collections.object.Object.is_bool = comdat any

$std.collections.object.Object.is_string = comdat any

$std.collections.object.Object.is_float = comdat any

$std.collections.object.Object.is_int = comdat any

$std.collections.object.Object.is_keyable = comdat any

$std.collections.object.Object.is_indexable = comdat any

$std.collections.object.Object.set_object = comdat any

$std.collections.object.Object.get = comdat any

$std.collections.object.Object.has_key = comdat any

$std.collections.object.Object.get_at = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "TRUE_OBJECT", linkageName: "std.collections.object.TRUE_OBJECT", scope: !2, file: !2, line: 7, type: !3, isLocal: false, isDefinition: true, align: 16)
!2 = !DIFile(filename: "object.c3", directory: "/usr/lib/c3c/lib/std/collections")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !2, file: !2, line: 11, size: 640, align: 128, elements: !4, identifier: "std.collections.object.Object")
!4 = !{!5, !7, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !3, file: !2, line: 13, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!7 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !3, file: !2, line: 14, baseType: !8, size: 128, align: 64, offset: 64)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !9, identifier: "Allocator")
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !8, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !8, baseType: !6, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, scope: !3, file: !2, line: 15, baseType: !14, size: 384, align: 128, offset: 256)
!14 = !DICompositeType(tag: DW_TAG_union_type, scope: !3, file: !2, line: 15, size: 384, align: 128, elements: !15)
!15 = !{!16, !18, !20, !22, !32, !33, !44}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !14, file: !2, line: 17, baseType: !17, size: 128, align: 128)
!17 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !14, file: !2, line: 18, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !14, file: !2, line: 19, baseType: !21, size: 8, align: 8)
!21 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !14, file: !2, line: 20, baseType: !23, size: 128, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !25, identifier: "char[]")
!25 = !{!26, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !24, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !24, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !31)
!31 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !14, file: !2, line: 21, baseType: !11, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !14, file: !2, line: 22, baseType: !34, size: 320, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !2, file: !2, line: 469, baseType: !35, align: 8)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !36, identifier: "std_collections_list$p$std.collections.object.Object$.List")
!36 = !{!37, !38, !39, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !35, file: !2, line: 20, baseType: !30, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !35, file: !2, line: 21, baseType: !30, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !35, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !35, file: !2, line: 23, baseType: !41, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 469, baseType: !43, align: 8)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !14, file: !2, line: 23, baseType: !45, size: 384, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !2, file: !2, line: 468, baseType: !46, align: 8)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !2, file: !2, line: 29, size: 384, align: 64, elements: !47, identifier: "std_collections_map$String$p$std.collections.object.Object$.HashMap")
!47 = !{!48, !64, !65, !66, !67}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !46, file: !2, line: 31, baseType: !49, size: 128, align: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !50, identifier: "Entry*[]")
!50 = !{!51, !63}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !49, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !2, file: !2, line: 21, size: 320, align: 64, elements: !55, identifier: "std_collections_map$String$p$std.collections.object.Object$.Entry")
!55 = !{!56, !58, !60, !62}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !54, file: !2, line: 23, baseType: !57, size: 32, align: 32)
!57 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !54, file: !2, line: 24, baseType: !59, size: 128, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !2, file: !2, line: 468, baseType: !23, align: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !54, file: !2, line: 25, baseType: !61, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !2, file: !2, line: 468, baseType: !43, align: 8)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !2, line: 26, baseType: !53, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, baseType: !30, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !46, file: !2, line: 32, baseType: !8, size: 128, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !46, file: !2, line: 33, baseType: !57, size: 32, align: 32, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !46, file: !2, line: 34, baseType: !57, size: 32, align: 32, offset: 288)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !46, file: !2, line: 35, baseType: !68, size: 32, align: 32, offset: 320)
!68 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "FALSE_OBJECT", linkageName: "std.collections.object.FALSE_OBJECT", scope: !2, file: !2, line: 8, type: !3, isLocal: false, isDefinition: true, align: 16)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "NULL_OBJECT", linkageName: "std.collections.object.NULL_OBJECT", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 16)
!73 = !{i32 2, !"Dwarf Version", i32 4}
!74 = !{i32 2, !"Debug Info Version", i32 3}
!75 = !{i32 2, !"wchar_size", i32 4}
!76 = !{i32 4, !"PIE Level", i32 2}
!77 = !{i32 4, !"PIC Level", i32 2}
!78 = !{i32 1, !"uwtable", i32 2}
!79 = !{i32 2, !"frame-pointer", i32 2}
!80 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !81, splitDebugInlining: false)
!81 = !{!0, !69, !71}
!82 = distinct !DISubprogram(name: "to_format", linkageName: "std.collections.object.Object.to_format", scope: !2, file: !2, line: 28, type: !83, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !80, retainedNodes: !105)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !87, !43, !88}
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !86)
!86 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 63, size: 384, align: 64, elements: !90, identifier: "std.io.Formatter")
!90 = !{!91, !92, !97}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !89, file: !2, line: 65, baseType: !11, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !89, file: !2, line: 66, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 16, baseType: !94, align: 8)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !95, size: 64, align: 64, dwarfAddressSpace: 0)
!95 = !DISubroutineType(types: !96)
!96 = !{!85, !11, !11, !28}
!97 = !DIDerivedType(tag: DW_TAG_member, scope: !89, file: !2, line: 67, baseType: !98, size: 256, align: 64, offset: 128)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !89, file: !2, line: 67, size: 256, align: 64, elements: !99)
!99 = !{!100, !101, !102, !103, !104}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !98, file: !2, line: 69, baseType: !57, size: 32, align: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !98, file: !2, line: 70, baseType: !57, size: 32, align: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !98, file: !2, line: 71, baseType: !57, size: 32, align: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !98, file: !2, line: 72, baseType: !30, size: 64, align: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !98, file: !2, line: 73, baseType: !85, size: 64, align: 64, offset: 192)
!105 = !{}
!106 = !DILocation(line: 29, column: 1, scope: !82)
!107 = !DILocalVariable(name: "self", arg: 1, scope: !82, file: !2, line: 28, type: !43)
!108 = !DILocation(line: 28, column: 26, scope: !82)
!109 = !DILocalVariable(name: "formatter", arg: 2, scope: !82, file: !2, line: 28, type: !88)
!110 = !DILocation(line: 28, column: 44, scope: !82)
!111 = !DILocation(line: 30, column: 10, scope: !112)
!112 = distinct !DILexicalBlock(scope: !82, file: !2, line: 30, column: 2)
!113 = !DILocation(line: 32, column: 8, scope: !112)
!114 = !DILocation(line: 33, column: 11, scope: !115)
!115 = distinct !DILexicalBlock(scope: !112, file: !2, line: 33, column: 4)
!116 = !DILocation(line: 34, column: 8, scope: !112)
!117 = !DILocation(line: 35, column: 11, scope: !118)
!118 = distinct !DILexicalBlock(scope: !112, file: !2, line: 35, column: 4)
!119 = !DILocation(line: 36, column: 8, scope: !112)
!120 = !DILocation(line: 37, column: 36, scope: !121)
!121 = distinct !DILexicalBlock(scope: !112, file: !2, line: 37, column: 4)
!122 = !DILocation(line: 37, column: 11, scope: !121)
!123 = !DILocation(line: 38, column: 8, scope: !112)
!124 = !DILocation(line: 39, column: 28, scope: !125)
!125 = distinct !DILexicalBlock(scope: !112, file: !2, line: 39, column: 4)
!126 = !DILocation(line: 39, column: 46, scope: !125)
!127 = !DILocation(line: 39, column: 11, scope: !125)
!128 = !DILocation(line: 40, column: 8, scope: !112)
!129 = !DILocalVariable(name: "n", scope: !130, file: !2, line: 41, type: !30, align: 8)
!130 = distinct !DILexicalBlock(scope: !112, file: !2, line: 41, column: 4)
!131 = !DILocation(line: 41, column: 8, scope: !130)
!132 = !DILocation(line: 41, column: 12, scope: !130)
!133 = !DILocation(line: 42, column: 21, scope: !134)
!134 = distinct !DILexicalBlock(scope: !130, file: !2, line: 42, column: 4)
!135 = !DILocalVariable(name: ".temp", scope: !134, file: !2, line: 42, type: !30, align: 8)
!136 = !DILocation(line: 42, column: 13, scope: !134)
!137 = !DILocalVariable(name: "i", scope: !138, file: !2, line: 42, type: !30, align: 8)
!138 = distinct !DILexicalBlock(scope: !134, file: !2, line: 43, column: 4)
!139 = !DILocation(line: 42, column: 13, scope: !138)
!140 = !DILocalVariable(name: "ol", scope: !138, file: !2, line: 42, type: !42, align: 8)
!141 = !DILocation(line: 42, column: 16, scope: !138)
!142 = !DILocation(line: 378, column: 26, scope: !143, inlinedAt: !141)
!143 = distinct !DILexicalBlock(scope: !145, file: !144, line: 379, column: 1)
!144 = !DIFile(filename: "list.c3", directory: "/usr/lib/c3c/lib/std/collections")
!145 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !144, file: !144, line: 378, scopeLine: 378, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !80)
!146 = !DILocation(line: 376, column: 11, scope: !143, inlinedAt: !141)
!147 = !DILocation(line: 376, column: 19, scope: !143, inlinedAt: !141)
!148 = !DILocation(line: 42, column: 16, scope: !143, inlinedAt: !141)
!149 = !DILocation(line: 380, column: 9, scope: !145, inlinedAt: !141)
!150 = !DILocation(line: 380, column: 22, scope: !145, inlinedAt: !141)
!151 = !DILocation(line: 44, column: 9, scope: !152)
!152 = distinct !DILexicalBlock(scope: !138, file: !2, line: 43, column: 4)
!153 = !DILocation(line: 44, column: 16, scope: !152)
!154 = !DILocation(line: 44, column: 21, scope: !152)
!155 = !DILocation(line: 45, column: 5, scope: !152)
!156 = !DILocation(line: 45, column: 10, scope: !152)
!157 = !DILocation(line: 47, column: 4, scope: !130)
!158 = !DILocation(line: 47, column: 9, scope: !130)
!159 = !DILocation(line: 48, column: 11, scope: !130)
!160 = !DILocation(line: 49, column: 8, scope: !112)
!161 = !DILocalVariable(name: "n", scope: !162, file: !2, line: 50, type: !30, align: 8)
!162 = distinct !DILexicalBlock(scope: !112, file: !2, line: 50, column: 4)
!163 = !DILocation(line: 50, column: 8, scope: !162)
!164 = !DILocation(line: 50, column: 12, scope: !162)
!165 = !DILocalVariable(name: "buffer", scope: !166, file: !2, line: 544, type: !168, align: 16)
!166 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !167, file: !167, line: 542, scopeLine: 542, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !80, retainedNodes: !105)
!167 = !DIFile(filename: "mem.c3", directory: "/usr/lib/c3c/lib/std/core")
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8192, align: 8, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 1024, lowerBound: 0)
!171 = !DILocation(line: 544, column: 14, scope: !166, inlinedAt: !172)
!172 = !DILocation(line: 51, column: 4, scope: !162)
!173 = !DILocalVariable(name: "allocator", scope: !166, file: !2, line: 545, type: !174, align: 8)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 12, size: 384, align: 64, elements: !175, identifier: "std.core.mem.allocator.OnStackAllocator")
!175 = !{!176, !177, !178, !179}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !174, file: !2, line: 14, baseType: !8, size: 128, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !174, file: !2, line: 15, baseType: !24, size: 128, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !174, file: !2, line: 16, baseType: !30, size: 64, align: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !174, file: !2, line: 17, baseType: !180, size: 64, align: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !181, size: 64, align: 64, dwarfAddressSpace: 0)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !182, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!182 = !{!183, !184, !185}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !181, file: !2, line: 22, baseType: !21, size: 8, align: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !181, file: !2, line: 23, baseType: !180, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !2, line: 24, baseType: !11, size: 64, align: 64, offset: 128)
!186 = !DILocation(line: 545, column: 19, scope: !166, inlinedAt: !172)
!187 = !DILocation(line: 546, column: 18, scope: !166, inlinedAt: !172)
!188 = !DILocation(line: 546, column: 26, scope: !166, inlinedAt: !172)
!189 = !DILocation(line: 546, column: 2, scope: !166, inlinedAt: !172)
!190 = !DILocalVariable(name: "mem", scope: !162, file: !2, line: 51, type: !8, align: 8)
!191 = !DILocation(line: 51, column: 31, scope: !162)
!192 = !DILocation(line: 548, column: 8, scope: !193, inlinedAt: !172)
!193 = distinct !DILexicalBlock(scope: !166, file: !167, line: 548, column: 2)
!194 = !DILocation(line: 53, column: 23, scope: !195)
!195 = distinct !DILexicalBlock(scope: !196, file: !2, line: 53, column: 5)
!196 = distinct !DILexicalBlock(scope: !162, file: !2, line: 52, column: 4)
!197 = !DILocation(line: 53, column: 37, scope: !195)
!198 = !DILocalVariable(name: ".temp", scope: !195, file: !2, line: 53, type: !30, align: 8)
!199 = !DILocation(line: 53, column: 14, scope: !195)
!200 = !DILocalVariable(name: "i", scope: !201, file: !2, line: 53, type: !30, align: 8)
!201 = distinct !DILexicalBlock(scope: !195, file: !2, line: 54, column: 5)
!202 = !DILocation(line: 53, column: 14, scope: !201)
!203 = !DILocalVariable(name: "key", scope: !201, file: !2, line: 53, type: !23, align: 8)
!204 = !DILocation(line: 53, column: 17, scope: !201)
!205 = !DILocation(line: 53, column: 23, scope: !201)
!206 = !DILocation(line: 55, column: 10, scope: !207)
!207 = distinct !DILexicalBlock(scope: !201, file: !2, line: 54, column: 5)
!208 = !DILocation(line: 55, column: 17, scope: !207)
!209 = !DILocation(line: 55, column: 22, scope: !207)
!210 = !DILocation(line: 547, column: 8, scope: !211, inlinedAt: !172)
!211 = distinct !DILexicalBlock(scope: !166, file: !167, line: 547, column: 8)
!212 = !DILocation(line: 56, column: 6, scope: !207)
!213 = !DILocation(line: 56, column: 37, scope: !207)
!214 = !DILocation(line: 56, column: 11, scope: !207)
!215 = !DILocation(line: 547, column: 8, scope: !216, inlinedAt: !172)
!216 = distinct !DILexicalBlock(scope: !166, file: !167, line: 547, column: 8)
!217 = !DILocation(line: 57, column: 6, scope: !207)
!218 = !DILocation(line: 57, column: 11, scope: !207)
!219 = !DILocation(line: 547, column: 8, scope: !220, inlinedAt: !172)
!220 = distinct !DILexicalBlock(scope: !166, file: !167, line: 547, column: 8)
!221 = !DILocation(line: 547, column: 8, scope: !222, inlinedAt: !172)
!222 = distinct !DILexicalBlock(scope: !166, file: !167, line: 547, column: 8)
!223 = !DILocation(line: 60, column: 4, scope: !162)
!224 = !DILocation(line: 60, column: 9, scope: !162)
!225 = !DILocation(line: 61, column: 11, scope: !162)
!226 = !DILocation(line: 63, column: 12, scope: !227)
!227 = distinct !DILexicalBlock(scope: !228, file: !2, line: 63, column: 4)
!228 = distinct !DILexicalBlock(scope: !112, file: !2, line: 63, column: 4)
!229 = !DILocation(line: 66, column: 44, scope: !230)
!230 = distinct !DILexicalBlock(scope: !227, file: !2, line: 66, column: 6)
!231 = !DILocation(line: 66, column: 36, scope: !230)
!232 = !DILocation(line: 66, column: 13, scope: !230)
!233 = !DILocation(line: 68, column: 45, scope: !234)
!234 = distinct !DILexicalBlock(scope: !227, file: !2, line: 68, column: 6)
!235 = !DILocation(line: 68, column: 36, scope: !234)
!236 = !DILocation(line: 68, column: 13, scope: !234)
!237 = !DILocation(line: 70, column: 36, scope: !238)
!238 = distinct !DILexicalBlock(scope: !227, file: !2, line: 70, column: 6)
!239 = !DILocation(line: 70, column: 13, scope: !238)
!240 = !DILocation(line: 72, column: 36, scope: !241)
!241 = distinct !DILexicalBlock(scope: !227, file: !2, line: 72, column: 6)
!242 = !DILocation(line: 72, column: 13, scope: !241)
!243 = !DILocation(line: 74, column: 13, scope: !244)
!244 = distinct !DILexicalBlock(scope: !227, file: !2, line: 74, column: 6)
